{"name": "kd45 reasoning", "description": "Decide if one statement entails the next", "examples": [{"input": "Premise: Amelia sees that A person in shorts is holding a Frisbee while team member in red shirts and spectators look on. Hypothesis: Amelia knows that they see that A person in shorts is holding a Frisbee while team member in red shirts and spectators look on.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph learns that Three men converse in a crowd. Hypothesis: Joseph recognizes that they learn that Three men converse in a crowd.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia sees that a woman holding a child in a purple shirt Hypothesis: Amelia believes that they see that a woman holding a child in a purple shirt", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail learns that Two women are standing under an umbrella together, in front of a bandstand. Hypothesis: Abigail recognizes that they learn that Two women are standing under an umbrella together, in front of a bandstand.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia assumes that A young women carrying some wooden cases, walking down the street and passing a street performer. Hypothesis: Amelia thinks that they assume that A young women carrying some wooden cases, walking down the street and passing a street performer.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia recognizes that A photographer with bushy dark hair takes a photo of a skateboarder at an indoor park. Hypothesis: Sophia recognizes that they recognize that A photographer with bushy dark hair takes a photo of a skateboarder at an indoor park.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava assumes that An Asian man in colorful robes holds a bell and leans toward a small table, with Buddhist or Hindu decorations on the table and the walls. Hypothesis: Ava understands that they assume that An Asian man in colorful robes holds a bell and leans toward a small table, with Buddhist or Hindu decorations on the table and the walls.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John suspects that A race dog numbered six is midair. Hypothesis: John understands that they suspect that A race dog numbered six is midair.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn recognizes that A man wearing an orange hard hat is being lowered down the side of a building. Hypothesis: Evelyn knows that they recognize that A man wearing an orange hard hat is being lowered down the side of a building.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas assumes that A woman building herself a sand castle. Hypothesis: Thomas thinks that they assume that A woman building herself a sand castle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard learns that A blond girl with a graphic t-shirt wheeling a wheelbarrow across a lawn. Hypothesis: Richard believes that they learn that A blond girl with a graphic t-shirt wheeling a wheelbarrow across a lawn.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma believes that A lady reading a story book. Hypothesis: Emma thinks that they believe that A lady reading a story book.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles sees that A photographer snaps a midair action shot of a snowboarder. Hypothesis: Charles believes that they see that A photographer snaps a midair action shot of a snowboarder.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn remembers that People are talking to a camera crew with video and microphone. Hypothesis: Evelyn thinks that they remember that People are talking to a camera crew with video and microphone.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph sees that A black dog carrying a hanging flower pot. Hypothesis: Joseph thinks that they see that A black dog carrying a hanging flower pot.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard believes that A dog owner is running along side his pet while the pet avoids obstacles on a course. Hypothesis: Richard recognizes that they believe that A dog owner is running along side his pet while the pet avoids obstacles on a course.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte remembers that A white-haired conductor is standing in front of an orchestra which is also standing, instruments in hand. Hypothesis: Charlotte believes that they remember that A white-haired conductor is standing in front of an orchestra which is also standing, instruments in hand.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert assumes that The woman in the blue skirt is sleeping on a cardboard box under a picture of Mary and baby Jesus. Hypothesis: Robert thinks that they assume that The woman in the blue skirt is sleeping on a cardboard box under a picture of Mary and baby Jesus.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard believes that A shirtless man is cooking on an outdoor grill. Hypothesis: Richard understands that they believe that A shirtless man is cooking on an outdoor grill.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia believes that A young man trying to buy a car from his dealer after his old car was towed away by police. Hypothesis: Amelia understands that they believe that A young man trying to buy a car from his dealer after his old car was towed away by police.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn knows that Young lady during a performance of modern dance. Hypothesis: Evelyn recognizes that they know that Young lady during a performance of modern dance.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles assumes that A man is wearing a hard hat and orange jacket standing in front of a red ladder. Hypothesis: Charles believes that they assume that A man is wearing a hard hat and orange jacket standing in front of a red ladder.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia thinks that A young woman tennis player dressed in black carries many tennis balls on her racket. Hypothesis: Olivia recognizes that they think that A young woman tennis player dressed in black carries many tennis balls on her racket.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava remembers that A man standing in a stairwell with a green strip on the wall. Hypothesis: Ava knows that they remember that A man standing in a stairwell with a green strip on the wall.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella thinks that A band performing with a girl singing and a guy next to her singing as well while playing the guitar Hypothesis: Isabella thinks that they think that A band performing with a girl singing and a guy next to her singing as well while playing the guitar", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor believes that A musician with short blond-hair and wearing a blue scarf and vest plays a string instrument while singing. Hypothesis: Taylor knows that they believe that A musician with short blond-hair and wearing a blue scarf and vest plays a string instrument while singing.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that A group of children playing and having a good time. Hypothesis: Charles thinks that they suspect that A group of children playing and having a good time.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles recognizes that Two young people in jeans looking at each other. Hypothesis: Charles recognizes that they recognize that Two young people in jeans looking at each other.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte recognizes that A girl in sunglasses smiles. Hypothesis: Charlotte recognizes that they recognize that A girl in sunglasses smiles.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma knows that A rock climber climbs a steep mountain. Hypothesis: Emma knows that they know that A rock climber climbs a steep mountain.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella assumes that A man is performing an aerial skateboard trick on a ramp with several other people behind him. Hypothesis: Isabella thinks that they assume that A man is performing an aerial skateboard trick on a ramp with several other people behind him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor recognizes that A man in blue with a black hat with a dog leaping at him in a park-like setting. Hypothesis: Taylor recognizes that they recognize that A man in blue with a black hat with a dog leaping at him in a park-like setting.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella recognizes that A smiling young girl with blond-hair, blue eyes, and a pink shirt, is holding a yellow flower towards the viewer outside. Hypothesis: Isabella believes that they recognize that A smiling young girl with blond-hair, blue eyes, and a pink shirt, is holding a yellow flower towards the viewer outside.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor understands that A red jeep hangs from the edge of a rocky cliff as a girl looks on. Hypothesis: Taylor recognizes that they understand that A red jeep hangs from the edge of a rocky cliff as a girl looks on.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia thinks that A person in a white t-shirt, military print cap and red bandanna with a skeleton on it covering most of the person's face. Hypothesis: Sophia understands that they think that A person in a white t-shirt, military print cap and red bandanna with a skeleton on it covering most of the person's face.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor assumes that A boy cooking on a grill. Hypothesis: Taylor understands that they assume that A boy cooking on a grill.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail understands that A girl and two boys are playing in water. Hypothesis: Abigail recognizes that they understand that A girl and two boys are playing in water.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael understands that Two people in a dense jungle area with trees and grass everywhere. Hypothesis: Michael understands that they understand that Two people in a dense jungle area with trees and grass everywhere.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles understands that A man in a yellow excavator on a construction site. Hypothesis: Charles believes that they understand that A man in a yellow excavator on a construction site.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael thinks that Two men and one woman are performing music on a stage. Hypothesis: Michael recognizes that they think that Two men and one woman are performing music on a stage.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James sees that Two boys stand in an ocean as the sun sets. Hypothesis: James knows that they see that Two boys stand in an ocean as the sun sets.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John knows that A soldier is holding a gun and crouched down with is mouth covered by a cloth. Hypothesis: John thinks that they know that A soldier is holding a gun and crouched down with is mouth covered by a cloth.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David assumes that Little kids enjoy sprinklers by running through them outdoors. Hypothesis: David understands that they assume that Little kids enjoy sprinklers by running through them outdoors.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William learns that A man is standing in front of a building holding heart shaped balloons and a woman is crossing the street. Hypothesis: William believes that they learn that A man is standing in front of a building holding heart shaped balloons and a woman is crossing the street.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael recognizes that Black dog with tan markings wearing a blue collar standing on green grass. Hypothesis: Michael recognizes that they recognize that Black dog with tan markings wearing a blue collar standing on green grass.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William recognizes that two puppies playing around in the grass Hypothesis: William believes that they recognize that two puppies playing around in the grass", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David sees that A group of Asian children are gathered around in a circle listening to an older male in a white shirt. Hypothesis: David thinks that they see that A group of Asian children are gathered around in a circle listening to an older male in a white shirt.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert sees that A man in jeans and a white shirt is standing near a rock formation with his back to the camera. Hypothesis: Robert believes that they see that A man in jeans and a white shirt is standing near a rock formation with his back to the camera.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William learns that Six children splashing in an outdoor water park. Hypothesis: William understands that they learn that Six children splashing in an outdoor water park.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail suspects that A girl with a cigarette in hand and a guy with a green hat wave at the camera. Hypothesis: Abigail recognizes that they suspect that A girl with a cigarette in hand and a guy with a green hat wave at the camera.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava thinks that Black man singing with microphone Hypothesis: Ava believes that they think that Black man singing with microphone", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia understands that A man cooking kabobs on a barbecue in his backyard. Hypothesis: Amelia believes that they understand that A man cooking kabobs on a barbecue in his backyard.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James assumes that 3 people sitting in a boat, rowing in a large body of water surrounded by greenery. Hypothesis: James understands that they assume that 3 people sitting in a boat, rowing in a large body of water surrounded by greenery.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia believes that A young girl with long hair, glasses and a lip ring playing on her iPhone in a brightly lit room. Hypothesis: Sophia recognizes that they believe that A young girl with long hair, glasses and a lip ring playing on her iPhone in a brightly lit room.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph assumes that Two women in colorful swimming suits are leaping above a pool while two other women in the pool watch. Hypothesis: Joseph believes that they assume that Two women in colorful swimming suits are leaping above a pool while two other women in the pool watch.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael knows that A child rides a unicycle while a crowd watches. Hypothesis: Michael believes that they know that A child rides a unicycle while a crowd watches.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia knows that The kids watched as the soda bottle launched into the air. Hypothesis: Amelia believes that they know that The kids watched as the soda bottle launched into the air.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas learns that An older man is standing outside in front of a truck. Hypothesis: Thomas understands that they learn that An older man is standing outside in front of a truck.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma remembers that A group of people are walking down a sidewalk beside the beach. Hypothesis: Emma believes that they remember that A group of people are walking down a sidewalk beside the beach.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael believes that A man is looking over a small cliff. Hypothesis: Michael knows that they believe that A man is looking over a small cliff.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail recognizes that the front side of a food vendor in a park. Hypothesis: Abigail understands that they recognize that the front side of a food vendor in a park.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph recognizes that A guy looking out over the scenic forest. Hypothesis: Joseph understands that they recognize that A guy looking out over the scenic forest.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail assumes that A man in a purple suit sings and plays the guitar. Hypothesis: Abigail believes that they assume that A man in a purple suit sings and plays the guitar.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor learns that The little girl in the sand is handing a ball to one of the two black dogs. Hypothesis: Taylor recognizes that they learn that The little girl in the sand is handing a ball to one of the two black dogs.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert sees that An old man and a child walk together along a pathway near a building. Hypothesis: Robert thinks that they see that An old man and a child walk together along a pathway near a building.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia knows that A woman in a tomato-colored jogging suit carries both a red purse and a navy blue messenger bag. Hypothesis: Sophia knows that they know that A woman in a tomato-colored jogging suit carries both a red purse and a navy blue messenger bag.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma learns that A man sits on a bench beside his bike while viewing the scenery around him overlooking a busy city. Hypothesis: Emma knows that they learn that A man sits on a bench beside his bike while viewing the scenery around him overlooking a busy city.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles believes that Five young boys in swim trunks jump into a swimming pool at the same time. Hypothesis: Charles understands that they believe that Five young boys in swim trunks jump into a swimming pool at the same time.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael understands that A man at the beach, building a sand castle. Hypothesis: Michael believes that they understand that A man at the beach, building a sand castle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia thinks that Dog standing in grassy sand dune. Hypothesis: Sophia thinks that they think that Dog standing in grassy sand dune.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor understands that Guy playing the guitar on a bench with another man watching him. Hypothesis: Taylor knows that they understand that Guy playing the guitar on a bench with another man watching him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava believes that A man jumping sideways in the ocean. Hypothesis: Ava knows that they believe that A man jumping sideways in the ocean.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor remembers that A woman has just completed her release in a game of bowling. Hypothesis: Taylor understands that they remember that A woman has just completed her release in a game of bowling.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor learns that A man is jumping over a rock. Hypothesis: Taylor thinks that they learn that A man is jumping over a rock.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte sees that Young woman celebrates getting a strike during a bowling game. Hypothesis: Charlotte knows that they see that Young woman celebrates getting a strike during a bowling game.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William suspects that girl with helmet riding a brown horse Hypothesis: William knows that they suspect that girl with helmet riding a brown horse", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph thinks that A woman is walking down the street with a brown bookbag on her back. Hypothesis: Joseph recognizes that they think that A woman is walking down the street with a brown bookbag on her back.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava recognizes that A female belly dancer dressed in blue and orange performs a folding fan dance with two men providing the music behind her; they are using a guitar and drums. Hypothesis: Ava knows that they recognize that A female belly dancer dressed in blue and orange performs a folding fan dance with two men providing the music behind her; they are using a guitar and drums.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia recognizes that A girl is throwing a football on the beach. Hypothesis: Amelia understands that they recognize that A girl is throwing a football on the beach.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia suspects that A woman dressed as Dorthy from the Wizard of Oz smiling at a baby, standing above her on a table, dressed as an elephant. Hypothesis: Amelia knows that they suspect that A woman dressed as Dorthy from the Wizard of Oz smiling at a baby, standing above her on a table, dressed as an elephant.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John thinks that A woman with blond-hair is sitting at a table and talking to a man with glasses. Hypothesis: John understands that they think that A woman with blond-hair is sitting at a table and talking to a man with glasses.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that Two men selling fruit at a fruit market. Hypothesis: Evelyn understands that they think that Two men selling fruit at a fruit market.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard recognizes that One football player wearing an orange jersey and one wearing a white jersey are set at the starting line. Hypothesis: Richard understands that they recognize that One football player wearing an orange jersey and one wearing a white jersey are set at the starting line.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph knows that A man with glasses and a Hawaiian shirt is standing next to a dog while another man with a blue hat looks at them from the back. Hypothesis: Joseph understands that they know that A man with glasses and a Hawaiian shirt is standing next to a dog while another man with a blue hat looks at them from the back.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James suspects that Three people, a woman and two men ride scooters amongst the pedestrians of a busy city street. Hypothesis: James knows that they suspect that Three people, a woman and two men ride scooters amongst the pedestrians of a busy city street.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail believes that Closeup of an elderly woman walking across a street with her male companion. Hypothesis: Abigail believes that they believe that Closeup of an elderly woman walking across a street with her male companion.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma assumes that A girl holds onto a rope above the water. Hypothesis: Emma thinks that they assume that A girl holds onto a rope above the water.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia learns that A young boy in a Boy Scout shirt sits in a folding camp chair indoors, with other similar chairs around him, and a green tent behind him. Hypothesis: Olivia believes that they learn that A young boy in a Boy Scout shirt sits in a folding camp chair indoors, with other similar chairs around him, and a green tent behind him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert recognizes that a man with a blue jacket look at items. Hypothesis: Robert recognizes that they recognize that a man with a blue jacket look at items.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia understands that A couple is a standing together the woman is adjusting a flower on the man's lapel and they are dressed in wedding apparel. Hypothesis: Olivia thinks that they understand that A couple is a standing together the woman is adjusting a flower on the man's lapel and they are dressed in wedding apparel.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael sees that Man walking barefoot on the beach on what seems to be a very cloudy day. Hypothesis: Michael thinks that they see that Man walking barefoot on the beach on what seems to be a very cloudy day.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John believes that A father helps his son ride a bike across dry, and dusty dirt accompanied by his sister adorned in a green dress. Hypothesis: John thinks that they believe that A father helps his son ride a bike across dry, and dusty dirt accompanied by his sister adorned in a green dress.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William remembers that Two people riding bikes in the rain at skate park. Hypothesis: William recognizes that they remember that Two people riding bikes in the rain at skate park.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard recognizes that A girl wearing a red shirt and jeans is sitting in a rocking chair at a cluttered desk, while another girl wearing a black t-shirt and jogging pants is sitting on the floor writing on a piece of paper with other papers arranged around her. Hypothesis: Richard understands that they recognize that A girl wearing a red shirt and jeans is sitting in a rocking chair at a cluttered desk, while another girl wearing a black t-shirt and jogging pants is sitting on the floor writing on a piece of paper with other papers arranged around her.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava learns that Little girl and older male, holding hands and walking on train tracks. Hypothesis: Ava thinks that they learn that Little girl and older male, holding hands and walking on train tracks.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles sees that a blue and gray race car driving on a dirt track. Hypothesis: Charles understands that they see that a blue and gray race car driving on a dirt track.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor learns that A woman get some food from under a blue tent. Hypothesis: Taylor thinks that they learn that A woman get some food from under a blue tent.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas knows that Two men are listening to music through headphones. Hypothesis: Thomas understands that they know that Two men are listening to music through headphones.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert understands that Male and female performers stand on stage holding microphones up to their lips and raising their hands in the sky. Hypothesis: Robert recognizes that they understand that Male and female performers stand on stage holding microphones up to their lips and raising their hands in the sky.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte recognizes that People are shopping outside surrounded by a metal fence. Hypothesis: Charlotte understands that they recognize that People are shopping outside surrounded by a metal fence.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James does not think that Two girls talk at an ice skating rink. Hypothesis: James believes that they do not think that Two girls talk at an ice skating rink.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia does not suspect that The person is standing in the doorway beneath the tree. Hypothesis: Sophia understands that they do not suspect that The person is standing in the doorway beneath the tree.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia does not believe that Two wrestlers jump in a ring while an official watches. Hypothesis: Olivia thinks that they do not believe that Two wrestlers jump in a ring while an official watches.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella does not think that A woman nibbles at a food item in her hands. Hypothesis: Isabella thinks that they do not think that A woman nibbles at a food item in her hands.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia does not believe that A man pushing a food cart stands in front of a stone building and holds onto the bars covering a window. Hypothesis: Amelia believes that they do not believe that A man pushing a food cart stands in front of a stone building and holds onto the bars covering a window.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard does not believe that A little girl plays in the ocean on the beach. Hypothesis: Richard thinks that they do not believe that A little girl plays in the ocean on the beach.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles does not think that Two women in bathing suits are together in a two-seat kayak in water with trees in the background. Hypothesis: Charles knows that they do not think that Two women in bathing suits are together in a two-seat kayak in water with trees in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte does not believe that Several women with long hair and mini-dresses walk together. Hypothesis: Charlotte thinks that they do not believe that Several women with long hair and mini-dresses walk together.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not believe that A girl in a purple tutu dances in the yard. Hypothesis: Evelyn believes that they do not believe that A girl in a purple tutu dances in the yard.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia does not believe that A little girl plays with a faucet. Hypothesis: Sophia thinks that they do not believe that A little girl plays with a faucet.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia does not suspect that A dirt bike rider riding through the woods over logs. Hypothesis: Olivia believes that they do not suspect that A dirt bike rider riding through the woods over logs.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia does not think that A woman with a bright red umbrella is jumping high in the air, she has on a knit hat and black shirt and colorful boots. Hypothesis: Amelia thinks that they do not think that A woman with a bright red umbrella is jumping high in the air, she has on a knit hat and black shirt and colorful boots.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma does not suspect that A woman is eating what appears to be a mussel. Hypothesis: Emma recognizes that they do not suspect that A woman is eating what appears to be a mussel.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not suspect that A boy in a baseball cap jumps over a flight of stairs. Hypothesis: Ava thinks that they do not suspect that A boy in a baseball cap jumps over a flight of stairs.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph does not believe that Several men in fluorescent pinnies work on a structure shrouded in a green veil while a cherry picker truck hauls material. Hypothesis: Joseph thinks that they do not believe that Several men in fluorescent pinnies work on a structure shrouded in a green veil while a cherry picker truck hauls material.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not suspect that A hockey fight. Hypothesis: John recognizes that they do not suspect that A hockey fight.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not think that There are two shadowy men standing along side a stream that runs through a paved courtyard in front of some stairs. Hypothesis: Taylor understands that they do not think that There are two shadowy men standing along side a stream that runs through a paved courtyard in front of some stairs.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph does not suspect that Asian man giving thumbs up on street. Hypothesis: Joseph understands that they do not suspect that Asian man giving thumbs up on street.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not think that A man in a shirt and tie does the splits on a wood floor Hypothesis: Taylor believes that they do not think that A man in a shirt and tie does the splits on a wood floor", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles does not think that People walking down a busy city street in the winter. Hypothesis: Charles understands that they do not think that People walking down a busy city street in the winter.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William does not suspect that Several Asian women dressed in black outfits and crowns are holding plates with food on them. Hypothesis: William recognizes that they do not suspect that Several Asian women dressed in black outfits and crowns are holding plates with food on them.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not believe that A man in his 30's is sitting on a curb of a busy sidewalk, dressed in a furry green costume. Hypothesis: Taylor believes that they do not believe that A man in his 30's is sitting on a curb of a busy sidewalk, dressed in a furry green costume.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not think that A group of people are standing on a platform and waiting for the subway train. Hypothesis: Ava believes that they do not think that A group of people are standing on a platform and waiting for the subway train.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James does not assume that Two people work construction on the inside of a house. Hypothesis: James knows that they do not assume that Two people work construction on the inside of a house.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David does not suspect that A man riding a dirt bike on a racetrack. Hypothesis: David believes that they do not suspect that A man riding a dirt bike on a racetrack.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David does not think that 3 women and 2 men waiting by a wall in the park talking Hypothesis: David thinks that they do not think that 3 women and 2 men waiting by a wall in the park talking", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia does not believe that Two dogs running in the dirt Hypothesis: Amelia believes that they do not believe that Two dogs running in the dirt", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not believe that Three individuals are wearing tight blue nylon suits with one instructor in all black with a ponytail assisting them with putting on harnesses. Hypothesis: Taylor recognizes that they do not believe that Three individuals are wearing tight blue nylon suits with one instructor in all black with a ponytail assisting them with putting on harnesses.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David does not think that There is a room full of pictures all in the wall and a woman in a coat is looking back over her shoulders strangely. Hypothesis: David knows that they do not think that There is a room full of pictures all in the wall and a woman in a coat is looking back over her shoulders strangely.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia does not think that A man standing at the front of the room is pointing up while several people who are seated look towards him. Hypothesis: Olivia knows that they do not think that A man standing at the front of the room is pointing up while several people who are seated look towards him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia does not think that A blond woman in a white cutoff shirt and jeans is walking. Hypothesis: Amelia understands that they do not think that A blond woman in a white cutoff shirt and jeans is walking.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail does not assume that A man drags a young boy in swim trunks into the surf at what appears to be a beach in a tropical location. Hypothesis: Abigail knows that they do not assume that A man drags a young boy in swim trunks into the surf at what appears to be a beach in a tropical location.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia does not think that A young girl kisses a ring-bearing boy at a wedding. Hypothesis: Olivia thinks that they do not think that A young girl kisses a ring-bearing boy at a wedding.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles does not suspect that A shirtless man is singing into a microphone while a woman next to him plays an accordion. Hypothesis: Charles believes that they do not suspect that A shirtless man is singing into a microphone while a woman next to him plays an accordion.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma does not believe that A goalie in white runs for an approaching ball while the opponent in red who kicked it waits. Hypothesis: Emma knows that they do not believe that A goalie in white runs for an approaching ball while the opponent in red who kicked it waits.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not assume that A boy with a bottle plays with an older girl. Hypothesis: Taylor thinks that they do not assume that A boy with a bottle plays with an older girl.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael does not think that A young man with a blue hoodie sweatshirt that says New York across the front, sings into a microphone in front of a crowd of people. Hypothesis: Michael recognizes that they do not think that A young man with a blue hoodie sweatshirt that says New York across the front, sings into a microphone in front of a crowd of people.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not believe that Music can be created, through winded instruments, by winded instruments, and they are all enjoyed by different peoples, throughout the world. Hypothesis: Thomas recognizes that they do not believe that Music can be created, through winded instruments, by winded instruments, and they are all enjoyed by different peoples, throughout the world.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not assume that A football player in a blue \"Rams\" jersey runs with a football on a field, as another player in a white jersey falls in an attempt to tackle him. Hypothesis: Taylor understands that they do not assume that A football player in a blue \"Rams\" jersey runs with a football on a field, as another player in a white jersey falls in an attempt to tackle him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia does not suspect that A man with a cap and brown shirt is standing on a grassy incline by a pile of hay or grass on some kind of wooden sled attached to a horse with chains. Hypothesis: Olivia recognizes that they do not suspect that A man with a cap and brown shirt is standing on a grassy incline by a pile of hay or grass on some kind of wooden sled attached to a horse with chains.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert does not think that Three ladies wearing dresses are bent down in a muddy creek gathering green plants. Hypothesis: Robert understands that they do not think that Three ladies wearing dresses are bent down in a muddy creek gathering green plants.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert does not think that A large amount of persons flying kites in a park. Hypothesis: Robert knows that they do not think that A large amount of persons flying kites in a park.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert does not think that With the sun rising, a person is gliding with a huge parachute attached to them. Hypothesis: Robert thinks that they do not think that With the sun rising, a person is gliding with a huge parachute attached to them.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph does not assume that Two men look down at another man standing on an unfinished walkway. Hypothesis: Joseph recognizes that they do not assume that Two men look down at another man standing on an unfinished walkway.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella does not assume that A girl in uniform running through the water fountain gushing water from the tiles. Hypothesis: Isabella knows that they do not assume that A girl in uniform running through the water fountain gushing water from the tiles.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael does not assume that An older man looks over a younger man wielding an ax chopping wood in a fall setting. Hypothesis: Michael thinks that they do not assume that An older man looks over a younger man wielding an ax chopping wood in a fall setting.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard does not believe that A woman is riding a horse along a track. Hypothesis: Richard understands that they do not believe that A woman is riding a horse along a track.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not believe that A woman walking across an old rope and driftrood bridge between mountains. Hypothesis: Ava knows that they do not believe that A woman walking across an old rope and driftrood bridge between mountains.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma does not suspect that A man and woman are sitting at a table in front of a sign that reads IL PORTO and two wine bottles and two wineglasses are on the table. Hypothesis: Emma understands that they do not suspect that A man and woman are sitting at a table in front of a sign that reads IL PORTO and two wine bottles and two wineglasses are on the table.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not assume that A boy in an innertube in the pool splashing and smiling. Hypothesis: Evelyn thinks that they do not assume that A boy in an innertube in the pool splashing and smiling.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not think that A boy and a girl in jackets gaze in a clothing store window. Hypothesis: Thomas knows that they do not think that A boy and a girl in jackets gaze in a clothing store window.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William does not think that A dog carrying a stick in its mouth runs through a snow-covered field. Hypothesis: William thinks that they do not think that A dog carrying a stick in its mouth runs through a snow-covered field.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not believe that A brown dog in running on grass. Hypothesis: Ava thinks that they do not believe that A brown dog in running on grass.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not suspect that Two hikers are climbing through a rocky and snowy passage in the mountains. Hypothesis: Ava understands that they do not suspect that Two hikers are climbing through a rocky and snowy passage in the mountains.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not suspect that A small baby, possibly a newborn is being bathed by a person in blue scrubs wearing protective gloves. Hypothesis: John recognizes that they do not suspect that A small baby, possibly a newborn is being bathed by a person in blue scrubs wearing protective gloves.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James does not suspect that A baby wearing yellow is pretending to be a doctor while inside a stroller. Hypothesis: James thinks that they do not suspect that A baby wearing yellow is pretending to be a doctor while inside a stroller.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail does not assume that A man plays mini-gold on the SportsCenter set while two others observe. Hypothesis: Abigail knows that they do not assume that A man plays mini-gold on the SportsCenter set while two others observe.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not assume that The woman in the blue skirt is sleeping on a cardboard box under a picture of Mary and baby Jesus. Hypothesis: John knows that they do not assume that The woman in the blue skirt is sleeping on a cardboard box under a picture of Mary and baby Jesus.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia does not believe that An old women in a purple skirt is gardening with a old tool. Hypothesis: Amelia knows that they do not believe that An old women in a purple skirt is gardening with a old tool.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not suspect that A man and a woman are competing in a road rice. Hypothesis: Evelyn knows that they do not suspect that A man and a woman are competing in a road rice.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael does not think that An Asian girl writes down something on a notepad in her lap. Hypothesis: Michael knows that they do not think that An Asian girl writes down something on a notepad in her lap.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard does not suspect that A child holds a football and runs from other children. Hypothesis: Richard believes that they do not suspect that A child holds a football and runs from other children.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not suspect that A man juggles flaming objects with a fence and a car in the background. Hypothesis: John knows that they do not suspect that A man juggles flaming objects with a fence and a car in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not suspect that A older gentleman finds it humorous that he is getting his picture taken while doing his laundry. Hypothesis: Thomas recognizes that they do not suspect that A older gentleman finds it humorous that he is getting his picture taken while doing his laundry.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia does not suspect that A diver is swimming with a turtle. Hypothesis: Sophia believes that they do not suspect that A diver is swimming with a turtle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia does not assume that A woman holding a camera. Hypothesis: Sophia knows that they do not assume that A woman holding a camera.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not believe that A girl in a purple sweater and a shoulder bag is looking to the side with a lot of people behind her. Hypothesis: Ava thinks that they do not believe that A girl in a purple sweater and a shoulder bag is looking to the side with a lot of people behind her.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte does not think that Woman with headscarf and girl in red costume dress walk through urban area. Hypothesis: Charlotte believes that they do not think that Woman with headscarf and girl in red costume dress walk through urban area.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not assume that A few people walking in the distance of a small town. Hypothesis: Taylor believes that they do not assume that A few people walking in the distance of a small town.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles does not believe that A boat docked on a river. Hypothesis: Charles recognizes that they do not believe that A boat docked on a river.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David does not assume that A young boy wearing blue pajamas and yellow glasses leaping into the air. Hypothesis: David recognizes that they do not assume that A young boy wearing blue pajamas and yellow glasses leaping into the air.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia does not assume that This man is trying to make his wife laugh by blowing bubbles in the bathtub. Hypothesis: Amelia thinks that they do not assume that This man is trying to make his wife laugh by blowing bubbles in the bathtub.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael does not suspect that A man wearing a brown shirt and green pans is pulling a rickshaw down a street Hypothesis: Michael thinks that they do not suspect that A man wearing a brown shirt and green pans is pulling a rickshaw down a street", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William does not suspect that Three woman are standing in a room. Hypothesis: William understands that they do not suspect that Three woman are standing in a room.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James does not think that A man in a long-sleeved blue shirt and blue jeans has set up some name trains on the ground looking to sell his wares. Hypothesis: James knows that they do not think that A man in a long-sleeved blue shirt and blue jeans has set up some name trains on the ground looking to sell his wares.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail does not assume that The dog is catching a treat. Hypothesis: Abigail understands that they do not assume that The dog is catching a treat.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard does not assume that A person wearing sunglasses, a visor, and a British flag is carrying 6 Heineken bottles. Hypothesis: Richard believes that they do not assume that A person wearing sunglasses, a visor, and a British flag is carrying 6 Heineken bottles.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not believe that A woman in a red and white jacket riding a bicycle. Hypothesis: Thomas understands that they do not believe that A woman in a red and white jacket riding a bicycle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not suspect that People running down a two lane road. Hypothesis: Evelyn thinks that they do not suspect that People running down a two lane road.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael does not believe that A child is looking at some colorful dresses. Hypothesis: Michael knows that they do not believe that A child is looking at some colorful dresses.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert does not assume that A person is climbing a cliff wall, over a rocky shore, using a rope. Hypothesis: Robert believes that they do not assume that A person is climbing a cliff wall, over a rocky shore, using a rope.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not assume that Two guys sitting in a room with green and white curtain. Hypothesis: John believes that they do not assume that Two guys sitting in a room with green and white curtain.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not suspect that A man wearing a suit with a name tag stands reading in front of a microphone as a screen behind him displays a presentation. Hypothesis: Ava knows that they do not suspect that A man wearing a suit with a name tag stands reading in front of a microphone as a screen behind him displays a presentation.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not think that An older man sitting on a stool on the sidewalk playing a violin. Hypothesis: Ava believes that they do not think that An older man sitting on a stool on the sidewalk playing a violin.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia does not believe that A woman is standing on the sidewalk, in front of a crosswalk. Hypothesis: Olivia recognizes that they do not believe that A woman is standing on the sidewalk, in front of a crosswalk.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph does not think that Three glass elevators with people inside of them. Hypothesis: Joseph believes that they do not think that Three glass elevators with people inside of them.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not believe that The Raiders complete the pass while the Dolphin defense scrambles to catch him. Hypothesis: John thinks that they do not believe that The Raiders complete the pass while the Dolphin defense scrambles to catch him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not suspect that Racers are just beginning a race in an international competition. Hypothesis: Thomas believes that they do not suspect that Racers are just beginning a race in an international competition.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael does not think that A woman stands at a podium with a slide show behind her. Hypothesis: Michael thinks that they do not think that A woman stands at a podium with a slide show behind her.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia does not think that Two girls and one women stand in the pouring rain. Hypothesis: Sophia understands that they do not think that Two girls and one women stand in the pouring rain.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma does not think that Several people are sitting down playing volleyball with a sign that reads \"WheelPower\" in the background. Hypothesis: Emma knows that they do not think that Several people are sitting down playing volleyball with a sign that reads \"WheelPower\" in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella does not suspect that People in a grocery store crowd around to watch a Tv, except one man who walks toward the camera. Hypothesis: Isabella recognizes that they do not suspect that People in a grocery store crowd around to watch a Tv, except one man who walks toward the camera.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David does not suspect that Boy standing in line in a grocery store with his items on the conveyor belt. Hypothesis: David thinks that they do not suspect that Boy standing in line in a grocery store with his items on the conveyor belt.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard does not believe that A male soccer player has his foot extended as if he has just kicked the soccer ball while the ball flies through the air. Hypothesis: Richard understands that they do not believe that A male soccer player has his foot extended as if he has just kicked the soccer ball while the ball flies through the air.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not assume that Skiiers are walking through the snow near the mountains. Hypothesis: Evelyn understands that they do not assume that Skiiers are walking through the snow near the mountains.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael does not think that Men walk in line carrying things. Hypothesis: Michael understands that they do not think that Men walk in line carrying things.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not suspect that a dog carries a large stick through the field. Hypothesis: John recognizes that they do not suspect that a dog carries a large stick through the field.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles does not suspect that A white male with blond-hair is drinking beer. Hypothesis: Charles recognizes that they do not suspect that A white male with blond-hair is drinking beer.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not believe that A woman in a white dress with one leg stops to read a poster. Hypothesis: John understands that they do not believe that A woman in a white dress with one leg stops to read a poster.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph does not believe that Two female workers sit on some steps during work. Hypothesis: Joseph recognizes that they do not believe that Two female workers sit on some steps during work.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail thinks that In a Little League baseball game, the batter watches as the ball he has just hit flies off toward right field, with the catcher looking on.. Hypothesis: Abigail does not thinks that it is not that case that In a Little League baseball game, the batter watches as the ball he has just hit flies off toward right field, with the catcher looking on.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail thinks that Two asian men in a wood shop.. Hypothesis: Abigail does not thinks that it is not that case that Two asian men in a wood shop.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia assumes that Two women dressed for cold weather in jackets and gloves look at something on a cellphone screen.. Hypothesis: Sophia does not assumes that it is not that case that Two women dressed for cold weather in jackets and gloves look at something on a cellphone screen.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte believes that Two orthodox Jews, one male, one female, are shown in traditional dress in a sidewalk scene.. Hypothesis: Charlotte does not believes that it is not that case that Two orthodox Jews, one male, one female, are shown in traditional dress in a sidewalk scene.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard believes that A group of people looking at menus in a white restaurant.. Hypothesis: Richard does not believes that it is not that case that A group of people looking at menus in a white restaurant.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that Two boys in a field kicking a soccer ball.. Hypothesis: Charles does not suspects that it is not that case that Two boys in a field kicking a soccer ball.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph assumes that A woman wearing a hat and a man covering his eyes sit on benches on a boat.. Hypothesis: Joseph does not assumes that it is not that case that A woman wearing a hat and a man covering his eyes sit on benches on a boat.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David assumes that A man is standing on a rooftop looking at his camera.. Hypothesis: David does not assumes that it is not that case that A man is standing on a rooftop looking at his camera.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph thinks that Six workers are working on the train tracks.. Hypothesis: Joseph does not thinks that it is not that case that Six workers are working on the train tracks.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that A large crowd gathered in front of McDonald's.. Hypothesis: Charles does not suspects that it is not that case that A large crowd gathered in front of McDonald's.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava believes that Three girls fell on top of one another and are laughing histerically.. Hypothesis: Ava does not believes that it is not that case that Three girls fell on top of one another and are laughing histerically.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia thinks that A woman with a purple purse sits on the metro with her suitcase.. Hypothesis: Amelia does not thinks that it is not that case that A woman with a purple purse sits on the metro with her suitcase.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma suspects that Two women stop between a red smart car and a group of photographers to examine their items in hand.. Hypothesis: Emma does not suspects that it is not that case that Two women stop between a red smart car and a group of photographers to examine their items in hand.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael suspects that A nicely dressed woman putting a handful of cotton candy in her mouth in a public square in Europe.. Hypothesis: Michael does not suspects that it is not that case that A nicely dressed woman putting a handful of cotton candy in her mouth in a public square in Europe.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas suspects that Two people are walking up a mountain.. Hypothesis: Thomas does not suspects that it is not that case that Two people are walking up a mountain.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava believes that Two young children in blue jerseys, one with the number 9 and one with the number 2 are standing on wooden steps in a bathroom and washing their hands in a sink.. Hypothesis: Ava does not believes that it is not that case that Two young children in blue jerseys, one with the number 9 and one with the number 2 are standing on wooden steps in a bathroom and washing their hands in a sink.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard believes that 2 people in blue and purple costumes are looking at each other with a hill in the background.. Hypothesis: Richard does not believes that it is not that case that 2 people in blue and purple costumes are looking at each other with a hill in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas believes that A man in black reading a book for a group of people.. Hypothesis: Thomas does not believes that it is not that case that A man in black reading a book for a group of people.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard believes that A woman holding a purse reaches up to grab the hands of a performer dressed as the statue of liberty wearing sunglasses.. Hypothesis: Richard does not believes that it is not that case that A woman holding a purse reaches up to grab the hands of a performer dressed as the statue of liberty wearing sunglasses.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail assumes that Men stand on steps leading out of a body of water. Hypothesis: Abigail does not assumes that it is not that case that Men stand on steps leading out of a body of water", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James assumes that A little girl wearing a tan sundress with a bow in the back holds a bouquet of flowers on the sidewalk.. Hypothesis: James does not assumes that it is not that case that A little girl wearing a tan sundress with a bow in the back holds a bouquet of flowers on the sidewalk.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava thinks that School kids all in blue backpacks.. Hypothesis: Ava does not thinks that it is not that case that School kids all in blue backpacks.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that A man is scrapping paint off a window.. Hypothesis: Evelyn does not thinks that it is not that case that A man is scrapping paint off a window.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert assumes that A person rides his bicycle in the sand beside the ocean.. Hypothesis: Robert does not assumes that it is not that case that A person rides his bicycle in the sand beside the ocean.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard thinks that Three people are wading in shallow water near a stone path and spraying fountains.. Hypothesis: Richard does not thinks that it is not that case that Three people are wading in shallow water near a stone path and spraying fountains.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia believes that A woman dressed in black looking perplexed and a woman in a red jacket offering to help her.. Hypothesis: Olivia does not believes that it is not that case that A woman dressed in black looking perplexed and a woman in a red jacket offering to help her.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia thinks that Two women in bathing suits walks across the sand.. Hypothesis: Sophia does not thinks that it is not that case that Two women in bathing suits walks across the sand.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard assumes that A man walking into a shadow, holding a sign.. Hypothesis: Richard does not assumes that it is not that case that A man walking into a shadow, holding a sign.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas believes that A basketball player making a slam dunk during a game.. Hypothesis: Thomas does not believes that it is not that case that A basketball player making a slam dunk during a game.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia suspects that A man on a bicycle stops for a rest with his leashed dogs.. Hypothesis: Sophia does not suspects that it is not that case that A man on a bicycle stops for a rest with his leashed dogs.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella believes that A man is doing tricks on a skateboard.. Hypothesis: Isabella does not believes that it is not that case that A man is doing tricks on a skateboard.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava thinks that Four girls look at objects under a microscope.. Hypothesis: Ava does not thinks that it is not that case that Four girls look at objects under a microscope.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph suspects that Three people in traditional garb play bamboo instruments.. Hypothesis: Joseph does not suspects that it is not that case that Three people in traditional garb play bamboo instruments.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella believes that Two people watch TV from over a white ledge.. Hypothesis: Isabella does not believes that it is not that case that Two people watch TV from over a white ledge.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William believes that A dog with big ears holds a ball in his mouth.. Hypothesis: William does not believes that it is not that case that A dog with big ears holds a ball in his mouth.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert suspects that A man in an urban area is sweeping the sidewalks, with a group of people in the background, crossing a street.. Hypothesis: Robert does not suspects that it is not that case that A man in an urban area is sweeping the sidewalks, with a group of people in the background, crossing a street.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael thinks that A police officer is standing with his arms crossed.. Hypothesis: Michael does not thinks that it is not that case that A police officer is standing with his arms crossed.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James suspects that A couple sit on a park bench with purple balloons tied to it.. Hypothesis: James does not suspects that it is not that case that A couple sit on a park bench with purple balloons tied to it.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava assumes that A young boy with sandy blond-hair and white and black soccer uniform kicking for the goal while parents look on.. Hypothesis: Ava does not assumes that it is not that case that A young boy with sandy blond-hair and white and black soccer uniform kicking for the goal while parents look on.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James believes that Young girl sitting on bleachers.. Hypothesis: James does not believes that it is not that case that Young girl sitting on bleachers.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard thinks that Man in white shirt and blue jeans looking to the side while walking down a busy sidewalk.. Hypothesis: Richard does not thinks that it is not that case that Man in white shirt and blue jeans looking to the side while walking down a busy sidewalk.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael assumes that A large tan dog is running with a green item in its mouth. Hypothesis: Michael does not assumes that it is not that case that A large tan dog is running with a green item in its mouth", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia thinks that Children use crayons to color sheets of paper.. Hypothesis: Olivia does not thinks that it is not that case that Children use crayons to color sheets of paper.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia assumes that A man wearing headphones is standing in front of a poster.. Hypothesis: Amelia does not assumes that it is not that case that A man wearing headphones is standing in front of a poster.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia thinks that Two men are shopping for orange juice.. Hypothesis: Olivia does not thinks that it is not that case that Two men are shopping for orange juice.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that A couple being romantic under the sunset.. Hypothesis: Charles does not suspects that it is not that case that A couple being romantic under the sunset.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia thinks that A young woman seated at a table on what appears to be a backyard deck holds a toddler, giving him a toy or bottle of some sort, while smiling into the camera.. Hypothesis: Olivia does not thinks that it is not that case that A young woman seated at a table on what appears to be a backyard deck holds a toddler, giving him a toy or bottle of some sort, while smiling into the camera.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella thinks that Female sitting in a chair in front of a hazy field.. Hypothesis: Isabella does not thinks that it is not that case that Female sitting in a chair in front of a hazy field.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that A blond man stands next to a cement mixer with mountains in the background.. Hypothesis: Evelyn does not thinks that it is not that case that A blond man stands next to a cement mixer with mountains in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia assumes that Woman being photographed near a bicycle.. Hypothesis: Olivia does not assumes that it is not that case that Woman being photographed near a bicycle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail assumes that A soldier is handing a picture to a woman holding a Donald Duck bag.. Hypothesis: Abigail does not assumes that it is not that case that A soldier is handing a picture to a woman holding a Donald Duck bag.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph thinks that People are waiting in line by a food vendor.. Hypothesis: Joseph does not thinks that it is not that case that People are waiting in line by a food vendor.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph thinks that Two men one in orange shirt, who is ahead, and one in green shirt running a race.. Hypothesis: Joseph does not thinks that it is not that case that Two men one in orange shirt, who is ahead, and one in green shirt running a race.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that Two men, one kneeling and one squatting, are posing in front of a clear wall with shops in the background.. Hypothesis: Charles does not suspects that it is not that case that Two men, one kneeling and one squatting, are posing in front of a clear wall with shops in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava assumes that Black dog with white puppies laying on the floor.. Hypothesis: Ava does not assumes that it is not that case that Black dog with white puppies laying on the floor.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that A man performs a jumping trick on a skateboard and creates a shadow on the wall behind him.. Hypothesis: Evelyn does not thinks that it is not that case that A man performs a jumping trick on a skateboard and creates a shadow on the wall behind him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor believes that A woman sitting eating a sandwich.. Hypothesis: Taylor does not believes that it is not that case that A woman sitting eating a sandwich.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William thinks that The man in the blue pants is doing a trick with his skateboard.. Hypothesis: William does not thinks that it is not that case that The man in the blue pants is doing a trick with his skateboard.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael suspects that Photographed from below, a somewhat husky man wearing a white and black windowpane-plaid shirt and dark trousers is holding a little boy who is wearing orange pants and a navy-blue shirt.. Hypothesis: Michael does not suspects that it is not that case that Photographed from below, a somewhat husky man wearing a white and black windowpane-plaid shirt and dark trousers is holding a little boy who is wearing orange pants and a navy-blue shirt.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard assumes that A dog carrying a stick in its mouth runs through a snow-covered field.. Hypothesis: Richard does not assumes that it is not that case that A dog carrying a stick in its mouth runs through a snow-covered field.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail suspects that Group of people waiting at the voting booths.. Hypothesis: Abigail does not suspects that it is not that case that Group of people waiting at the voting booths.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella suspects that girl posing against a wall in the city. Hypothesis: Isabella does not suspects that it is not that case that girl posing against a wall in the city", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David believes that A woman in a kitchen holds a can surrounded by bowls.. Hypothesis: David does not believes that it is not that case that A woman in a kitchen holds a can surrounded by bowls.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert thinks that A man in a brown hat with a beard is holding up a twig.. Hypothesis: Robert does not thinks that it is not that case that A man in a brown hat with a beard is holding up a twig.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph assumes that Two people in leather jackets and jeans stand outside large, red, metal doors.. Hypothesis: Joseph does not assumes that it is not that case that Two people in leather jackets and jeans stand outside large, red, metal doors.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail suspects that A young man in a white and pink striped shirt is riding in a horse and buggy down a paved road.. Hypothesis: Abigail does not suspects that it is not that case that A young man in a white and pink striped shirt is riding in a horse and buggy down a paved road.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard suspects that 2 rows of woman walking towards each other on the sidewalk outside of a store with a boy 50% sign on the golden framed windows.. Hypothesis: Richard does not suspects that it is not that case that 2 rows of woman walking towards each other on the sidewalk outside of a store with a boy 50% sign on the golden framed windows.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that A man wearing a pink shirt and wearing glasses crouching down in front of a basket of clothing at the laundromat.. Hypothesis: Evelyn does not thinks that it is not that case that A man wearing a pink shirt and wearing glasses crouching down in front of a basket of clothing at the laundromat.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma thinks that Tall man being stopped by an officer.. Hypothesis: Emma does not thinks that it is not that case that Tall man being stopped by an officer.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael thinks that A girl with brown hair and a brown shirt is building a gingerbread house.. Hypothesis: Michael does not thinks that it is not that case that A girl with brown hair and a brown shirt is building a gingerbread house.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John thinks that A man and woman are sitting at a restaurant table holding hands.. Hypothesis: John does not thinks that it is not that case that A man and woman are sitting at a restaurant table holding hands.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail believes that A man reading the paper at a cafe.. Hypothesis: Abigail does not believes that it is not that case that A man reading the paper at a cafe.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor believes that A man operates a piece of earth-moving equipment near a waterway.. Hypothesis: Taylor does not believes that it is not that case that A man operates a piece of earth-moving equipment near a waterway.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia assumes that Military woman using a microscope.. Hypothesis: Olivia does not assumes that it is not that case that Military woman using a microscope.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William suspects that A man is holding a pile of newspapers in a lobby, and a woman next to him has taken one of the newspapers and is smiling.. Hypothesis: William does not suspects that it is not that case that A man is holding a pile of newspapers in a lobby, and a woman next to him has taken one of the newspapers and is smiling.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia suspects that Girl in purple jacket leaning against a wall.. Hypothesis: Amelia does not suspects that it is not that case that Girl in purple jacket leaning against a wall.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma thinks that Two brown-haired men wearing short-sleeved shirts and shorts are climbing stairs.. Hypothesis: Emma does not thinks that it is not that case that Two brown-haired men wearing short-sleeved shirts and shorts are climbing stairs.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that Here we have a guy using a pressure washer on the sidewalk.. Hypothesis: Charles does not suspects that it is not that case that Here we have a guy using a pressure washer on the sidewalk.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia thinks that Two men exchange conversation in a crowded place.. Hypothesis: Amelia does not thinks that it is not that case that Two men exchange conversation in a crowded place.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert thinks that A woman in a blue tank-top rides a blue bicycle in front of a crowd of meandering pedestrians.. Hypothesis: Robert does not thinks that it is not that case that A woman in a blue tank-top rides a blue bicycle in front of a crowd of meandering pedestrians.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas suspects that A large brown and black dog jumps in the air holding a white Frisbee in its mouth.. Hypothesis: Thomas does not suspects that it is not that case that A large brown and black dog jumps in the air holding a white Frisbee in its mouth.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava suspects that A dark-haired drummer is playing his set with enthusiasm.. Hypothesis: Ava does not suspects that it is not that case that A dark-haired drummer is playing his set with enthusiasm.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles believes that A little girl in a red flowered dress with a tennis racket.. Hypothesis: Charles does not believes that it is not that case that A little girl in a red flowered dress with a tennis racket.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert assumes that A man in a blue t-shirt is watching two women sitting at a table in the kitchen baking.. Hypothesis: Robert does not assumes that it is not that case that A man in a blue t-shirt is watching two women sitting at a table in the kitchen baking.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John suspects that The group is working with microscopes and wearing clean white scrubs, hairnets and face masks.. Hypothesis: John does not suspects that it is not that case that The group is working with microscopes and wearing clean white scrubs, hairnets and face masks.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph assumes that Three people loading or unloading their car.. Hypothesis: Joseph does not assumes that it is not that case that Three people loading or unloading their car.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John suspects that Man with dark shirt in work gloves and a helmet that has a yellow flashlight attached.. Hypothesis: John does not suspects that it is not that case that Man with dark shirt in work gloves and a helmet that has a yellow flashlight attached.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James believes that A man in a fleece jacket works with a piece of tin.. Hypothesis: James does not believes that it is not that case that A man in a fleece jacket works with a piece of tin.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia thinks that Man standing on a tricycle riding in front of a crowd.. Hypothesis: Olivia does not thinks that it is not that case that Man standing on a tricycle riding in front of a crowd.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael assumes that Four women in front of Odeon wear similar black, pink and white superman type shirts and jean skirts.. Hypothesis: Michael does not assumes that it is not that case that Four women in front of Odeon wear similar black, pink and white superman type shirts and jean skirts.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail assumes that There is a woman throwing daggers at a target, which is a carrot.. Hypothesis: Abigail does not assumes that it is not that case that There is a woman throwing daggers at a target, which is a carrot.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia believes that Man juggling apples while sitting on a couch with another man on one side and a woman on the other.. Hypothesis: Amelia does not believes that it is not that case that Man juggling apples while sitting on a couch with another man on one side and a woman on the other.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia believes that A man wearing a black T-shirt and a tan jacket wrapped around his waist pulls a wheeled gray and black bag as he walks next to a building that has large glass windows.. Hypothesis: Sophia does not believes that it is not that case that A man wearing a black T-shirt and a tan jacket wrapped around his waist pulls a wheeled gray and black bag as he walks next to a building that has large glass windows.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph suspects that A butterfly costumed girl waves at the crowd.. Hypothesis: Joseph does not suspects that it is not that case that A butterfly costumed girl waves at the crowd.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia thinks that Three middle-age women are on a stage, one singing and the other two cheerleading in blue uniforms.. Hypothesis: Olivia does not thinks that it is not that case that Three middle-age women are on a stage, one singing and the other two cheerleading in blue uniforms.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William assumes that A dark colored man receives felicitations from a white colored woman which is seen by another white colored man.. Hypothesis: William does not assumes that it is not that case that A dark colored man receives felicitations from a white colored woman which is seen by another white colored man.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James thinks that A person is surfing on a large wave.. Hypothesis: James does not thinks that it is not that case that A person is surfing on a large wave.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael believes that A man cutting a Woman's hair.. Hypothesis: Michael does not believes that it is not that case that A man cutting a Woman's hair.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David suspects that A group of Japanese women wearing matching outfits walking across a crosswalk while passersby stare.. Hypothesis: David does not suspects that it is not that case that A group of Japanese women wearing matching outfits walking across a crosswalk while passersby stare.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma assumes that A woman in an red tracksuit squeezing lemons in a press.. Hypothesis: Emma does not assumes that it is not that case that A woman in an red tracksuit squeezing lemons in a press.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail thinks that a shoeless toddler sleeps in his car seat holding his pacifier. Hypothesis: Abigail assumes that it is not the case that a shoeless toddler sleeps in his car seat holding his pacifier.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor knows that A busy street full of shops and people holding hands and walking. Hypothesis: Taylor believes that it is not the case that A busy street full of shops and people holding hands and walking.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas suspects that Backside view of a South America street vendor tending to her upright oven with a second woman looking away. Hypothesis: Thomas thinks that it is not the case that Backside view of a South America street vendor tending to her upright oven with a second woman looking away.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte remembers that A man walking towards the open sea. Hypothesis: Charlotte knows that it is not the case that A man walking towards the open sea.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James knows that A young man with a plain shirt looking down, with a band and dancing people behind him. Hypothesis: James thinks that it is not the case that A young man with a plain shirt looking down, with a band and dancing people behind him.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard thinks that Sisters waiting for their dinner to be served at a restaurant while listening to live music. Hypothesis: Richard knows that it is not the case that Sisters waiting for their dinner to be served at a restaurant while listening to live music.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava learns that A jockey in blue gallops a chestnut horse on a dirt track past a wooden fence. Hypothesis: Ava learns that it is not the case that A jockey in blue gallops a chestnut horse on a dirt track past a wooden fence.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor assumes that A smiling child is standing behind a tree. Hypothesis: Taylor learns that it is not the case that A smiling child is standing behind a tree.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles recognizes that A batsman is about to swing for a baseball whilst the catcher and referee wait behind him. Hypothesis: Charles recognizes that it is not the case that A batsman is about to swing for a baseball whilst the catcher and referee wait behind him.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor believes that A boy in an orange shirt sells fruit from a street cart. Hypothesis: Taylor remembers that it is not the case that A boy in an orange shirt sells fruit from a street cart.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph knows that A child and small dog running. Hypothesis: Joseph learns that it is not the case that A child and small dog running.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava sees that Child inside of large snow fort. Hypothesis: Ava understands that it is not the case that Child inside of large snow fort.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn thinks that A young girl has her hands in a tub of water with leaves in it. Hypothesis: Evelyn assumes that it is not the case that A young girl has her hands in a tub of water with leaves in it.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David learns that A baby with star shades on. Hypothesis: David believes that it is not the case that A baby with star shades on.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia remembers that Woman wearing jeans and white shirt watches as her bowling ball rolls down the lane to the pins. Hypothesis: Amelia assumes that it is not the case that Woman wearing jeans and white shirt watches as her bowling ball rolls down the lane to the pins.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David learns that A man dressed in yellow rescue gear walks in a field. Hypothesis: David thinks that it is not the case that A man dressed in yellow rescue gear walks in a field.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William understands that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background. Hypothesis: William recognizes that it is not the case that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia believes that A man under a running shower with shampoo in his hair. Hypothesis: Amelia believes that it is not the case that A man under a running shower with shampoo in his hair.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor assumes that Man looking at a woman that is smoking on the sidewalk. Hypothesis: Taylor sees that it is not the case that Man looking at a woman that is smoking on the sidewalk.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John recognizes that A child holds a football and runs from other children. Hypothesis: John thinks that it is not the case that A child holds a football and runs from other children.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail assumes that A restaurant front line, with a warmer in the front and a person in a red Coca Cola shirt cooking. Hypothesis: Abigail sees that it is not the case that A restaurant front line, with a warmer in the front and a person in a red Coca Cola shirt cooking.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph suspects that A little girl in a pink soccer outfit standing in front of a soccer net Hypothesis: Joseph recognizes that it is not the case that A little girl in a pink soccer outfit standing in front of a soccer net", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia suspects that A man cooking food on the stove. Hypothesis: Sophia remembers that it is not the case that A man cooking food on the stove.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas sees that Man in gray zippered jacket and red shirt pets a brown dog and holds a young girl in pink shirt, while a woman next to him holds an infant boy and a gray dog. Hypothesis: Thomas believes that it is not the case that Man in gray zippered jacket and red shirt pets a brown dog and holds a young girl in pink shirt, while a woman next to him holds an infant boy and a gray dog.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma believes that A man holding a large swordfish. Hypothesis: Emma learns that it is not the case that A man holding a large swordfish.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia thinks that Sheep farmers are crouching and preparing to feed their animals as the sheepdog watches closely by. Hypothesis: Amelia sees that it is not the case that Sheep farmers are crouching and preparing to feed their animals as the sheepdog watches closely by.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph suspects that A young boy wearing a military sunhat catches a Frisbee outdoors. Hypothesis: Joseph thinks that it is not the case that A young boy wearing a military sunhat catches a Frisbee outdoors.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles recognizes that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes. Hypothesis: Charles believes that it is not the case that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia recognizes that A young woman rides by herself on a swinging carnival ride. Hypothesis: Amelia sees that it is not the case that A young woman rides by herself on a swinging carnival ride.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael assumes that A snowboarder jumps high into the air off of a snowy ramp. Hypothesis: Michael believes that it is not the case that A snowboarder jumps high into the air off of a snowy ramp.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte remembers that A group is gathered outside holding flowers. Hypothesis: Charlotte assumes that it is not the case that A group is gathered outside holding flowers.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert assumes that A man in a blue robe walking a herd of camels in the desert. Hypothesis: Robert believes that it is not the case that A man in a blue robe walking a herd of camels in the desert.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John believes that Brown dog running through shallow water. Hypothesis: John recognizes that it is not the case that Brown dog running through shallow water.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte thinks that Someone is taking a brown canoe down to the lake. Hypothesis: Charlotte understands that it is not the case that Someone is taking a brown canoe down to the lake.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael recognizes that A man wearing a white jacket and pink hat is speaking into a microphone while raising one arm above his head. Hypothesis: Michael knows that it is not the case that A man wearing a white jacket and pink hat is speaking into a microphone while raising one arm above his head.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David understands that Man in skeleton-printed leather outfit sitting astride a red motorcycle. Hypothesis: David assumes that it is not the case that Man in skeleton-printed leather outfit sitting astride a red motorcycle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella believes that Football player jumping to catch the ball with an empty stand behind him. Hypothesis: Isabella believes that it is not the case that Football player jumping to catch the ball with an empty stand behind him.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia sees that A man wearing a white shirt is playing the drums. Hypothesis: Sophia assumes that it is not the case that A man wearing a white shirt is playing the drums.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas assumes that Two older males sitting together on a river boat tour. Hypothesis: Thomas understands that it is not the case that Two older males sitting together on a river boat tour.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard thinks that Two oriental lizards are fighting for dominance in a small pond Hypothesis: Richard recognizes that it is not the case that Two oriental lizards are fighting for dominance in a small pond", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia thinks that Many people standing around a silver car with the hood raised while a young girl in a yellow shirt and blue jeans drinks from a bottle. Hypothesis: Olivia assumes that it is not the case that Many people standing around a silver car with the hood raised while a young girl in a yellow shirt and blue jeans drinks from a bottle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor assumes that A female dancer works on striking a pose. Hypothesis: Taylor recognizes that it is not the case that A female dancer works on striking a pose.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail believes that A woman wearing a scarf, hat, and coat, holding a shopping bag is looking at her phone while standing in front of a store. Hypothesis: Abigail sees that it is not the case that A woman wearing a scarf, hat, and coat, holding a shopping bag is looking at her phone while standing in front of a store.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia sees that A construction worker peeking out of a manhole while his coworker sits on the sidewalk smiling. Hypothesis: Amelia knows that it is not the case that A construction worker peeking out of a manhole while his coworker sits on the sidewalk smiling.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William recognizes that A woman wearing sunglasses holds two newspapers. Hypothesis: William learns that it is not the case that A woman wearing sunglasses holds two newspapers.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert knows that A black race car starts up in front of a crowd of people. Hypothesis: Robert suspects that it is not the case that A black race car starts up in front of a crowd of people.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma learns that well dressed man and woman dancing in the street Hypothesis: Emma believes that it is not the case that well dressed man and woman dancing in the street", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava knows that A gymnast in a blue and pink leotard is standing on her right foot with her left foot in the air and waving a ribbon. Hypothesis: Ava recognizes that it is not the case that A gymnast in a blue and pink leotard is standing on her right foot with her left foot in the air and waving a ribbon.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella knows that A baby crying about getting their diaper changed. Hypothesis: Isabella assumes that it is not the case that A baby crying about getting their diaper changed.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William believes that A brown dog opens his mouth to catch a piece of food. Hypothesis: William believes that it is not the case that A brown dog opens his mouth to catch a piece of food.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph believes that A man in a brightly colored vest performs on stage. Hypothesis: Joseph understands that it is not the case that A man in a brightly colored vest performs on stage.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte assumes that This car is leaving a dust trail as it travels along a dirt road in a wooded area. Hypothesis: Charlotte assumes that it is not the case that This car is leaving a dust trail as it travels along a dirt road in a wooded area.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail knows that Gymnast does a flip on blue flooring. Hypothesis: Abigail remembers that it is not the case that Gymnast does a flip on blue flooring.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn sees that A woman in a blue shirt talking to a baby. Hypothesis: Evelyn sees that it is not the case that A woman in a blue shirt talking to a baby.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas sees that There are five white individuals on a stage in a line, the outer four are looking inward toward the middle individual who has a beard. Hypothesis: Thomas sees that it is not the case that There are five white individuals on a stage in a line, the outer four are looking inward toward the middle individual who has a beard.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor believes that Three boys are standing on the ledge outside of a building. Hypothesis: Taylor believes that it is not the case that Three boys are standing on the ledge outside of a building.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David knows that The quarterback of the UTEP football team is about to be tackled by a member of the Wisconsin defensive team. Hypothesis: David suspects that it is not the case that The quarterback of the UTEP football team is about to be tackled by a member of the Wisconsin defensive team.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava suspects that A bald man in a white t-shirt is standing at a bar next to a white leashed dog. Hypothesis: Ava remembers that it is not the case that A bald man in a white t-shirt is standing at a bar next to a white leashed dog.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia sees that A man is leaning out of a window to paint some decorative iron white. Hypothesis: Olivia sees that it is not the case that A man is leaning out of a window to paint some decorative iron white.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph remembers that Two elder women have a conversation outdoors in front of a house. Hypothesis: Joseph suspects that it is not the case that Two elder women have a conversation outdoors in front of a house.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte believes that Several people are walking on a street and there is a large, blue crane towering and leaning against a building. Hypothesis: Charlotte sees that it is not the case that Several people are walking on a street and there is a large, blue crane towering and leaning against a building.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte recognizes that Two men performing in a music group. Hypothesis: Charlotte knows that it is not the case that Two men performing in a music group.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard remembers that A young boy is bowling for one pin with a ball outside, while 3 other people are in the background. Hypothesis: Richard assumes that it is not the case that A young boy is bowling for one pin with a ball outside, while 3 other people are in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles understands that A group of people standing on rafts with a waterfall in the background. Hypothesis: Charles learns that it is not the case that A group of people standing on rafts with a waterfall in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas thinks that Two women standing outside looking at a water fountain with bright green trees in the background. Hypothesis: Thomas knows that it is not the case that Two women standing outside looking at a water fountain with bright green trees in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard recognizes that A child holds sparklers in the dark. Hypothesis: Richard believes that it is not the case that A child holds sparklers in the dark.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William remembers that A man in a black shirt is standing behind a blue SUV. Hypothesis: William knows that it is not the case that A man in a black shirt is standing behind a blue SUV.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William learns that A man and woman stand facing each other, the man holding an instrument and the woman holding a piece of paper. Hypothesis: William remembers that it is not the case that A man and woman stand facing each other, the man holding an instrument and the woman holding a piece of paper.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava sees that A mother peacefully works on making a beautiful and colorful mat while her son admires her skills. Hypothesis: Ava recognizes that it is not the case that A mother peacefully works on making a beautiful and colorful mat while her son admires her skills.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma knows that Several dancers are doing leg lifts on stage. Hypothesis: Emma knows that it is not the case that Several dancers are doing leg lifts on stage.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert understands that A very young child in a red plaid coat and pink winter hat makes a snowball in a large pile of snow. Hypothesis: Robert learns that it is not the case that A very young child in a red plaid coat and pink winter hat makes a snowball in a large pile of snow.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James learns that A little girl wearing a cardboard diner hat is finishing off some onion rings at a restaurant. Hypothesis: James remembers that it is not the case that A little girl wearing a cardboard diner hat is finishing off some onion rings at a restaurant.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas sees that Boy jumps in desert while others watch and take photo. Hypothesis: Thomas suspects that it is not the case that Boy jumps in desert while others watch and take photo.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn assumes that Two people sit facing away in a downtown scene with a motorcycle parked in front of a pool Hypothesis: Evelyn knows that it is not the case that Two people sit facing away in a downtown scene with a motorcycle parked in front of a pool", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn sees that Two men are playing basketball, and one man is making a shot. Hypothesis: Evelyn assumes that it is not the case that Two men are playing basketball, and one man is making a shot.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail understands that A person in a blue plaid shirt is writing on a chalkboard. Hypothesis: Abigail understands that it is not the case that A person in a blue plaid shirt is writing on a chalkboard.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail sees that A woman in a wheelchair is talking to her friend while surrounded by other people walking in the park. Hypothesis: Abigail suspects that it is not the case that A woman in a wheelchair is talking to her friend while surrounded by other people walking in the park.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles thinks that A group of uniformed men carrying a cross adorned with a white ribbon in formation walking down the street on Easter. Hypothesis: Charles assumes that it is not the case that A group of uniformed men carrying a cross adorned with a white ribbon in formation walking down the street on Easter.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert suspects that Two dogs are tied up outside a shop, with a bicycle leaning against the wall of the shop. Hypothesis: Robert remembers that it is not the case that Two dogs are tied up outside a shop, with a bicycle leaning against the wall of the shop.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael believes that A man cooks a large amount of shellfish in a wok outdoors. Hypothesis: Michael believes that it is not the case that A man cooks a large amount of shellfish in a wok outdoors.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael assumes that A dalmatian runs through the woods. Hypothesis: Michael remembers that it is not the case that A dalmatian runs through the woods.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava understands that A young girl in a white summer dress walks the outer edges of a large park fountain. Hypothesis: Ava sees that it is not the case that A young girl in a white summer dress walks the outer edges of a large park fountain.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia learns that a group of people riding bikes in a marathon as people line the street. Hypothesis: Sophia thinks that it is not the case that a group of people riding bikes in a marathon as people line the street.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard learns that A woman is writing something on a post-it note which is hanging on a bulletin board with a lot of other post-it notes. Hypothesis: Richard believes that it is not the case that A woman is writing something on a post-it note which is hanging on a bulletin board with a lot of other post-it notes.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph knows that A blond-haired lady with a gray tank top and jeans is holding her phone while she puts her other hand through her hair while a dark-haired lady walks next to her. Hypothesis: Joseph learns that it is not the case that A blond-haired lady with a gray tank top and jeans is holding her phone while she puts her other hand through her hair while a dark-haired lady walks next to her.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia thinks that Male and female ballerinas dancing together and he is holding her slightly in air. Hypothesis: Olivia suspects that it is not the case that Male and female ballerinas dancing together and he is holding her slightly in air.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor knows that A young boy looking at a picture book. Hypothesis: Taylor sees that it is not the case that A young boy looking at a picture book.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella knows that A woman lies on a bed with a red, orange, and blue striped comforter crumpled up next to her. Hypothesis: Isabella believes that it is not the case that A woman lies on a bed with a red, orange, and blue striped comforter crumpled up next to her.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David sees that A child is wearing white and blue face paint. Hypothesis: David knows that it is not the case that A child is wearing white and blue face paint.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella assumes that A woman wearing a large bandanna around her neck is sitting at a table putting poker chips into a plastic bag. Hypothesis: Isabella sees that it is not the case that A woman wearing a large bandanna around her neck is sitting at a table putting poker chips into a plastic bag.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William sees that A view of the back of a woman having a beverage. Hypothesis: William knows that it is not the case that A view of the back of a woman having a beverage.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James sees that A woman seated indoors wearing glasses, an orange shirt, jeans and sandals is eating from a container in her hand. Hypothesis: James knows that it is not the case that A woman seated indoors wearing glasses, an orange shirt, jeans and sandals is eating from a container in her hand.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John thinks that Several people are wading in a river in a deep gorge. Hypothesis: John knows that it is not the case that Several people are wading in a river in a deep gorge.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail knows that A black and white dog prepares to catch a Frisbee. Hypothesis: Abigail believes that it is not the case that A black and white dog prepares to catch a Frisbee.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James believes that Man and a woman walking on the street Hypothesis: James remembers that it is not the case that Man and a woman walking on the street", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn thinks that Couple watching the moon on a bridge. Hypothesis: Evelyn recognizes that it is not the case that Couple watching the moon on a bridge.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John recognizes that A colorfully dressed young man with visible skin lesions is sitting and smoking a cigarette. Hypothesis: John suspects that it is not the case that A colorfully dressed young man with visible skin lesions is sitting and smoking a cigarette.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph thinks that The two farmers are working on a piece of John Deere equipment. Hypothesis: Joseph suspects that it is not the case that The two farmers are working on a piece of John Deere equipment.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael believes that A woman wearing a black shirt is standing next to an old rusted vehicle. Hypothesis: Michael believes that it is not the case that A woman wearing a black shirt is standing next to an old rusted vehicle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William learns that Riot police are standing in the background while a young man with a red scarf covering his face is walking. Hypothesis: William remembers that it is not the case that Riot police are standing in the background while a young man with a red scarf covering his face is walking.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William believes that A young woman dressed as a princess is waving to others from inside a ride where the carriage is a large replica of the Disney character, Dumbo. Hypothesis: William believes that they recognizes that A young woman dressed as a princess is waving to others from inside a ride where the carriage is a large replica of the Disney character, Dumbo.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William suspects that A group of people engaged in some sort of outdoor gathering or ritual. Hypothesis: William suspects that they remembers that A group of people engaged in some sort of outdoor gathering or ritual.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard assumes that two golden dogs are chewing a white cushion on a wooden patio. Hypothesis: Richard assumes that they knows that two golden dogs are chewing a white cushion on a wooden patio.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia thinks that A group of people are watching a band play music while one lady tries to take a picture of them. Hypothesis: Sophia thinks that they recognizes that A group of people are watching a band play music while one lady tries to take a picture of them.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte suspects that several people standing below a clock tower with two clock faces. Hypothesis: Charlotte suspects that they remembers that several people standing below a clock tower with two clock faces.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava believes that A boy riding on a carnival ride turns around for a photograph. Hypothesis: Ava believes that they knows that A boy riding on a carnival ride turns around for a photograph.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles thinks that A dune buggy traveling on sand. Hypothesis: Charles thinks that they remembers that A dune buggy traveling on sand.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia thinks that Two ladies are sitting in the restaurant talking and laughing. Hypothesis: Olivia thinks that they knows that Two ladies are sitting in the restaurant talking and laughing.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia assumes that A child in a red jacket, waist deep in a pit on the beach. Hypothesis: Olivia assumes that they understands that A child in a red jacket, waist deep in a pit on the beach.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John assumes that On stage, the innards of a piano are shown next to a man at a desk who is working on electronics, while a long-haired man is looking at a screen which shows \"53:11\". Hypothesis: John assumes that they recognizes that On stage, the innards of a piano are shown next to a man at a desk who is working on electronics, while a long-haired man is looking at a screen which shows \"53:11\".", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia suspects that A man with a blue shirt and glasses points to a picture in a book in front of a little girl and a stack of books. Hypothesis: Amelia suspects that they learns that A man with a blue shirt and glasses points to a picture in a book in front of a little girl and a stack of books.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert assumes that A group of people gathered to watch fireworks. Hypothesis: Robert assumes that they recognizes that A group of people gathered to watch fireworks.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David thinks that Three Oklahoma Sooners playing football against another team, one of the sooners with the ball in their possession. Hypothesis: David thinks that they recognizes that Three Oklahoma Sooners playing football against another team, one of the sooners with the ball in their possession.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles assumes that A man wearing a white shirt and black shorts in competing in pole vault. Hypothesis: Charles assumes that they recognizes that A man wearing a white shirt and black shorts in competing in pole vault.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David believes that Excavation of the ruins of a ancient temple. Hypothesis: David believes that they learns that Excavation of the ruins of a ancient temple.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia thinks that An extremely wet woman is wading in front of a waterfall. Hypothesis: Sophia thinks that they knows that An extremely wet woman is wading in front of a waterfall.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava assumes that The view of a man with a shaved head and blue shirt through a chain-linked fence. Hypothesis: Ava assumes that they remembers that The view of a man with a shaved head and blue shirt through a chain-linked fence.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia believes that An old bearded man plays a hand flute on the side of a sidewalk. Hypothesis: Sophia believes that they recognizes that An old bearded man plays a hand flute on the side of a sidewalk.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas suspects that Two older men speak into microphones on a stage, while a projector screen displays a vintage photo of a young man behind them. Hypothesis: Thomas suspects that they understands that Two older men speak into microphones on a stage, while a projector screen displays a vintage photo of a young man behind them.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte believes that They are sitting on the edge of a fountain Hypothesis: Charlotte believes that they learns that They are sitting on the edge of a fountain", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William assumes that A man about to smash something with a very large sledgehammer. Hypothesis: William assumes that they sees that A man about to smash something with a very large sledgehammer.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael believes that Three women wearing belly dancing costumes are pictured in color while the background of the shot is in black and white. Hypothesis: Michael believes that they sees that Three women wearing belly dancing costumes are pictured in color while the background of the shot is in black and white.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte suspects that A black dog plays with a white and blue colored stuffed animal. Hypothesis: Charlotte suspects that they knows that A black dog plays with a white and blue colored stuffed animal.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia assumes that In a field of tall grass, a small girl feeds a larger boy a bite of some type of food. Hypothesis: Sophia assumes that they recognizes that In a field of tall grass, a small girl feeds a larger boy a bite of some type of food.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William assumes that A man and a woman are jumping in midair and holding hands, a cloudy sky in the background. Hypothesis: William assumes that they knows that A man and a woman are jumping in midair and holding hands, a cloudy sky in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William thinks that man grilling fish on barbecue Hypothesis: William thinks that they understands that man grilling fish on barbecue", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn suspects that A group of men in fatigues eat at a fast food restaurant. Hypothesis: Evelyn suspects that they sees that A group of men in fatigues eat at a fast food restaurant.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava thinks that Two females and one male looking at various merchandise. Hypothesis: Ava thinks that they remembers that Two females and one male looking at various merchandise.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia assumes that A man is performing an aerial skateboard trick on a ramp with several other people behind him. Hypothesis: Olivia assumes that they recognizes that A man is performing an aerial skateboard trick on a ramp with several other people behind him.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas believes that A woman is standing near the water, looks to be throwing something. Hypothesis: Thomas believes that they learns that A woman is standing near the water, looks to be throwing something.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas believes that A little girl with a hat sits between a woman's feet in the sand in front of a pair of colorful tents. Hypothesis: Thomas believes that they understands that A little girl with a hat sits between a woman's feet in the sand in front of a pair of colorful tents.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella believes that People dressed in costumes walking down a street. Hypothesis: Isabella believes that they learns that People dressed in costumes walking down a street.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas thinks that A man in a dark floral shirt and black jeans walks buy a brightly colored wall painted with a woman with bright green eyes. Hypothesis: Thomas thinks that they understands that A man in a dark floral shirt and black jeans walks buy a brightly colored wall painted with a woman with bright green eyes.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William assumes that A group of people are standing in front of parked bicycles on a corner with various carrying bags on the ground. Hypothesis: William assumes that they sees that A group of people are standing in front of parked bicycles on a corner with various carrying bags on the ground.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas thinks that Middle-aged man in jeans and dark blue t-shirt carrying a black item and walking across a lawn. Hypothesis: Thomas thinks that they remembers that Middle-aged man in jeans and dark blue t-shirt carrying a black item and walking across a lawn.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John assumes that Two men making dance moves as a woman films the event in the living room of a house or apartment. Hypothesis: John assumes that they understands that Two men making dance moves as a woman films the event in the living room of a house or apartment.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma suspects that A man with a white shirt and blue jeans are skating on a skating device. Hypothesis: Emma suspects that they recognizes that A man with a white shirt and blue jeans are skating on a skating device.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William assumes that Three young men in blue jeans are gathered inside a wood-paneled room, one of them handling a crossbow. Hypothesis: William assumes that they learns that Three young men in blue jeans are gathered inside a wood-paneled room, one of them handling a crossbow.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph thinks that Young child is falling through the air from a swing. Hypothesis: Joseph thinks that they knows that Young child is falling through the air from a swing.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James assumes that A husky and a black cat nuzzling. Hypothesis: James assumes that they sees that A husky and a black cat nuzzling.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava assumes that A little girl with blond pigtails is being held upside down by a blond woman with a ponytail. Hypothesis: Ava assumes that they recognizes that A little girl with blond pigtails is being held upside down by a blond woman with a ponytail.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn assumes that Two little girls and one little boy are running on the grass. Hypothesis: Evelyn assumes that they understands that Two little girls and one little boy are running on the grass.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma believes that Dog running down paved walkway near a Japanese maple tree. Hypothesis: Emma believes that they remembers that Dog running down paved walkway near a Japanese maple tree.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John thinks that There are four US military soldiers in this photo, only two have their faces in the picture, there is a pack of cigarettes by one of their boots, they appear to be fixing a motorcycle. Hypothesis: John thinks that they learns that There are four US military soldiers in this photo, only two have their faces in the picture, there is a pack of cigarettes by one of their boots, they appear to be fixing a motorcycle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert believes that A young girl in a pink coat erasing words on a chalkboard sign. Hypothesis: Robert believes that they knows that A young girl in a pink coat erasing words on a chalkboard sign.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn assumes that Two girls riding on an amusement part ride. Hypothesis: Evelyn assumes that they knows that Two girls riding on an amusement part ride.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John believes that A young girl with a white vest, pink sleeves and pink knit hat with flower is looking at the flower blossoms on a tree. Hypothesis: John believes that they understands that A young girl with a white vest, pink sleeves and pink knit hat with flower is looking at the flower blossoms on a tree.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James thinks that A group of people dressed in Santa Claus suits are looking towards an audience while a DJ runs a sound board and another person throws green balls into the air. Hypothesis: James thinks that they sees that A group of people dressed in Santa Claus suits are looking towards an audience while a DJ runs a sound board and another person throws green balls into the air.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William believes that An infant is in a crib and crying. Hypothesis: William believes that they knows that An infant is in a crib and crying.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard assumes that A woman is sitting outside while holding two cats. Hypothesis: Richard assumes that they sees that A woman is sitting outside while holding two cats.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia believes that A woman in black clothing runs down the street barefoot next to two people on bicycles and a female runner. Hypothesis: Sophia believes that they sees that A woman in black clothing runs down the street barefoot next to two people on bicycles and a female runner.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn suspects that A girl in a child's swimming pool. Hypothesis: Evelyn suspects that they learns that A girl in a child's swimming pool.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael assumes that Young boys playing indoor basketball, one team has black and white uniforms, the other has orange and white. Hypothesis: Michael assumes that they recognizes that Young boys playing indoor basketball, one team has black and white uniforms, the other has orange and white.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava thinks that a bearded man takes a nap. Hypothesis: Ava thinks that they learns that a bearded man takes a nap.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David suspects that These two poodles, one black and one brown, are playing. Hypothesis: David suspects that they understands that These two poodles, one black and one brown, are playing.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail thinks that A man wearing large snowshoes runs inside of a seemingly crowded ski resort. Hypothesis: Abigail thinks that they learns that A man wearing large snowshoes runs inside of a seemingly crowded ski resort.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James suspects that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish. Hypothesis: James suspects that they remembers that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia assumes that A cowboy clown wearing a shirt with Tax on it, red suspenders, and a white cowboy hat talks into a wireless microphone. Hypothesis: Amelia assumes that they recognizes that A cowboy clown wearing a shirt with Tax on it, red suspenders, and a white cowboy hat talks into a wireless microphone.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn believes that Two men play a game of chess in the park while two others eagerly await their chance Hypothesis: Evelyn believes that they learns that Two men play a game of chess in the park while two others eagerly await their chance", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael believes that A group of women wearing bikinis are playing beach volleyball. Hypothesis: Michael believes that they learns that A group of women wearing bikinis are playing beach volleyball.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella believes that A man with a shopping cart is studying the shelves in a supermarket aisle. Hypothesis: Isabella believes that they understands that A man with a shopping cart is studying the shelves in a supermarket aisle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard thinks that A man with a blue and gray shirt is standing in front of a metal fence while taking a picture of the landscape. Hypothesis: Richard thinks that they sees that A man with a blue and gray shirt is standing in front of a metal fence while taking a picture of the landscape.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael believes that A man with a blue and gray shirt is standing in front of a metal fence while taking a picture of the landscape. Hypothesis: Michael believes that they learns that A man with a blue and gray shirt is standing in front of a metal fence while taking a picture of the landscape.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael thinks that There are three men in this picture, two are on motorbikes, one of the men has a large piece of furniture on the back of his bike, the other is about to be handed a piece of paper by a man in a white shirt. Hypothesis: Michael thinks that they learns that There are three men in this picture, two are on motorbikes, one of the men has a large piece of furniture on the back of his bike, the other is about to be handed a piece of paper by a man in a white shirt.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava believes that A skier is jumping in the air over a snowfield near a mountain range. Hypothesis: Ava believes that they recognizes that A skier is jumping in the air over a snowfield near a mountain range.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James thinks that One military man executes a combat move on another outside a gated facility. Hypothesis: James thinks that they remembers that One military man executes a combat move on another outside a gated facility.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn thinks that What appears to be a taller bald white man sitting next to a shorter black man in a reception area. Hypothesis: Evelyn thinks that they learns that What appears to be a taller bald white man sitting next to a shorter black man in a reception area.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava suspects that man wearing a harmonica playing the guitar and singing Hypothesis: Ava suspects that they learns that man wearing a harmonica playing the guitar and singing", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles suspects that Groups of people walking different directions, mostly dressed in dark blues and dressed to stay warm. Hypothesis: Charles suspects that they sees that Groups of people walking different directions, mostly dressed in dark blues and dressed to stay warm.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles suspects that Man plays electronic drum set in band. Hypothesis: Charles suspects that they understands that Man plays electronic drum set in band.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James thinks that A girl all in black and white, and carrying an umbrella, walks down the street, as others watch. Hypothesis: James thinks that they remembers that A girl all in black and white, and carrying an umbrella, walks down the street, as others watch.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John thinks that Three young men are cleaning up a classroom. Hypothesis: John thinks that they knows that Three young men are cleaning up a classroom.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David believes that A man with a checkered shirt on is giving a powerpoint presentation to people. Hypothesis: David believes that they recognizes that A man with a checkered shirt on is giving a powerpoint presentation to people.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia thinks that Three men handling a net on the seashore. Hypothesis: Amelia thinks that they sees that Three men handling a net on the seashore.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail assumes that Black greyhound dog racing down a track. Hypothesis: Abigail assumes that they learns that Black greyhound dog racing down a track.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert thinks that A man and woman, she's dressed all in white, he has a white shirt, holding hands while walking Hypothesis: Robert thinks that they recognizes that A man and woman, she's dressed all in white, he has a white shirt, holding hands while walking", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles believes that A man in swimming trunks kicking a ball at the beach. Hypothesis: Charles believes that they recognizes that A man in swimming trunks kicking a ball at the beach.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma assumes that Man observes a wavelength given off by an electronic device. Hypothesis: Emma assumes that they understands that Man observes a wavelength given off by an electronic device.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William thinks that A man wearing black pants and jacket is on a blue scooter next to a crowd of people and a green tent. Hypothesis: William thinks that they recognizes that A man wearing black pants and jacket is on a blue scooter next to a crowd of people and a green tent.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia believes that Several firemen stand or sit on a gray roof while working. Hypothesis: Olivia believes that they learns that Several firemen stand or sit on a gray roof while working.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David thinks that Three people wearing black chatting on a street corner. Hypothesis: David thinks that they understands that Three people wearing black chatting on a street corner.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma thinks that People are camping in a group. Hypothesis: Emma thinks that they remembers that People are camping in a group.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas suspects that Rugby player in blue dives to tackle the ball carrier in white. Hypothesis: Thomas suspects that they recognizes that Rugby player in blue dives to tackle the ball carrier in white.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James assumes that A person is folding laundry on the floor. Hypothesis: James assumes that they learns that A person is folding laundry on the floor.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor assumes that A woman with a crescent tattoo on her shoulder is painting an image of a face onto a wall. Hypothesis: Taylor assumes that they learns that A woman with a crescent tattoo on her shoulder is painting an image of a face onto a wall.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael suspects that A smiling woman is playing the violin in front of a turquoise background. Hypothesis: Michael suspects that they remembers that A smiling woman is playing the violin in front of a turquoise background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William suspects that A man in glasses and a striped shirt walks down the street with one hand in his pocket. Hypothesis: William suspects that they sees that A man in glasses and a striped shirt walks down the street with one hand in his pocket.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava suspects that Man with dreadlocks on a skateboard in the middle of the street. Hypothesis: Ava suspects that they sees that Man with dreadlocks on a skateboard in the middle of the street.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William suspects that This wildly dressed couple are walking past a poster. Hypothesis: William suspects that they learns that This wildly dressed couple are walking past a poster.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia believes that A man is photographing a small staked camel and a woman is trying to walk past it. Hypothesis: Sophia believes that they sees that A man is photographing a small staked camel and a woman is trying to walk past it.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas assumes that A woman in a black jacket with yellow on the back talking to a man with a black jacket and cameras hanging down from his shoulders and neck. Hypothesis: Thomas assumes that they learns that A woman in a black jacket with yellow on the back talking to a man with a black jacket and cameras hanging down from his shoulders and neck.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John thinks that The police officer riding a horse is talking to a man riding a bike. Hypothesis: John thinks that they learns that The police officer riding a horse is talking to a man riding a bike.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles believes that A man in a red shirt is being serviced by a working old woman in a store. Hypothesis: Charles believes that they remembers that A man in a red shirt is being serviced by a working old woman in a store.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma assumes that a big tan dog drinks water from an outdoor water spout. Hypothesis: Emma assumes that they learns that a big tan dog drinks water from an outdoor water spout.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava assumes that A young blond child wearing only a diaper sits on a large rock at the edge of a body of water while a large black dog stands in the water nearby. Hypothesis: Ava assumes that they understands that A young blond child wearing only a diaper sits on a large rock at the edge of a body of water while a large black dog stands in the water nearby.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James suspects that The pitcher wearing black heaves the ball toward the catcher. Hypothesis: James suspects that they learns that The pitcher wearing black heaves the ball toward the catcher.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor believes that A man in a white button-up shirt looks to the side while sitting at a table by the street. Hypothesis: Taylor believes that they sees that A man in a white button-up shirt looks to the side while sitting at a table by the street.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles believes that A child in red is guided by an adult. Hypothesis: Charles believes that they sees that A child in red is guided by an adult.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph suspects that A man riding a dirt bike on a racetrack. Hypothesis: Joseph suspects that they sees that A man riding a dirt bike on a racetrack.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte assumes that A man in a straw hat and another man in a striped shirt who are both drinking from cups and making funny faces. Hypothesis: Charlotte assumes that they understands that A man in a straw hat and another man in a striped shirt who are both drinking from cups and making funny faces.", "target_scores": {"entailment": 0, "non_entailment": 1}}]}