{"name": "mixed epistemic reasoning", "description": "A mixture of the BIG-bench epistemic reasoning dataset and kd45 reasoning dataset", "examples": [{"input": "Premise: Michael suspects that Charles assumes that a young boy gets his photo taken with Mr. and Mrs. Clause. Hypothesis: Michael suspects that a young boy gets his photo taken with Mr. and Mrs. Clause.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph thinks that a boy in red and a girl pink are walking through a low cut field. Hypothesis: Evelyn thinks that kids are walking in a field.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia thinks that Charles thinks that a man wearing a black t-shirt that says \"Long Live the Dead\" pulls a shopping cart in the street near a NYC yellow taxi cab. Hypothesis: Sophia thinks that a man wearing a black t-shirt that says \"Long Live the Dead\" pulls a shopping cart in the street near a NYC yellow taxi cab.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava thinks that Richard assumes that a young infant cries while having his or her pajamas buttoned. Hypothesis: Ava thinks that a young infant cries while having his or her pajamas buttoned.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor assumes that John understands that a woman with a bag, talking on her cellphone, standing on the corner of the street, waiting to cross. Hypothesis: Taylor assumes that a woman with a bag, talking on her cellphone, standing on the corner of the street, waiting to cross.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert suspects that Sophia recognizes that in an apparent classroom setting, a young man in a blue t-shirt has a book on his knee while a woman dressed in black next to him leans in to point out something in the book. Hypothesis: Sophia recognizes that in an apparent classroom setting, a young man in a blue t-shirt has a book on his knee while a woman dressed in black next to him leans in to point out something in the book.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles assumes that John assumes that a woman in black is getting ready in her bathroom. Hypothesis: John assumes that a woman in black is getting ready in her bathroom.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles believes that Robert knows that a young Asian woman wearing a blue shirt and blue jeans sits on her bike, as a young boy, with his bike down, looks up. Hypothesis: Charles believes that a young Asian woman wearing a blue shirt and blue jeans sits on her bike, as a young boy, with his bike down, looks up.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert sees that David assumes that businessman walking as two arrows point to him. Hypothesis: David assumes that businessman walking as two arrows point to him.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John recognizes that Emma thinks that a wet golden retriever is walking through a lake. Hypothesis: Emma thinks that John recognizes that a wet golden retriever is walking through a lake.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James remembers that Isabella assumes that a man is throwing something into the road. Hypothesis: Isabella assumes that James remembers that a man is throwing something into the road.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia recognizes that a boy in a blue uniform is standing next to a boy in red and a boy in yellow and they are holding baseball gloves. Hypothesis: Sophia recognizes that three boys hold baseball gloves.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella believes that Amelia thinks that a young boy looks on as a man performs the guitar on the street while sitting on a bench. Hypothesis: Amelia thinks that a young boy looks on as a man performs the guitar on the street while sitting on a bench.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael believes that David believes that a boy and a woman are on top of large rocks at sunset. Hypothesis: Michael believes that a boy and a woman are on top of large rocks at sunset.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella understands that Emma thinks that a little girl listens to a cellphone. Hypothesis: Emma thinks that Isabella understands that a little girl listens to a cellphone.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John suspects that Emma suspects that a teenager blows a whistle and wears white face paint, earmuffs, and a yellow hat while another teen watches. Hypothesis: John suspects that a teenager blows a whistle and wears white face paint, earmuffs, and a yellow hat while another teen watches.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James assumes that Charlotte believes that boy with red shorts getting soaked with water. Hypothesis: Charlotte believes that boy with red shorts getting soaked with water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte remembers that Olivia believes that a man and wife stand at the alter as they get married. Hypothesis: Olivia believes that Charlotte remembers that a man and wife stand at the alter as they get married.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles thinks that Abigail assumes that a girl in a costume is performing a dance as other girls in costumes watch. Hypothesis: Abigail assumes that a girl in a costume is performing a dance as other girls in costumes watch.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph thinks that Taylor recognizes that a girl in a white knit hat and winter gear rubs her tongue over her braces. Hypothesis: Joseph thinks that a girl in a white knit hat and winter gear rubs her tongue over her braces.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert learns that James suspects that a man with a beard is playing an acoustic guitar on the street. Hypothesis: James suspects that Robert learns that a man with a beard is playing an acoustic guitar on the street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael suspects that Ava thinks that a Young girl wearing a blue ski cap and red and gray two tone jacket stands between two bits of ice. Hypothesis: Michael suspects that a Young girl wearing a blue ski cap and red and gray two tone jacket stands between two bits of ice.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas recognizes that a boy in a green shirt surrounded by toys and another boy, wearing a blue shirt with penguins, to his left. Hypothesis: Thomas recognizes that two boys sit in a classroom at their desks.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella believes that David assumes that two hikers are backpacking up a snow slope. Hypothesis: David assumes that two hikers are backpacking up a snow slope.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia suspects that Joseph believes that a farmer tends to his chores. Hypothesis: Olivia suspects that a farmer tends to his chores.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John remembers that Robert thinks that a man with a beer in his hand listens to a woman talk. Hypothesis: Robert thinks that a man with a beer in his hand listens to a woman talk.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William recognizes that three children, two boys and a girl, are playing with the swings on a playground with residential houses in the background. Hypothesis: John recognizes that the children are less than 20 yrs old.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard suspects that Amelia knows that the wind propels a sailing ship on a group of cruisers. Hypothesis: Richard suspects that the wind propels a sailing ship on a group of cruisers.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail thinks that Joseph thinks that two belly dancers perform with each other in the streets while passersby look on and watch the display. Hypothesis: Joseph thinks that two belly dancers perform with each other in the streets while passersby look on and watch the display.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella sees that Amelia assumes that a middle-aged woman with red-hair, a white shirt, and a silver beaded necklace is holding a yellow cellphone against her ear while talking. Hypothesis: Amelia assumes that Isabella sees that a middle-aged woman with red-hair, a white shirt, and a silver beaded necklace is holding a yellow cellphone against her ear while talking.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia believes that Richard believes that the small dog is running across the lawn. Hypothesis: Sophia believes that the small dog is running across the lawn.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John assumes that Amelia learns that hikers walk along some tough terrain. Hypothesis: John assumes that hikers walk along some tough terrain.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor assumes that Joseph recognizes that a boy runs as others play on a homemade slip and slide. Hypothesis: Taylor assumes that a boy runs as others play on a homemade slip and slide.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John assumes that chefs prepare food on a grill in front of their customers. Hypothesis: John assumes that chefs are making food for customers.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James assumes that Ava believes that a man in a red raincoat is looking to the opposite site of the camera. Hypothesis: Ava believes that a man in a red raincoat is looking to the opposite site of the camera.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava suspects that Evelyn believes that a crowd gathers and watches a bonfire. Hypothesis: Evelyn believes that a crowd gathers and watches a bonfire.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William sees that Isabella thinks that a child with wet hair is holding a butterfly decorated beach ball. Hypothesis: Isabella thinks that a child with wet hair is holding a butterfly decorated beach ball.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn thinks that Thomas assumes that a dog jumps over the pole. Hypothesis: Evelyn thinks that a dog jumps over the pole.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard understands that John thinks that a man standing on a street with a suitcase in front of him while another man bends down to look at what is displayed on top of it. Hypothesis: John thinks that a man standing on a street with a suitcase in front of him while another man bends down to look at what is displayed on top of it.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles recognizes that John believes that a brown dog wearing a collar is chasing and biting on a red broom. Hypothesis: John believes that Charles recognizes that a brown dog wearing a collar is chasing and biting on a red broom.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas knows that David suspects that a boy in a green shirt is sitting in an almost empty stadium. Hypothesis: David suspects that Thomas knows that a boy in a green shirt is sitting in an almost empty stadium.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma assumes that Joseph believes that a man is wearing protective hair and face coverings. Hypothesis: Joseph believes that a man is wearing protective hair and face coverings.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma suspects that Abigail suspects that a matador in white and gold clothing and pink sock is getting hit by a raging bull. Hypothesis: Abigail suspects that a matador in white and gold clothing and pink sock is getting hit by a raging bull.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor suspects that Joseph recognizes that child plays with pigeon in busy public area while group of people watch him play. Hypothesis: Joseph recognizes that child plays with pigeon in busy public area while group of people watch him play.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John assumes that Evelyn remembers that two men are assisting a small girl in a harness. Hypothesis: Evelyn remembers that two men are assisting a small girl in a harness.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David recognizes that Amelia suspects that a white man in a blue uniform is pushing away a black man in a red uniform while the two play soccer on a green field. Hypothesis: Amelia suspects that a white man in a blue uniform is pushing away a black man in a red uniform while the two play soccer on a green field.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia understands that four entertainers dressed in Roman style garb are performing at an outdoor theater. Hypothesis: Sophia understands that people are outdoors.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail assumes that Richard knows that a gray rally car is being driven by two adult males while a large white container is tied down on top of the roof. Hypothesis: Richard knows that a gray rally car is being driven by two adult males while a large white container is tied down on top of the roof.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor understands that John thinks that a skateboard is grinding on a curb with his skateboard. Hypothesis: John thinks that a skateboard is grinding on a curb with his skateboard.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert understands that Evelyn thinks that this is a very large vegetable stand under a white tent. Hypothesis: Evelyn thinks that this is a very large vegetable stand under a white tent.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles assumes that Emma believes that a person in a black and green outfit is riding a bicycle. Hypothesis: Charles assumes that a person in a black and green outfit is riding a bicycle.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte suspects that Amelia thinks that a school aged child wearing makeup and doing a hand sign sits on the ground among similar aged children who are all making the same sign. Hypothesis: Amelia thinks that a school aged child wearing makeup and doing a hand sign sits on the ground among similar aged children who are all making the same sign.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John suspects that Amelia remembers that a man and woman talk to another woman, all looking concerned, in a room being decorated with streamers and balloons. Hypothesis: John suspects that a man and woman talk to another woman, all looking concerned, in a room being decorated with streamers and balloons.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael believes that John remembers that a woman in a gray sweatshirt is sitting on the floor with her small dog that is wrapped in a blanket. Hypothesis: John remembers that a woman in a gray sweatshirt is sitting on the floor with her small dog that is wrapped in a blanket.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John suspects that Taylor thinks that a man is throwing a small white ball at some red cups. Hypothesis: Taylor thinks that a man is throwing a small white ball at some red cups.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte assumes that Joseph understands that two men at a fish market filled with boxes of fish and freshly cut fillets study a weight scale. Hypothesis: Charlotte assumes that two men at a fish market filled with boxes of fish and freshly cut fillets study a weight scale.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles believes that a dog is running parallel with the ocean waves. Hypothesis: Charles believes that a dog is on the beach.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma suspects that a street performer wearing sunglasses and painted in bronze colored paint is acting like he is filming with an old-fashioned prop film camera. Hypothesis: Amelia suspects that a street performer is acting out a scene.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor suspects that Thomas understands that a young girl wearing yellow shorts and a white tank top using a cane pole to fish at a small pond. Hypothesis: Taylor suspects that a young girl wearing yellow shorts and a white tank top using a cane pole to fish at a small pond.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James believes that Emma recognizes that a man dressed in a surfing shirt and blue and white shorts skillfully guides his yellow board with its multicolored sail over the crest of an ocean wave, flipping over in the process. Hypothesis: James believes that a man dressed in a surfing shirt and blue and white shorts skillfully guides his yellow board with its multicolored sail over the crest of an ocean wave, flipping over in the process.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John believes that Charles remembers that a man and two women are walking down a wooded path, the man is pushing a young child in a three wheel carriage. Hypothesis: John believes that a man and two women are walking down a wooded path, the man is pushing a young child in a three wheel carriage.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas thinks that Olivia suspects that a young boy is jumping down an inflatable water ride. Hypothesis: Thomas thinks that a young boy is jumping down an inflatable water ride.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David believes that Thomas remembers that a rugby player running the ball between two downed opponents. Hypothesis: Thomas remembers that a rugby player running the ball between two downed opponents.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard thinks that Amelia understands that a group of young men in a gym take turns scoring in basketball. Hypothesis: Amelia understands that a group of young men in a gym take turns scoring in basketball.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella assumes that James sees that a man biking down a tunnel. Hypothesis: Isabella assumes that a man biking down a tunnel.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia suspects that Taylor understands that kids work at computers with a teacher's help. Hypothesis: Olivia suspects that kids work at computers with a teacher's help.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia knows that Abigail believes that a woman with a red scarf, white shirt, and tan shorts is giving a shushing sign to the camera in front of shelves of books. Hypothesis: Abigail believes that a woman with a red scarf, white shirt, and tan shorts is giving a shushing sign to the camera in front of shelves of books.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia recognizes that James believes that a man with no shirt on is holding a football. Hypothesis: James believes that Sophia recognizes that a man with no shirt on is holding a football.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert understands that Charlotte thinks that a boy is being splashed in a swimming pool. Hypothesis: Charlotte thinks that a boy is being splashed in a swimming pool.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail thinks that Robert assumes that an expensive car is parked in what looks like a car-wash with a man standing at the open passenger door side. Hypothesis: Abigail thinks that an expensive car is parked in what looks like a car-wash with a man standing at the open passenger door side.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma assumes that Robert knows that a young man wearing a hoodie, pants, and athletic shoes is sitting on a red lounge chair and watching hi-def tv. Hypothesis: Emma assumes that a young man wearing a hoodie, pants, and athletic shoes is sitting on a red lounge chair and watching hi-def tv.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas thinks that two girls are playing in the snow and throwing snowballs. Hypothesis: Thomas thinks that two girls are somewhere cold.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James assumes that Taylor assumes that a man in a black hat, standing on the street while playing an electric guitar and singing. Hypothesis: James assumes that a man in a black hat, standing on the street while playing an electric guitar and singing.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph suspects that an older gentleman wearing a hat is walking on crutches next to a busy street. Hypothesis: Joseph suspects that an man on crutches is outside.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas sees that Richard believes that a man with a red beard and mustache is smiling and wearing a hat crocheted with green yarn and Miller beer cans. Hypothesis: Richard believes that a man with a red beard and mustache is smiling and wearing a hat crocheted with green yarn and Miller beer cans.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael thinks that Thomas believes that children play on a sidewalk with dolls and chalk. Hypothesis: Michael thinks that children play on a sidewalk with dolls and chalk.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava believes that Abigail understands that two people play horseshoes. Hypothesis: Ava believes that two people play horseshoes.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William learns that David believes that men wearing life vests speed across a body of water in an orange boat. Hypothesis: David believes that men wearing life vests speed across a body of water in an orange boat.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard knows that Sophia believes that a smiling bride sits in a swing with her smiling groom standing behind her posing for the male photographer while a boy holding a bottled drink and another boy wearing a green shirt observe. Hypothesis: Sophia believes that a smiling bride sits in a swing with her smiling groom standing behind her posing for the male photographer while a boy holding a bottled drink and another boy wearing a green shirt observe.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava learns that a woman wearing a red coat stands on a wood floor in front of several paintings while two girls sit on the floor at her feet. Hypothesis: Ava learns that woman views paintings with two girls at her feet.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia learns that Evelyn assumes that two men playing in a beautiful lake surrounded by mountains. Hypothesis: Evelyn assumes that two men playing in a beautiful lake surrounded by mountains.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William thinks that a man stands by a load of boxes near a pizza restaurant. Hypothesis: Ava thinks that a man stands by boxes.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard thinks that Thomas knows that men are playing rugby while covered in mud. Hypothesis: Richard thinks that men are playing rugby while covered in mud.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte suspects that James remembers that a man wearing a long brown robe is playing the guitar while another person is sitting at the drums and yet another is wearing a long gray robe and singing. Hypothesis: Charlotte suspects that a man wearing a long brown robe is playing the guitar while another person is sitting at the drums and yet another is wearing a long gray robe and singing.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella believes that three people are walking on a beach. Hypothesis: Isabella believes that a few people are near the ocean.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma assumes that Abigail learns that a young boy giving his brother a piggyback ride. Hypothesis: Emma assumes that a young boy giving his brother a piggyback ride.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David thinks that a bare-chested man fitting his head and arm into a toilet seat ring while spectators watch in a city. Hypothesis: John thinks that a contortionist fits his head and arms through a toilet seat.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas assumes that Robert believes that a women's volleyball team plays in a brown and green gymnasium. Hypothesis: Robert believes that a women's volleyball team plays in a brown and green gymnasium.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William understands that lady in black skirt is getting excited. Hypothesis: William understands that a lady is excited.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia believes that William believes that two young teenage girls hiking through the snow on a cold winter day. Hypothesis: William believes that two young teenage girls hiking through the snow on a cold winter day.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael thinks that Thomas believes that children play on a sidewalk with dolls and chalk. Hypothesis: Michael thinks that children play on a sidewalk with dolls and chalk.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James thinks that William believes that a man flying out of a river raft filled with 6 other people. Hypothesis: William believes that a man flying out of a river raft filled with 6 other people.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas believes that Isabella sees that a man performing auto repair in front of a building. Hypothesis: Isabella sees that a man performing auto repair in front of a building.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella assumes that Michael sees that two female martial artists demonstrate a kick for an audience. Hypothesis: Isabella assumes that two female martial artists demonstrate a kick for an audience.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte suspects that James remembers that a man wearing a long brown robe is playing the guitar while another person is sitting at the drums and yet another is wearing a long gray robe and singing. Hypothesis: Charlotte suspects that a man wearing a long brown robe is playing the guitar while another person is sitting at the drums and yet another is wearing a long gray robe and singing.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph remembers that Evelyn suspects that a man is riding his dirt bike through the air in the desert. Hypothesis: Evelyn suspects that Joseph remembers that a man is riding his dirt bike through the air in the desert.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John thinks that Charles believes that a young woman is standing on a slope, facing the top of the slope. Hypothesis: John thinks that a young woman is standing on a slope, facing the top of the slope.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia assumes that Michael suspects that two men on opposing teams are playing soccer in a field. Hypothesis: Sophia assumes that two men on opposing teams are playing soccer in a field.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William learns that two young boys are playing in a fountain in a city plaza. Hypothesis: Ava learns that kids are splashing around in a fountain.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail thinks that Joseph thinks that two belly dancers perform with each other in the streets while passersby look on and watch the display. Hypothesis: Joseph thinks that two belly dancers perform with each other in the streets while passersby look on and watch the display.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia knows that a woman wearing a straw hat is sitting among a variety of different foods while holding a drink. Hypothesis: Olivia knows that a woman is sitting near food.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn understands that James thinks that a male guitar player is vigorously singing a not to a song in a poorly lit room. Hypothesis: James thinks that a male guitar player is vigorously singing a not to a song in a poorly lit room.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William remembers that a young woman with a black hat and red and black jacket, swings on a red-orange ball attached to a blue rope. Hypothesis: William remembers that a young woman is playing on a red-orange ball attached to a blue rope.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail suspects that Amelia sees that a man is steering his ship out at sea. Hypothesis: Amelia sees that a man is steering his ship out at sea.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor sees that John suspects that a group of three people and one dog hike up a green mountainside. Hypothesis: John suspects that Taylor sees that a group of three people and one dog hike up a green mountainside.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma assumes that Isabella believes that a man on a bicycle, wearing cycle gear, riding at a fast past down paved trail surrounded by tree's and grass. Hypothesis: Isabella believes that a man on a bicycle, wearing cycle gear, riding at a fast past down paved trail surrounded by tree's and grass.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph sees that Ava assumes that there is a large group of people standing together mostly wearing Canada symbols. Hypothesis: Ava assumes that there is a large group of people standing together mostly wearing Canada symbols.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John thinks that Abigail assumes that a group of girls in black and white spotted skirts cross a street. Hypothesis: John thinks that a group of girls in black and white spotted skirts cross a street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles recognizes that the dog is in snow, and has a stick in its mouth. Hypothesis: Charles recognizes that there is an animal outdoors.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia assumes that Thomas learns that a rocker standing with one foot on the stage holding the microphone attached to the stand over his head. Hypothesis: Amelia assumes that a rocker standing with one foot on the stage holding the microphone attached to the stand over his head.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert thinks that Richard knows that many people have decided to take a rest on the steps. Hypothesis: Richard knows that many people have decided to take a rest on the steps.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David suspects that Thomas suspects that a mom and her boy are riding in a bumper car. Hypothesis: David suspects that a mom and her boy are riding in a bumper car.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James thinks that Evelyn believes that four kids pose on a stage. Hypothesis: James thinks that four kids pose on a stage.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia believes that Joseph thinks that a woman with a cart of eggs walks in a market. Hypothesis: Olivia believes that a woman with a cart of eggs walks in a market.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia thinks that Robert sees that a cyclist dressed in black and white is pointing. Hypothesis: Amelia thinks that a cyclist dressed in black and white is pointing.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas suspects that Isabella remembers that the blond girl is opening her drink as she speaks to the person with her. Hypothesis: Isabella remembers that the blond girl is opening her drink as she speaks to the person with her.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn suspects that James sees that a man wearing a black hat and coat makes a face with a crowd behind him. Hypothesis: Evelyn suspects that a man wearing a black hat and coat makes a face with a crowd behind him.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard thinks that David assumes that a young man wearing dark sunglasses smiling. Hypothesis: Richard thinks that a young man wearing dark sunglasses smiling.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph assumes that Olivia assumes that five women wearing red shirts are leaning against a red car. Hypothesis: Joseph assumes that five women wearing red shirts are leaning against a red car.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that William suspects that a small child is riding in a red wagon. Hypothesis: Abigail assumes that a small child is riding in a red wagon.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma thinks that Taylor understands that three men in yellow green safety vests sit on a bench yawning, smoking and having a break. Hypothesis: Emma thinks that three men in yellow green safety vests sit on a bench yawning, smoking and having a break.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph learns that Olivia assumes that a sungalsses vendor gazes into the distance. Hypothesis: Olivia assumes that Joseph learns that a sungalsses vendor gazes into the distance.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David learns that Sophia assumes that several members of a community are celebrating with music and costumes during a festival or party. Hypothesis: Sophia assumes that several members of a community are celebrating with music and costumes during a festival or party.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas believes that Michael learns that a group of soldiers march in a parade. Hypothesis: Thomas believes that a group of soldiers march in a parade.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella assumes that Olivia believes that a woman is using a small scissors on a large net. Hypothesis: Olivia believes that a woman is using a small scissors on a large net.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella assumes that Ava remembers that a small quaint town all lit up during the holiday season. Hypothesis: Isabella assumes that a small quaint town all lit up during the holiday season.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James sees that a man is standing inside a building under construction filled with bricks and various tools. Hypothesis: James sees that a man stands in a construction site.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David believes that Thomas remembers that a rugby player running the ball between two downed opponents. Hypothesis: Thomas remembers that a rugby player running the ball between two downed opponents.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte assumes that Olivia understands that a young boy is playing in the sandy water. Hypothesis: Charlotte assumes that a young boy is playing in the sandy water.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail thinks that Robert assumes that an expensive car is parked in what looks like a car-wash with a man standing at the open passenger door side. Hypothesis: Abigail thinks that an expensive car is parked in what looks like a car-wash with a man standing at the open passenger door side.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John thinks that Charlotte believes that a man is holding on to a piece of rope, sitting in an inflatable boat, in front of several other larger boats. Hypothesis: John thinks that a man is holding on to a piece of rope, sitting in an inflatable boat, in front of several other larger boats.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael suspects that Charlotte believes that a woman in a fur lined plaid purple jacket stands by a table full of eating children. Hypothesis: Charlotte believes that a woman in a fur lined plaid purple jacket stands by a table full of eating children.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor believes that Joseph knows that a group of people in jackets and hats are kneeling outside posing for a picture, each one with their dog by them on a leash. Hypothesis: Joseph knows that a group of people in jackets and hats are kneeling outside posing for a picture, each one with their dog by them on a leash.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard sees that a little baby wearing a blue outfit is grabbing some fruit. Hypothesis: Joseph sees that a little baby is wearing blue.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte suspects that Robert recognizes that a blond woman wearing a pearl bracelet is about to kiss a man wearing a white shirt. Hypothesis: Robert recognizes that a blond woman wearing a pearl bracelet is about to kiss a man wearing a white shirt.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava remembers that Robert suspects that a man in a green shirt and dark pants and carrying a really big pot turns around to talk to 3 other people. Hypothesis: Robert suspects that a man in a green shirt and dark pants and carrying a really big pot turns around to talk to 3 other people.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael assumes that Charles remembers that a young man dressed up with a yellow tie jumps against a wall and one foot is left against the wall to push away. Hypothesis: Michael assumes that a young man dressed up with a yellow tie jumps against a wall and one foot is left against the wall to push away.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail suspects that an Asian man makes faces for the camera. Hypothesis: Emma suspects that faces are being made to the camera.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David suspects that Evelyn suspects that a young woman is wearing a paper crown at an outdoor event. Hypothesis: David suspects that a young woman is wearing a paper crown at an outdoor event.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert suspects that a man wearing dark jeans, an orange shirt, and an orange apron is next to a bunch of plants and flowers and a woman with a blue top. Hypothesis: Robert suspects that two people are next to each other.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma thinks that James understands that a group of people, mostly in straw hats, follow a man onto a beach covered with many large rocks. Hypothesis: James understands that a group of people, mostly in straw hats, follow a man onto a beach covered with many large rocks.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte assumes that an Asian man is praying at a Buddhist temple. Hypothesis: Charlotte assumes that a man is practicing his religion.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William learns that Amelia suspects that a dark-haired man in a black uniform is speaking to a man wearing a black jacket and black helmet on a motorbike. Hypothesis: Amelia suspects that a dark-haired man in a black uniform is speaking to a man wearing a black jacket and black helmet on a motorbike.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard suspects that a black dog is swimming with a ball in his mouth. Hypothesis: Isabella suspects that a black dog found a ball in the water and is bring it back to its owner.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn suspects that Joseph understands that at a table with an art camp pamphlet on it, a young woman and an older man are painting ceramics under the supervision of a blond woman wearing a name tag. Hypothesis: Joseph understands that at a table with an art camp pamphlet on it, a young woman and an older man are painting ceramics under the supervision of a blond woman wearing a name tag.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William understands that Amelia assumes that two little boys are standing in a kitchen. Hypothesis: Amelia assumes that William understands that two little boys are standing in a kitchen.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte believes that Thomas sees that in front is a guy singing and playing guitar and a white shirted drummer in the back. Hypothesis: Thomas sees that in front is a guy singing and playing guitar and a white shirted drummer in the back.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael believes that Abigail sees that a couple of females are talking to each other while one is flicking her cigarette. Hypothesis: Abigail sees that a couple of females are talking to each other while one is flicking her cigarette.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn thinks that William recognizes that the older woman smiles as she holds up a hammer. Hypothesis: Evelyn thinks that the older woman smiles as she holds up a hammer.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas remembers that Richard assumes that a couple is sitting down smiling, with the woman linking arms with the man. Hypothesis: Richard assumes that Thomas remembers that a couple is sitting down smiling, with the woman linking arms with the man.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John learns that Charlotte assumes that players from two opposing teams wearing colorful cleats struggle to gain control over a ball on an AstroTurf field. Hypothesis: Charlotte assumes that John learns that players from two opposing teams wearing colorful cleats struggle to gain control over a ball on an AstroTurf field.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard sees that Charles assumes that a small child with a backpack walks down a narrow road next to a painted wall. Hypothesis: Charles assumes that a small child with a backpack walks down a narrow road next to a painted wall.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert thinks that James learns that a group of young adults wait in line outdoors in the daytime. Hypothesis: James learns that a group of young adults wait in line outdoors in the daytime.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail understands that a young redheaded girl, wearing a yellow shirt, black pants, and sneakers, jumping in a grassy field with blue skies and wispy clouds in the background. Hypothesis: Abigail understands that a girl jumps in a grassy field.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail suspects that Charles sees that a solo shot of a man riding a four wheeler in an atv event. Hypothesis: Charles sees that a solo shot of a man riding a four wheeler in an atv event.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte sees that a blond woman in a white shirt demonstrates her talents to a crowd. Hypothesis: Charlotte sees that a woman performs for the crowd.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael suspects that Charles learns that eight tourists stand at a railing looking at an attraction. Hypothesis: Michael suspects that eight tourists stand at a railing looking at an attraction.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David understands that Abigail suspects that a young woman with brown hair and an elderly man with gray hair and a sweater jump in the air on a snowy hill with snowshoes on their feet. Hypothesis: Abigail suspects that David understands that a young woman with brown hair and an elderly man with gray hair and a sweater jump in the air on a snowy hill with snowshoes on their feet.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael believes that David believes that a boy and a woman are on top of large rocks at sunset. Hypothesis: Michael believes that a boy and a woman are on top of large rocks at sunset.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph understands that a man and a woman stand in front of a Christmas tree contemplating a single thought. Hypothesis: Joseph understands that two people stand lost in thought in front of a tree.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella learns that Evelyn thinks that a blond woman in a blue shirt looks on at an event. Hypothesis: Evelyn thinks that a blond woman in a blue shirt looks on at an event.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard suspects that Taylor suspects that a man holds a rope for a boy who's about to climb a wall. Hypothesis: Taylor suspects that a man holds a rope for a boy who's about to climb a wall.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia learns that Sophia suspects that three young women perform a dance in a crowded hall. Hypothesis: Sophia suspects that Olivia learns that three young women perform a dance in a crowded hall.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma recognizes that Thomas believes that a woman in a white shirt inspects a black garment while sitting in a chair at a festival. Hypothesis: Thomas believes that a woman in a white shirt inspects a black garment while sitting in a chair at a festival.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael thinks that Taylor remembers that a group of people are gathered on a sidewalk in front of a store nearby a littered street. Hypothesis: Taylor remembers that a group of people are gathered on a sidewalk in front of a store nearby a littered street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn believes that Michael understands that a child stuck up in a tree. Hypothesis: Michael understands that a child stuck up in a tree.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert thinks that Richard knows that many people have decided to take a rest on the steps. Hypothesis: Richard knows that many people have decided to take a rest on the steps.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia remembers that David assumes that men wearing hats walk on the street. Hypothesis: David assumes that Olivia remembers that men wearing hats walk on the street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte believes that Sophia assumes that two people wearing green raincoats sit in blue bleachers that are otherwise empty. Hypothesis: Charlotte believes that two people wearing green raincoats sit in blue bleachers that are otherwise empty.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that William believes that two women and a little girl are resting with food and drink near a log in a grassy field under flowering trees. Hypothesis: Robert believes that two women and a little girl are resting with food and drink near a log in a grassy field under flowering trees.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn believes that a woman wearing purple and carrying a bag is walking out of a door. Hypothesis: Isabella believes that a woman was indoors before walking outside.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte remembers that a woman is cleaning up by putting dishes in the dishwasher after making supper. Hypothesis: Charlotte remembers that a woman is inside.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles believes that Abigail assumes that a group of mountain climbers rests at the summit. Hypothesis: Abigail assumes that a group of mountain climbers rests at the summit.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor thinks that Sophia assumes that a woman wearing a tank top and black pants is laying on the ground while looking at a book. Hypothesis: Sophia assumes that a woman wearing a tank top and black pants is laying on the ground while looking at a book.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia assumes that Taylor learns that people in bathing suits bend down and reach into the water of a lake. Hypothesis: Olivia assumes that people in bathing suits bend down and reach into the water of a lake.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte remembers that Evelyn thinks that two men are standing in a freshly razed field at the boundary of a forest, while a bulldozer sits idling nearby. Hypothesis: Evelyn thinks that two men are standing in a freshly razed field at the boundary of a forest, while a bulldozer sits idling nearby.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor understands that a cyclist in a red and white uniform is biking across a garage full of people. Hypothesis: Richard understands that there is a man riding a bicycle.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph assumes that Olivia assumes that five women wearing red shirts are leaning against a red car. Hypothesis: Joseph assumes that five women wearing red shirts are leaning against a red car.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David thinks that a baby girl and little boy are standing next to a guitar and a drum. Hypothesis: Charlotte thinks that the girl is near an instrument.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John suspects that Ava knows that a woman in blue pants and a light-blue top looks down at her hand while standing near a dirty gray truck and surrounded by muddy ground. Hypothesis: Ava knows that a woman in blue pants and a light-blue top looks down at her hand while standing near a dirty gray truck and surrounded by muddy ground.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava learns that a woman wearing a red coat stands on a wood floor in front of several paintings while two girls sit on the floor at her feet. Hypothesis: Ava learns that woman views paintings with two girls at her feet.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte recognizes that James suspects that a man wearing shorts looks at his cellphone while a woman walks outside a small building. Hypothesis: James suspects that Charlotte recognizes that a man wearing shorts looks at his cellphone while a woman walks outside a small building.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava thinks that James knows that the blue kayak is being ridden over a small waterfall. Hypothesis: Ava thinks that the blue kayak is being ridden over a small waterfall.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia thinks that Joseph assumes that a man sits at a table in a room. Hypothesis: Olivia thinks that a man sits at a table in a room.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte remembers that James believes that a schoolgirl is jumping over a low hurdle. Hypothesis: James believes that a schoolgirl is jumping over a low hurdle.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David believes that Thomas remembers that a rugby player running the ball between two downed opponents. Hypothesis: Thomas remembers that a rugby player running the ball between two downed opponents.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James suspects that Michael assumes that the basketball is in the hands of the guy with the red shirts the others are trying to steal the ball to score for their team. Hypothesis: James suspects that the basketball is in the hands of the guy with the red shirts the others are trying to steal the ball to score for their team.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma recognizes that John suspects that a baby is eating aqua-colored cake very messily. Hypothesis: John suspects that Emma recognizes that a baby is eating aqua-colored cake very messily.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella assumes that a young blond boy is eating cake with a spoon. Hypothesis: Isabella assumes that a little boy is eating cake.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William thinks that Ava assumes that the brown, furry animal is walking in the snowy grass with a tree behind him. Hypothesis: William thinks that the brown, furry animal is walking in the snowy grass with a tree behind him.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael remembers that a man on stage in the act of jumping, with a little boy in the background really enjoying it. Hypothesis: Olivia remembers that a boy happily watches a man jumping on a stage.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn assumes that Michael sees that a Lady in a Green and Black Jacket, and Blue pants, taking a Photos of a Horse. Hypothesis: Evelyn assumes that a Lady in a Green and Black Jacket, and Blue pants, taking a Photos of a Horse.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail assumes that Charlotte assumes that a girl in a red and white uniform is swinging a bat. Hypothesis: Charlotte assumes that a girl in a red and white uniform is swinging a bat.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John thinks that Charles believes that a young woman is standing on a slope, facing the top of the slope. Hypothesis: John thinks that a young woman is standing on a slope, facing the top of the slope.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David assumes that Taylor thinks that two women wearing aprons and hairnets look at each other while they reach into metal canisters. Hypothesis: David assumes that two women wearing aprons and hairnets look at each other while they reach into metal canisters.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor assumes that Charlotte believes that a girl is blowing a huge bubble. Hypothesis: Taylor assumes that a girl is blowing a huge bubble.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert assumes that Charles remembers that a policeman is sitting in a van looking out the window. Hypothesis: Charles remembers that a policeman is sitting in a van looking out the window.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard sees that Joseph thinks that two dogs are playing catch in a field. Hypothesis: Joseph thinks that two dogs are playing catch in a field.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles understands that a girl dressed in a Halloween costume is carrying bag of candy and a scythe with a jack-o-lantern on someones porch in the background. Hypothesis: Charles understands that a girl has some candy.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert believes that William believes that two women and a little girl are resting with food and drink near a log in a grassy field under flowering trees. Hypothesis: Robert believes that two women and a little girl are resting with food and drink near a log in a grassy field under flowering trees.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James suspects that Thomas recognizes that two people are walking through a path with branches from neighboring trees overhead. Hypothesis: Thomas recognizes that two people are walking through a path with branches from neighboring trees overhead.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that Taylor learns that two men are laying floor tiles in a doorway. Hypothesis: Abigail assumes that two men are laying floor tiles in a doorway.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard assumes that Charles believes that a man in a green shirt hovers above the ground in the laundry room. Hypothesis: Richard assumes that a man in a green shirt hovers above the ground in the laundry room.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma knows that John assumes that a woman runs on the beach. Hypothesis: John assumes that a woman runs on the beach.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard learns that Evelyn believes that a man and a woman are lying together on a grassy park field near a waterfront. Hypothesis: Evelyn believes that a man and a woman are lying together on a grassy park field near a waterfront.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James thinks that Amelia knows that a group stands and watches two men, apparently dressed in some sort of costume, wrestle on the ground. Hypothesis: James thinks that a group stands and watches two men, apparently dressed in some sort of costume, wrestle on the ground.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia believes that Isabella learns that a man in a white t-shirt is holding a pair of sunglasses. Hypothesis: Isabella learns that a man in a white t-shirt is holding a pair of sunglasses.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella thinks that Emma learns that two young boys wearing shorts and sandals throw pebbles from a dirt path into a body of water. Hypothesis: Emma learns that two young boys wearing shorts and sandals throw pebbles from a dirt path into a body of water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert suspects that Taylor learns that a man wearing a gray shirt and pink wristband plays the drums. Hypothesis: Taylor learns that a man wearing a gray shirt and pink wristband plays the drums.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles believes that Isabella recognizes that there is a man poking a long stick up towards the ceiling. Hypothesis: Isabella recognizes that there is a man poking a long stick up towards the ceiling.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava thinks that Abigail learns that a group of people sitting around tables with computer monitors on them paying attention to something on the left. Hypothesis: Abigail learns that a group of people sitting around tables with computer monitors on them paying attention to something on the left.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that David suspects that people in front of waterfront, 3 people are sitting down facing each other as a young boy runs and 2 people walk towards the water. Hypothesis: Abigail assumes that people in front of waterfront, 3 people are sitting down facing each other as a young boy runs and 2 people walk towards the water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard knows that Charles assumes that a young girl wearing a flora shirt is sitting in tub in brown water with the remnants of a snake. Hypothesis: Charles assumes that a young girl wearing a flora shirt is sitting in tub in brown water with the remnants of a snake.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia believes that John suspects that sexy young men stand on a balcony having a heated conversation. Hypothesis: Olivia believes that sexy young men stand on a balcony having a heated conversation.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor thinks that two adult men in black t-shirt and loud tunics hold smoking torches in preparation for an act of entertainment or celebration in a forested environment. Hypothesis: Taylor thinks that two men hold torches to celebrate.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia assumes that Michael suspects that two men on opposing teams are playing soccer in a field. Hypothesis: Sophia assumes that two men on opposing teams are playing soccer in a field.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that a woman in a bright pink jacket and jeans, with two young children, also in jackets, is on the deck of a yacht using a telescope to look out to sea. Hypothesis: Abigail assumes that a woman has a bright pink jacket.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph believes that Amelia assumes that an older man is riding a bike with a blue laundry hamper full of clothes on his handlebars. Hypothesis: Amelia assumes that an older man is riding a bike with a blue laundry hamper full of clothes on his handlebars.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David remembers that Richard assumes that a man and a woman are dancing in the crowd. Hypothesis: Richard assumes that a man and a woman are dancing in the crowd.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail believes that Amelia recognizes that a group of Asian men are sitting or standing around a small square table. Hypothesis: Amelia recognizes that a group of Asian men are sitting or standing around a small square table.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John remembers that two men are shirtless on the beach on a beautiful day. Hypothesis: John remembers that there are men on the beach.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David assumes that Evelyn recognizes that two male soccer players on opposing teams are trying to get the soccer ball. Hypothesis: David assumes that two male soccer players on opposing teams are trying to get the soccer ball.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph learns that Ava suspects that a brunette woman holding a little girl dressed in pink is kneeling next to a grazing white and brown llama in the foreground of a hilly community. Hypothesis: Ava suspects that a brunette woman holding a little girl dressed in pink is kneeling next to a grazing white and brown llama in the foreground of a hilly community.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella understands that Olivia thinks that the gentlemen with the red plaid shirt and black pants is speaking to a young lady holding a blue folder. Hypothesis: Olivia thinks that Isabella understands that the gentlemen with the red plaid shirt and black pants is speaking to a young lady holding a blue folder.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James suspects that Michael assumes that the basketball is in the hands of the guy with the red shirts the others are trying to steal the ball to score for their team. Hypothesis: James suspects that the basketball is in the hands of the guy with the red shirts the others are trying to steal the ball to score for their team.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn recognizes that a man is watching as a woman is reading a piece of paper. Hypothesis: Evelyn recognizes that a person watches someone.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia learns that Sophia suspects that three young women perform a dance in a crowded hall. Hypothesis: Sophia suspects that Olivia learns that three young women perform a dance in a crowded hall.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles understands that Olivia believes that a woman with short blond-hair rises from a chair as another woman in a burgundy shirt laughs. Hypothesis: Olivia believes that a woman with short blond-hair rises from a chair as another woman in a burgundy shirt laughs.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James assumes that Ava believes that a man in a red raincoat is looking to the opposite site of the camera. Hypothesis: Ava believes that a man in a red raincoat is looking to the opposite site of the camera.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas knows that David suspects that a boy in a green shirt is sitting in an almost empty stadium. Hypothesis: David suspects that Thomas knows that a boy in a green shirt is sitting in an almost empty stadium.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James suspects that Taylor learns that the German shepherd runs happily in the park. Hypothesis: Taylor learns that the German shepherd runs happily in the park.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William thinks that Michael knows that a woman in an apron is looking for bread. Hypothesis: William thinks that a woman in an apron is looking for bread.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John suspects that Robert assumes that a man holding a pink cooler is talking to an older woman. Hypothesis: Robert assumes that a man holding a pink cooler is talking to an older woman.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas thinks that two girls are playing in the snow and throwing snowballs. Hypothesis: Thomas thinks that two girls are somewhere cold.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert knows that Abigail suspects that four men and a young boy are at a table set up for wood crafts. Hypothesis: Abigail suspects that Robert knows that four men and a young boy are at a table set up for wood crafts.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella believes that a small girl in a green shirt plays on a swing. Hypothesis: Isabella believes that girl plays swing.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte assumes that a man in a suit stands on a walkway with is suitcase with a large display in front of him announcing airline flights. Hypothesis: Thomas assumes that a man is at an airport.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David thinks that Michael recognizes that three men are playing frisbee in the woods. Hypothesis: David thinks that three men are playing frisbee in the woods.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte believes that Amelia believes that a man is holding a microphone in front of his mouth. Hypothesis: Charlotte believes that a man is holding a microphone in front of his mouth.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that Ava suspects that two black labs run, one carrying an orange dog toy. Hypothesis: Ava suspects that two black labs run, one carrying an orange dog toy.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail remembers that a woman with a stroller is passing a man walking a dog. Hypothesis: Charles remembers that there are people outside.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma thinks that Olivia suspects that a brown and black dog rubs his face in the grass. Hypothesis: Olivia suspects that a brown and black dog rubs his face in the grass.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia recognizes that James believes that a man with no shirt on is holding a football. Hypothesis: James believes that Sophia recognizes that a man with no shirt on is holding a football.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard suspects that Ava believes that three men are doing a musical set with wires and equipment all over the stage, and they are holding unique guitar like instruments. Hypothesis: Richard suspects that three men are doing a musical set with wires and equipment all over the stage, and they are holding unique guitar like instruments.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia suspects that Sophia thinks that man in leather jacket and scarf sits on purple cushion at a party. Hypothesis: Sophia thinks that man in leather jacket and scarf sits on purple cushion at a party.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard assumes that Robert learns that two dogs are running next to each other on a grassy hill. Hypothesis: Robert learns that two dogs are running next to each other on a grassy hill.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard thinks that Amelia assumes that a young boy sits on the shoulders of a woman, who is carrying a young girl. Hypothesis: Richard thinks that a young boy sits on the shoulders of a woman, who is carrying a young girl.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John sees that Joseph suspects that a woman with red-hair and a leather jacket holds a harp in front of a snowy forest. Hypothesis: Joseph suspects that a woman with red-hair and a leather jacket holds a harp in front of a snowy forest.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael thinks that Taylor learns that a boy toddler is holding a bat he is about to swing at a pinata. Hypothesis: Taylor learns that a boy toddler is holding a bat he is about to swing at a pinata.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia believes that Amelia recognizes that a woman wearing a purple with black polka-dot hoodie is resting on a bench in the sunlight. Hypothesis: Olivia believes that a woman wearing a purple with black polka-dot hoodie is resting on a bench in the sunlight.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph remembers that Olivia suspects that child is laughing and playing around. Hypothesis: Olivia suspects that Joseph remembers that child is laughing and playing around.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael assumes that Robert knows that a chef is cutting a piece of fish with a chefs knife. Hypothesis: Robert knows that a chef is cutting a piece of fish with a chefs knife.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James thinks that a smiling man is holding up a gavel. Hypothesis: James thinks that the man is holding an object.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert understands that Ava believes that a lady in a blue and white tube top takes her own picture with a disposable camera while another lady with a bag flashes a piece sign in the background. Hypothesis: Ava believes that Robert understands that a lady in a blue and white tube top takes her own picture with a disposable camera while another lady with a bag flashes a piece sign in the background.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia thinks that Robert assumes that a woman wearing an elaborate array of feathers in her hair, a bead necklace, a medallion, and an aqua, brown, and olive-green dress and looks off to her left, smiling slightly. Hypothesis: Robert assumes that a woman wearing an elaborate array of feathers in her hair, a bead necklace, a medallion, and an aqua, brown, and olive-green dress and looks off to her left, smiling slightly.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas remembers that Charlotte suspects that two men are boxing in fighting arena. Hypothesis: Charlotte suspects that Thomas remembers that two men are boxing in fighting arena.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava assumes that Evelyn knows that a bicyclist is attempting a trick on a wire in a tropical location. Hypothesis: Ava assumes that a bicyclist is attempting a trick on a wire in a tropical location.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David suspects that a woman is carrying two children in the middle of a large crowd. Hypothesis: David suspects that a woman carries children.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John believes that one many is fishing by a river with some buildings in the background while another man next to him is about to get a drink from the bottle next to him. Hypothesis: John believes that two men are by the river.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard believes that James knows that a man shows off his spider-web face paint. Hypothesis: Richard believes that a man shows off his spider-web face paint.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia assumes that Emma suspects that two girls pass two boys by a tree in a neon lit street. Hypothesis: Emma suspects that two girls pass two boys by a tree in a neon lit street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert assumes that Richard learns that a man on a sidewalk is playing the accordion while happy people pass by. Hypothesis: Robert assumes that a man on a sidewalk is playing the accordion while happy people pass by.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William learns that Charlotte thinks that a man is standing in front of a temple while wearing a red hat and red shirt. Hypothesis: Charlotte thinks that William learns that a man is standing in front of a temple while wearing a red hat and red shirt.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail suspects that Robert suspects that two men with black glasses are holding food, one appears to be eating. Hypothesis: Robert suspects that two men with black glasses are holding food, one appears to be eating.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael suspects that Charles learns that eight tourists stand at a railing looking at an attraction. Hypothesis: Michael suspects that eight tourists stand at a railing looking at an attraction.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph thinks that Evelyn remembers that a man in purple tie is singing. Hypothesis: Evelyn remembers that a man in purple tie is singing.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William thinks that Ava assumes that the brown, furry animal is walking in the snowy grass with a tree behind him. Hypothesis: William thinks that the brown, furry animal is walking in the snowy grass with a tree behind him.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia believes that Joseph suspects that a road crew is working on a road with equipment around them. Hypothesis: Olivia believes that a road crew is working on a road with equipment around them.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph thinks that Amelia remembers that a female bowler dressed in blue, with another bowler in the background, prepares to throw a ball down the lane. Hypothesis: Joseph thinks that a female bowler dressed in blue, with another bowler in the background, prepares to throw a ball down the lane.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph remembers that Evelyn suspects that a man is riding his dirt bike through the air in the desert. Hypothesis: Evelyn suspects that Joseph remembers that a man is riding his dirt bike through the air in the desert.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor thinks that Sophia assumes that a woman wearing a tank top and black pants is laying on the ground while looking at a book. Hypothesis: Sophia assumes that a woman wearing a tank top and black pants is laying on the ground while looking at a book.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia thinks that Charles recognizes that a child in an orange outfit stands holding flowers. Hypothesis: Charles recognizes that a child in an orange outfit stands holding flowers.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael understands that a group of people are walking by a van. Hypothesis: Ava understands that some people outdoors.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn recognizes that John assumes that a toddler, sitting next to another girl who is slightly older, is using a bubble machine to blow a large bubble into the air. Hypothesis: John assumes that a toddler, sitting next to another girl who is slightly older, is using a bubble machine to blow a large bubble into the air.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia assumes that Richard thinks that multiple men fill the scene, one in a white button up shirt using his cellphone, the others wearing pink, orange, and green shirts engaged in various activities in the background. Hypothesis: Sophia assumes that multiple men fill the scene, one in a white button up shirt using his cellphone, the others wearing pink, orange, and green shirts engaged in various activities in the background.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia sees that there is a Victorian style building in the background, and in the foreground is a lake where a tiny paddle boat sits with three people in it. Hypothesis: Amelia sees that three people sit in a paddle boat.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia assumes that Emma understands that a man wearing blue jeans and a peach shirt is arguing with a woman with long gray hair, a red skirt and tan shirt. Hypothesis: Sophia assumes that a man wearing blue jeans and a peach shirt is arguing with a woman with long gray hair, a red skirt and tan shirt.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael assumes that Ava thinks that a speaking woman at a podium has the phrase \"Armenian Genocide\" written on it, flanked by priests and men in suits. Hypothesis: Michael assumes that a speaking woman at a podium has the phrase \"Armenian Genocide\" written on it, flanked by priests and men in suits.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph thinks that Richard believes that military personnel are shopping. Hypothesis: Joseph thinks that military personnel are shopping.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that the man walks among the large trees. Hypothesis: Abigail assumes that the man walks among trees.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard assumes that a man falling off a bull as the animal jumps into the air. Hypothesis: Emma assumes that a boy struggles to hold on to a bull as it twirls and jumps.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert sees that a woman and two men, that are dressed professionally, are having a discussion. Hypothesis: Robert sees that a woman and two men are talking amongst themselves.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor sees that James suspects that a skateboarder is performing a grab trick while hovering above a ramp, which is located within a city. Hypothesis: James suspects that Taylor sees that a skateboarder is performing a grab trick while hovering above a ramp, which is located within a city.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James assumes that Richard thinks that a man grabs his crotch during a political demonstration. Hypothesis: James assumes that a man grabs his crotch during a political demonstration.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte understands that Amelia believes that a man dressed in black and white is standing on the side of the street eating an ice cream cone. Hypothesis: Amelia believes that Charlotte understands that a man dressed in black and white is standing on the side of the street eating an ice cream cone.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that there are many people in a large room with a lot of furniture with tags on them. Hypothesis: Charlotte believes that people are indoors.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella suspects that Amelia recognizes that an old Indian man dressed in rags sleeps on the ground using his backpack as a pillow. Hypothesis: Amelia recognizes that an old Indian man dressed in rags sleeps on the ground using his backpack as a pillow.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava believes that Abigail understands that two people play horseshoes. Hypothesis: Ava believes that two people play horseshoes.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia assumes that Sophia believes that a little boy is sitting on a giraffe bouncy while learning. Hypothesis: Sophia believes that a little boy is sitting on a giraffe bouncy while learning.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte suspects that a man with a tan jacket with a full grocery bag is crossing the street. Hypothesis: Emma suspects that the man is wearing a jacket.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John sees that Joseph suspects that a woman with red-hair and a leather jacket holds a harp in front of a snowy forest. Hypothesis: Joseph suspects that a woman with red-hair and a leather jacket holds a harp in front of a snowy forest.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard assumes that Abigail thinks that a group of people stares at a wall that is filled with drawings in a building. Hypothesis: Abigail thinks that a group of people stares at a wall that is filled with drawings in a building.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia believes that mother and daughter are meeting for the first time. Hypothesis: Olivia believes that the mother and daughter are meeting.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava believes that Abigail understands that two people play horseshoes. Hypothesis: Ava believes that two people play horseshoes.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia knows that Ava assumes that a referee with a whistle in his mouth points to the right and watches as a player with the basketball bends down with a defensive player. Hypothesis: Ava assumes that a referee with a whistle in his mouth points to the right and watches as a player with the basketball bends down with a defensive player.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David suspects that Abigail understands that a man takes a drink in the doorway of a home. Hypothesis: David suspects that a man takes a drink in the doorway of a home.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael recognizes that Amelia believes that there are two people walking in the sand. Hypothesis: Amelia believes that there are two people walking in the sand.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James sees that David assumes that an Asian woman is standing on a path with a basket on her head looking into a mirror she is holding in her hand. Hypothesis: David assumes that an Asian woman is standing on a path with a basket on her head looking into a mirror she is holding in her hand.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn believes that a man is on a skateboard jumping from a short ledge onto the sidewalk. Hypothesis: Ava believes that the man is outdoors.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard learns that Robert believes that a little girl standing in the middle of a street cleared for an oncoming parade. Hypothesis: Robert believes that Richard learns that a little girl standing in the middle of a street cleared for an oncoming parade.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail believes that Taylor understands that a man is sitting at a restaurant table outdoors. Hypothesis: Taylor understands that a man is sitting at a restaurant table outdoors.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava recognizes that Thomas thinks that a man wearing a jacket is listening to headphones while walking down the sidewalk along a street. Hypothesis: Thomas thinks that a man wearing a jacket is listening to headphones while walking down the sidewalk along a street.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph assumes that Amelia believes that an extreme mountain biker in mid-jump from underneath rider showing a blue sky. Hypothesis: Joseph assumes that an extreme mountain biker in mid-jump from underneath rider showing a blue sky.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael remembers that Thomas assumes that a man is posing on a ski board with snow in the background. Hypothesis: Thomas assumes that a man is posing on a ski board with snow in the background.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John remembers that David assumes that a child in a jeans jacket and shorts holding up a white dress as another darker-skinned child looks at it. Hypothesis: David assumes that a child in a jeans jacket and shorts holding up a white dress as another darker-skinned child looks at it.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William assumes that Abigail suspects that two scuba divers inspecting a large metal object in the water. Hypothesis: William assumes that two scuba divers inspecting a large metal object in the water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard thinks that an Asian young woman wearing a white shirt and black pants is holding a pink purse. Hypothesis: Ava thinks that the woman has a white shirt on.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail believes that Amelia recognizes that a group of Asian men are sitting or standing around a small square table. Hypothesis: Amelia recognizes that a group of Asian men are sitting or standing around a small square table.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael sees that Evelyn believes that a man walks along with a can of soda in his hand. Hypothesis: Evelyn believes that a man walks along with a can of soda in his hand.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia assumes that James assumes that a snowboarder dressed in yellow snow pants and a helmet catches some air on fresh powder. Hypothesis: James assumes that a snowboarder dressed in yellow snow pants and a helmet catches some air on fresh powder.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert suspects that Taylor suspects that two men spar in martial arts gear. Hypothesis: Robert suspects that two men spar in martial arts gear.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles recognizes that a tennis player in blue shorts and a white shirt making an aggressive backhand swing towards the tennis ball. Hypothesis: Charles recognizes that a person is holding a tennis racket.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James thinks that Amelia knows that a group stands and watches two men, apparently dressed in some sort of costume, wrestle on the ground. Hypothesis: James thinks that a group stands and watches two men, apparently dressed in some sort of costume, wrestle on the ground.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail thinks that Charlotte remembers that a man in a red shirt is walking towards a blue market stall. Hypothesis: Abigail thinks that a man in a red shirt is walking towards a blue market stall.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia knows that a group of Amish people, men and women, standing at a fence overlooking a forest and river. Hypothesis: David knows that several people are standing outside near water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella assumes that Charles understands that a black-haired man is entertaining a crowd with a hula hoop. Hypothesis: Charles understands that a black-haired man is entertaining a crowd with a hula hoop.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma believes that Thomas thinks that female beach volleyball players on either side of a net, with one looking to spike the ball as her teammate watches with the blue sky in the background. Hypothesis: Thomas thinks that female beach volleyball players on either side of a net, with one looking to spike the ball as her teammate watches with the blue sky in the background.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph suspects that Abigail learns that five rodeo contestants wait their turn. Hypothesis: Abigail learns that five rodeo contestants wait their turn.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William recognizes that Olivia believes that a lady is promoting something to the other two girls. Hypothesis: Olivia believes that William recognizes that a lady is promoting something to the other two girls.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles thinks that Richard believes that three dogs run through the grass. Hypothesis: Richard believes that three dogs run through the grass.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John suspects that Emma suspects that a teenager blows a whistle and wears white face paint, earmuffs, and a yellow hat while another teen watches. Hypothesis: John suspects that a teenager blows a whistle and wears white face paint, earmuffs, and a yellow hat while another teen watches.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph suspects that Olivia learns that two men talk outdoors. Hypothesis: Joseph suspects that two men talk outdoors.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia learns that James believes that a couple dressed in coats, hats, and scarves are standing in the snow. Hypothesis: James believes that Sophia learns that a couple dressed in coats, hats, and scarves are standing in the snow.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma assumes that Joseph believes that a man is wearing protective hair and face coverings. Hypothesis: Joseph believes that a man is wearing protective hair and face coverings.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte thinks that Sophia recognizes that a smiling man and a baby girl posing for photo. Hypothesis: Sophia recognizes that a smiling man and a baby girl posing for photo.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia thinks that four small children playing in the courtyard of a large building made out of clay or sand. Hypothesis: William thinks that four children are outdoors playing.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia understands that a woman with a black purse and a red coat is sitting on a pillar of concrete. Hypothesis: Joseph understands that there is one woman in this picture.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph suspects that Robert sees that this person is walking down the street and talking on their cellphone on a windy day. Hypothesis: Robert sees that this person is walking down the street and talking on their cellphone on a windy day.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William suspects that a man gets a skateboard up on a big rock. Hypothesis: William suspects that the guy is on a rock with a skateboard.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael thinks that John recognizes that a woman and a baby are watching a boy play. Hypothesis: John recognizes that a woman and a baby are watching a boy play.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles suspects that Thomas learns that a young woman is about to descend the stairs into a metro station. Hypothesis: Charles suspects that a young woman is about to descend the stairs into a metro station.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte believes that Amelia believes that a man is holding a microphone in front of his mouth. Hypothesis: Charlotte believes that a man is holding a microphone in front of his mouth.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia learns that Olivia thinks that a couple look into the camera as the foreground is filled with balloons. Hypothesis: Olivia thinks that a couple look into the camera as the foreground is filled with balloons.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael learns that Evelyn thinks that the blond young man who had been splattered with paint colors of blue, orange, and green held up his camera to take a picture. Hypothesis: Evelyn thinks that the blond young man who had been splattered with paint colors of blue, orange, and green held up his camera to take a picture.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma thinks that Joseph knows that a man wearing a stocking hat and has a beard is looking at the camera with two women sitting on the couch next to him. Hypothesis: Emma thinks that a man wearing a stocking hat and has a beard is looking at the camera with two women sitting on the couch next to him.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph knows that Abigail believes that two men are wrestling; one has the maple leaf of the Canadian flag on his uniform. Hypothesis: Abigail believes that Joseph knows that two men are wrestling; one has the maple leaf of the Canadian flag on his uniform.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma thinks that James thinks that a man leads the way in a race. Hypothesis: James thinks that a man leads the way in a race.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert knows that Abigail suspects that four men and a young boy are at a table set up for wood crafts. Hypothesis: Abigail suspects that Robert knows that four men and a young boy are at a table set up for wood crafts.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles believes that Joseph remembers that a woman and a young girl are sitting down and smiling. Hypothesis: Joseph remembers that a woman and a young girl are sitting down and smiling.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail thinks that James learns that little girl blows bubbles in a public square. Hypothesis: James learns that little girl blows bubbles in a public square.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn understands that James believes that a young boy sits outside in a grassy field with his back turned towards the viewer- he is holding a wooden toy that can be spun between your hands and launched into the air. Hypothesis: James believes that a young boy sits outside in a grassy field with his back turned towards the viewer- he is holding a wooden toy that can be spun between your hands and launched into the air.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard remembers that Olivia suspects that a boy dressed for summer in a green shirt and kahki shorts extends food to a reindeer in a petting zoo. Hypothesis: Olivia suspects that Richard remembers that a boy dressed for summer in a green shirt and kahki shorts extends food to a reindeer in a petting zoo.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that Richard knows that a gray rally car is being driven by two adult males while a large white container is tied down on top of the roof. Hypothesis: Richard knows that a gray rally car is being driven by two adult males while a large white container is tied down on top of the roof.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph believes that a person is squatting down near buckets, holding something in one hand. Hypothesis: Charlotte believes that there is more than one bucket.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David believes that Thomas remembers that a rugby player running the ball between two downed opponents. Hypothesis: Thomas remembers that a rugby player running the ball between two downed opponents.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William assumes that Emma sees that a dog with a ball in his mouth running down a road covered in leaves. Hypothesis: Emma sees that a dog with a ball in his mouth running down a road covered in leaves.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that a young blond child eats chocolate cake with his fingers while holding the spoon in their other hand. Hypothesis: Robert believes that a child has chocolate all over his hand.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John thinks that a man with white hair wearing a gray suit speaks into a microphone with a metal jug sitting in front of him. Hypothesis: Isabella thinks that a man is speaking.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James understands that a bundled up toddler is walking over snow. Hypothesis: James understands that a toddler is outside.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David suspects that man in robe making designs on dirt ground. Hypothesis: David suspects that a man making designs in the dirt outside.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas sees that There are five white individuals on a stage in a line, the outer four are looking inward toward the middle individual who has a beard. Hypothesis: Thomas sees that it is not the case that There are five white individuals on a stage in a line, the outer four are looking inward toward the middle individual who has a beard.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles thinks that A dune buggy traveling on sand. Hypothesis: Charles thinks that they remembers that A dune buggy traveling on sand.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava thinks that Black man singing with microphone Hypothesis: Ava believes that they think that Black man singing with microphone", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James assumes that 3 people sitting in a boat, rowing in a large body of water surrounded by greenery. Hypothesis: James understands that they assume that 3 people sitting in a boat, rowing in a large body of water surrounded by greenery.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail assumes that A man in a purple suit sings and plays the guitar. Hypothesis: Abigail believes that they assume that A man in a purple suit sings and plays the guitar.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles recognizes that A batsman is about to swing for a baseball whilst the catcher and referee wait behind him. Hypothesis: Charles recognizes that it is not the case that A batsman is about to swing for a baseball whilst the catcher and referee wait behind him.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella believes that Two people watch TV from over a white ledge.. Hypothesis: Isabella does not believes that it is not that case that Two people watch TV from over a white ledge.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail recognizes that the front side of a food vendor in a park. Hypothesis: Abigail understands that they recognize that the front side of a food vendor in a park.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that A couple being romantic under the sunset.. Hypothesis: Charles does not suspects that it is not that case that A couple being romantic under the sunset.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas suspects that Two people are walking up a mountain.. Hypothesis: Thomas does not suspects that it is not that case that Two people are walking up a mountain.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not suspect that a dog carries a large stick through the field. Hypothesis: John recognizes that they do not suspect that a dog carries a large stick through the field.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles thinks that A group of uniformed men carrying a cross adorned with a white ribbon in formation walking down the street on Easter. Hypothesis: Charles assumes that it is not the case that A group of uniformed men carrying a cross adorned with a white ribbon in formation walking down the street on Easter.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella believes that A man with a shopping cart is studying the shelves in a supermarket aisle. Hypothesis: Isabella believes that they understands that A man with a shopping cart is studying the shelves in a supermarket aisle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard believes that A dog owner is running along side his pet while the pet avoids obstacles on a course. Hypothesis: Richard recognizes that they believe that A dog owner is running along side his pet while the pet avoids obstacles on a course.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte does not believe that Several women with long hair and mini-dresses walk together. Hypothesis: Charlotte thinks that they do not believe that Several women with long hair and mini-dresses walk together.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph suspects that A butterfly costumed girl waves at the crowd.. Hypothesis: Joseph does not suspects that it is not that case that A butterfly costumed girl waves at the crowd.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph does not assume that Two men look down at another man standing on an unfinished walkway. Hypothesis: Joseph recognizes that they do not assume that Two men look down at another man standing on an unfinished walkway.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava suspects that A bald man in a white t-shirt is standing at a bar next to a white leashed dog. Hypothesis: Ava remembers that it is not the case that A bald man in a white t-shirt is standing at a bar next to a white leashed dog.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael understands that A man at the beach, building a sand castle. Hypothesis: Michael believes that they understand that A man at the beach, building a sand castle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte remembers that A group is gathered outside holding flowers. Hypothesis: Charlotte assumes that it is not the case that A group is gathered outside holding flowers.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor learns that A woman get some food from under a blue tent. Hypothesis: Taylor thinks that they learn that A woman get some food from under a blue tent.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard does not believe that A woman is riding a horse along a track. Hypothesis: Richard understands that they do not believe that A woman is riding a horse along a track.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia does not believe that Two dogs running in the dirt Hypothesis: Amelia believes that they do not believe that Two dogs running in the dirt", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava knows that A gymnast in a blue and pink leotard is standing on her right foot with her left foot in the air and waving a ribbon. Hypothesis: Ava recognizes that it is not the case that A gymnast in a blue and pink leotard is standing on her right foot with her left foot in the air and waving a ribbon.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia thinks that Many people standing around a silver car with the hood raised while a young girl in a yellow shirt and blue jeans drinks from a bottle. Hypothesis: Olivia assumes that it is not the case that Many people standing around a silver car with the hood raised while a young girl in a yellow shirt and blue jeans drinks from a bottle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael understands that A man at the beach, building a sand castle. Hypothesis: Michael believes that they understand that A man at the beach, building a sand castle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert assumes that A man in a blue robe walking a herd of camels in the desert. Hypothesis: Robert believes that it is not the case that A man in a blue robe walking a herd of camels in the desert.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella suspects that girl posing against a wall in the city. Hypothesis: Isabella does not suspects that it is not that case that girl posing against a wall in the city", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David learns that A man dressed in yellow rescue gear walks in a field. Hypothesis: David thinks that it is not the case that A man dressed in yellow rescue gear walks in a field.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia knows that The kids watched as the soda bottle launched into the air. Hypothesis: Amelia believes that they know that The kids watched as the soda bottle launched into the air.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael believes that A group of women wearing bikinis are playing beach volleyball. Hypothesis: Michael believes that they learns that A group of women wearing bikinis are playing beach volleyball.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph assumes that Two women in colorful swimming suits are leaping above a pool while two other women in the pool watch. Hypothesis: Joseph believes that they assume that Two women in colorful swimming suits are leaping above a pool while two other women in the pool watch.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James suspects that The pitcher wearing black heaves the ball toward the catcher. Hypothesis: James suspects that they learns that The pitcher wearing black heaves the ball toward the catcher.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David sees that A group of Asian children are gathered around in a circle listening to an older male in a white shirt. Hypothesis: David thinks that they see that A group of Asian children are gathered around in a circle listening to an older male in a white shirt.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph assumes that Three people loading or unloading their car.. Hypothesis: Joseph does not assumes that it is not that case that Three people loading or unloading their car.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard does not assume that A person wearing sunglasses, a visor, and a British flag is carrying 6 Heineken bottles. Hypothesis: Richard believes that they do not assume that A person wearing sunglasses, a visor, and a British flag is carrying 6 Heineken bottles.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard believes that A shirtless man is cooking on an outdoor grill. Hypothesis: Richard understands that they believe that A shirtless man is cooking on an outdoor grill.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not suspect that Racers are just beginning a race in an international competition. Hypothesis: Thomas believes that they do not suspect that Racers are just beginning a race in an international competition.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia thinks that Two men exchange conversation in a crowded place.. Hypothesis: Amelia does not thinks that it is not that case that Two men exchange conversation in a crowded place.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas suspects that Rugby player in blue dives to tackle the ball carrier in white. Hypothesis: Thomas suspects that they recognizes that Rugby player in blue dives to tackle the ball carrier in white.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava learns that Little girl and older male, holding hands and walking on train tracks. Hypothesis: Ava thinks that they learn that Little girl and older male, holding hands and walking on train tracks.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles thinks that A dune buggy traveling on sand. Hypothesis: Charles thinks that they remembers that A dune buggy traveling on sand.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William understands that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background. Hypothesis: William recognizes that it is not the case that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David believes that Excavation of the ruins of a ancient temple. Hypothesis: David believes that they learns that Excavation of the ruins of a ancient temple.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia thinks that Three middle-age women are on a stage, one singing and the other two cheerleading in blue uniforms.. Hypothesis: Olivia does not thinks that it is not that case that Three middle-age women are on a stage, one singing and the other two cheerleading in blue uniforms.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not suspect that A man and a woman are competing in a road rice. Hypothesis: Evelyn knows that they do not suspect that A man and a woman are competing in a road rice.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail believes that A woman wearing a scarf, hat, and coat, holding a shopping bag is looking at her phone while standing in front of a store. Hypothesis: Abigail sees that it is not the case that A woman wearing a scarf, hat, and coat, holding a shopping bag is looking at her phone while standing in front of a store.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia assumes that A man wearing headphones is standing in front of a poster.. Hypothesis: Amelia does not assumes that it is not that case that A man wearing headphones is standing in front of a poster.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John thinks that There are four US military soldiers in this photo, only two have their faces in the picture, there is a pack of cigarettes by one of their boots, they appear to be fixing a motorcycle. Hypothesis: John thinks that they learns that There are four US military soldiers in this photo, only two have their faces in the picture, there is a pack of cigarettes by one of their boots, they appear to be fixing a motorcycle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert knows that A black race car starts up in front of a crowd of people. Hypothesis: Robert suspects that it is not the case that A black race car starts up in front of a crowd of people.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard assumes that A dog carrying a stick in its mouth runs through a snow-covered field.. Hypothesis: Richard does not assumes that it is not that case that A dog carrying a stick in its mouth runs through a snow-covered field.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James suspects that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish. Hypothesis: James suspects that they remembers that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia thinks that Three middle-age women are on a stage, one singing and the other two cheerleading in blue uniforms.. Hypothesis: Olivia does not thinks that it is not that case that Three middle-age women are on a stage, one singing and the other two cheerleading in blue uniforms.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles thinks that A dune buggy traveling on sand. Hypothesis: Charles thinks that they remembers that A dune buggy traveling on sand.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava does not think that A group of people are standing on a platform and waiting for the subway train. Hypothesis: Ava believes that they do not think that A group of people are standing on a platform and waiting for the subway train.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert does not assume that A person is climbing a cliff wall, over a rocky shore, using a rope. Hypothesis: Robert believes that they do not assume that A person is climbing a cliff wall, over a rocky shore, using a rope.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David believes that Excavation of the ruins of a ancient temple. Hypothesis: David believes that they learns that Excavation of the ruins of a ancient temple.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David sees that A group of Asian children are gathered around in a circle listening to an older male in a white shirt. Hypothesis: David thinks that they see that A group of Asian children are gathered around in a circle listening to an older male in a white shirt.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert assumes that A person rides his bicycle in the sand beside the ocean.. Hypothesis: Robert does not assumes that it is not that case that A person rides his bicycle in the sand beside the ocean.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William learns that Riot police are standing in the background while a young man with a red scarf covering his face is walking. Hypothesis: William remembers that it is not the case that Riot police are standing in the background while a young man with a red scarf covering his face is walking.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia thinks that Two women in bathing suits walks across the sand.. Hypothesis: Sophia does not thinks that it is not that case that Two women in bathing suits walks across the sand.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia assumes that A man is performing an aerial skateboard trick on a ramp with several other people behind him. Hypothesis: Olivia assumes that they recognizes that A man is performing an aerial skateboard trick on a ramp with several other people behind him.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph assumes that Three people loading or unloading their car.. Hypothesis: Joseph does not assumes that it is not that case that Three people loading or unloading their car.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas sees that Man in gray zippered jacket and red shirt pets a brown dog and holds a young girl in pink shirt, while a woman next to him holds an infant boy and a gray dog. Hypothesis: Thomas believes that it is not the case that Man in gray zippered jacket and red shirt pets a brown dog and holds a young girl in pink shirt, while a woman next to him holds an infant boy and a gray dog.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William suspects that A man in glasses and a striped shirt walks down the street with one hand in his pocket. Hypothesis: William suspects that they sees that A man in glasses and a striped shirt walks down the street with one hand in his pocket.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia does not believe that A little girl plays with a faucet. Hypothesis: Sophia thinks that they do not believe that A little girl plays with a faucet.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia assumes that A man wearing headphones is standing in front of a poster.. Hypothesis: Amelia does not assumes that it is not that case that A man wearing headphones is standing in front of a poster.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles believes that Five young boys in swim trunks jump into a swimming pool at the same time. Hypothesis: Charles understands that they believe that Five young boys in swim trunks jump into a swimming pool at the same time.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor believes that A man in a white button-up shirt looks to the side while sitting at a table by the street. Hypothesis: Taylor believes that they sees that A man in a white button-up shirt looks to the side while sitting at a table by the street.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James does not suspect that A baby wearing yellow is pretending to be a doctor while inside a stroller. Hypothesis: James thinks that they do not suspect that A baby wearing yellow is pretending to be a doctor while inside a stroller.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia knows that A woman in a tomato-colored jogging suit carries both a red purse and a navy blue messenger bag. Hypothesis: Sophia knows that they know that A woman in a tomato-colored jogging suit carries both a red purse and a navy blue messenger bag.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia learns that A young boy in a Boy Scout shirt sits in a folding camp chair indoors, with other similar chairs around him, and a green tent behind him. Hypothesis: Olivia believes that they learn that A young boy in a Boy Scout shirt sits in a folding camp chair indoors, with other similar chairs around him, and a green tent behind him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor assumes that A boy cooking on a grill. Hypothesis: Taylor understands that they assume that A boy cooking on a grill.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John assumes that Two men making dance moves as a woman films the event in the living room of a house or apartment. Hypothesis: John assumes that they understands that Two men making dance moves as a woman films the event in the living room of a house or apartment.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia thinks that Two women in bathing suits walks across the sand.. Hypothesis: Sophia does not thinks that it is not that case that Two women in bathing suits walks across the sand.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that Groups of people walking different directions, mostly dressed in dark blues and dressed to stay warm. Hypothesis: Charles suspects that they sees that Groups of people walking different directions, mostly dressed in dark blues and dressed to stay warm.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert suspects that Two dogs are tied up outside a shop, with a bicycle leaning against the wall of the shop. Hypothesis: Robert remembers that it is not the case that Two dogs are tied up outside a shop, with a bicycle leaning against the wall of the shop.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail suspects that A young man in a white and pink striped shirt is riding in a horse and buggy down a paved road.. Hypothesis: Abigail does not suspects that it is not that case that A young man in a white and pink striped shirt is riding in a horse and buggy down a paved road.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James believes that Young girl sitting on bleachers.. Hypothesis: James does not believes that it is not that case that Young girl sitting on bleachers.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael thinks that A girl with brown hair and a brown shirt is building a gingerbread house.. Hypothesis: Michael does not thinks that it is not that case that A girl with brown hair and a brown shirt is building a gingerbread house.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia sees that A construction worker peeking out of a manhole while his coworker sits on the sidewalk smiling. Hypothesis: Amelia knows that it is not the case that A construction worker peeking out of a manhole while his coworker sits on the sidewalk smiling.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles suspects that Man plays electronic drum set in band. Hypothesis: Charles suspects that they understands that Man plays electronic drum set in band.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert does not think that With the sun rising, a person is gliding with a huge parachute attached to them. Hypothesis: Robert thinks that they do not think that With the sun rising, a person is gliding with a huge parachute attached to them.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that What appears to be a taller bald white man sitting next to a shorter black man in a reception area. Hypothesis: Evelyn thinks that they learns that What appears to be a taller bald white man sitting next to a shorter black man in a reception area.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail thinks that a shoeless toddler sleeps in his car seat holding his pacifier. Hypothesis: Abigail assumes that it is not the case that a shoeless toddler sleeps in his car seat holding his pacifier.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William believes that A brown dog opens his mouth to catch a piece of food. Hypothesis: William believes that it is not the case that A brown dog opens his mouth to catch a piece of food.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James suspects that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish. Hypothesis: James suspects that they remembers that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte does not think that Woman with headscarf and girl in red costume dress walk through urban area. Hypothesis: Charlotte believes that they do not think that Woman with headscarf and girl in red costume dress walk through urban area.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte believes that They are sitting on the edge of a fountain Hypothesis: Charlotte believes that they learns that They are sitting on the edge of a fountain", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor learns that A man is jumping over a rock. Hypothesis: Taylor thinks that they learn that A man is jumping over a rock.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David does not suspect that A man riding a dirt bike on a racetrack. Hypothesis: David believes that they do not suspect that A man riding a dirt bike on a racetrack.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael believes that A woman wearing a black shirt is standing next to an old rusted vehicle. Hypothesis: Michael believes that it is not the case that A woman wearing a black shirt is standing next to an old rusted vehicle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David sees that A group of Asian children are gathered around in a circle listening to an older male in a white shirt. Hypothesis: David thinks that they see that A group of Asian children are gathered around in a circle listening to an older male in a white shirt.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that A large crowd gathered in front of McDonald's.. Hypothesis: Charles does not suspects that it is not that case that A large crowd gathered in front of McDonald's.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert assumes that The woman in the blue skirt is sleeping on a cardboard box under a picture of Mary and baby Jesus. Hypothesis: Robert thinks that they assume that The woman in the blue skirt is sleeping on a cardboard box under a picture of Mary and baby Jesus.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael does not think that A young man with a blue hoodie sweatshirt that says New York across the front, sings into a microphone in front of a crowd of people. Hypothesis: Michael recognizes that they do not think that A young man with a blue hoodie sweatshirt that says New York across the front, sings into a microphone in front of a crowd of people.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia suspects that A woman dressed as Dorthy from the Wizard of Oz smiling at a baby, standing above her on a table, dressed as an elephant. Hypothesis: Amelia knows that they suspect that A woman dressed as Dorthy from the Wizard of Oz smiling at a baby, standing above her on a table, dressed as an elephant.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not think that A boy and a girl in jackets gaze in a clothing store window. Hypothesis: Thomas knows that they do not think that A boy and a girl in jackets gaze in a clothing store window.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail assumes that There is a woman throwing daggers at a target, which is a carrot.. Hypothesis: Abigail does not assumes that it is not that case that There is a woman throwing daggers at a target, which is a carrot.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma assumes that A woman in an red tracksuit squeezing lemons in a press.. Hypothesis: Emma does not assumes that it is not that case that A woman in an red tracksuit squeezing lemons in a press.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph sees that A black dog carrying a hanging flower pot. Hypothesis: Joseph thinks that they see that A black dog carrying a hanging flower pot.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava believes that Three girls fell on top of one another and are laughing histerically.. Hypothesis: Ava does not believes that it is not that case that Three girls fell on top of one another and are laughing histerically.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia thinks that A young woman seated at a table on what appears to be a backyard deck holds a toddler, giving him a toy or bottle of some sort, while smiling into the camera.. Hypothesis: Olivia does not thinks that it is not that case that A young woman seated at a table on what appears to be a backyard deck holds a toddler, giving him a toy or bottle of some sort, while smiling into the camera.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles believes that A little girl in a red flowered dress with a tennis racket.. Hypothesis: Charles does not believes that it is not that case that A little girl in a red flowered dress with a tennis racket.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that A couple being romantic under the sunset.. Hypothesis: Charles does not suspects that it is not that case that A couple being romantic under the sunset.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava remembers that A man standing in a stairwell with a green strip on the wall. Hypothesis: Ava knows that they remember that A man standing in a stairwell with a green strip on the wall.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not think that A group of people are standing on a platform and waiting for the subway train. Hypothesis: Ava believes that they do not think that A group of people are standing on a platform and waiting for the subway train.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia sees that A construction worker peeking out of a manhole while his coworker sits on the sidewalk smiling. Hypothesis: Amelia knows that it is not the case that A construction worker peeking out of a manhole while his coworker sits on the sidewalk smiling.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James suspects that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish. Hypothesis: James suspects that they remembers that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles suspects that Two boys in a field kicking a soccer ball.. Hypothesis: Charles does not suspects that it is not that case that Two boys in a field kicking a soccer ball.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not suspect that Racers are just beginning a race in an international competition. Hypothesis: Thomas believes that they do not suspect that Racers are just beginning a race in an international competition.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard believes that A dog owner is running along side his pet while the pet avoids obstacles on a course. Hypothesis: Richard recognizes that they believe that A dog owner is running along side his pet while the pet avoids obstacles on a course.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia does not believe that Two wrestlers jump in a ring while an official watches. Hypothesis: Olivia thinks that they do not believe that Two wrestlers jump in a ring while an official watches.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert recognizes that a man with a blue jacket look at items. Hypothesis: Robert recognizes that they recognize that a man with a blue jacket look at items.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James believes that Young girl sitting on bleachers.. Hypothesis: James does not believes that it is not that case that Young girl sitting on bleachers.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John believes that A young girl with a white vest, pink sleeves and pink knit hat with flower is looking at the flower blossoms on a tree. Hypothesis: John believes that they understands that A young girl with a white vest, pink sleeves and pink knit hat with flower is looking at the flower blossoms on a tree.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David suspects that These two poodles, one black and one brown, are playing. Hypothesis: David suspects that they understands that These two poodles, one black and one brown, are playing.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles suspects that Two men, one kneeling and one squatting, are posing in front of a clear wall with shops in the background.. Hypothesis: Charles does not suspects that it is not that case that Two men, one kneeling and one squatting, are posing in front of a clear wall with shops in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava believes that A boy riding on a carnival ride turns around for a photograph. Hypothesis: Ava believes that they knows that A boy riding on a carnival ride turns around for a photograph.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William believes that A dog with big ears holds a ball in his mouth.. Hypothesis: William does not believes that it is not that case that A dog with big ears holds a ball in his mouth.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard does not believe that A male soccer player has his foot extended as if he has just kicked the soccer ball while the ball flies through the air. Hypothesis: Richard understands that they do not believe that A male soccer player has his foot extended as if he has just kicked the soccer ball while the ball flies through the air.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph recognizes that A guy looking out over the scenic forest. Hypothesis: Joseph understands that they recognize that A guy looking out over the scenic forest.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that A blond man stands next to a cement mixer with mountains in the background.. Hypothesis: Evelyn does not thinks that it is not that case that A blond man stands next to a cement mixer with mountains in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not believe that Music can be created, through winded instruments, by winded instruments, and they are all enjoyed by different peoples, throughout the world. Hypothesis: Thomas recognizes that they do not believe that Music can be created, through winded instruments, by winded instruments, and they are all enjoyed by different peoples, throughout the world.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael assumes that Young boys playing indoor basketball, one team has black and white uniforms, the other has orange and white. Hypothesis: Michael assumes that they recognizes that Young boys playing indoor basketball, one team has black and white uniforms, the other has orange and white.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William remembers that A man in a black shirt is standing behind a blue SUV. Hypothesis: William knows that it is not the case that A man in a black shirt is standing behind a blue SUV.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma remembers that A group of people are walking down a sidewalk beside the beach. Hypothesis: Emma believes that they remember that A group of people are walking down a sidewalk beside the beach.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava learns that A jockey in blue gallops a chestnut horse on a dirt track past a wooden fence. Hypothesis: Ava learns that it is not the case that A jockey in blue gallops a chestnut horse on a dirt track past a wooden fence.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma assumes that Man observes a wavelength given off by an electronic device. Hypothesis: Emma assumes that they understands that Man observes a wavelength given off by an electronic device.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia assumes that A man wearing headphones is standing in front of a poster.. Hypothesis: Amelia does not assumes that it is not that case that A man wearing headphones is standing in front of a poster.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert knows that A black race car starts up in front of a crowd of people. Hypothesis: Robert suspects that it is not the case that A black race car starts up in front of a crowd of people.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Abigail suspects that A girl with a cigarette in hand and a guy with a green hat wave at the camera. Hypothesis: Abigail recognizes that they suspect that A girl with a cigarette in hand and a guy with a green hat wave at the camera.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James thinks that A person is surfing on a large wave.. Hypothesis: James does not thinks that it is not that case that A person is surfing on a large wave.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte sees that Young woman celebrates getting a strike during a bowling game. Hypothesis: Charlotte knows that they see that Young woman celebrates getting a strike during a bowling game.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia thinks that Two men are shopping for orange juice.. Hypothesis: Olivia does not thinks that it is not that case that Two men are shopping for orange juice.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James suspects that Three people, a woman and two men ride scooters amongst the pedestrians of a busy city street. Hypothesis: James knows that they suspect that Three people, a woman and two men ride scooters amongst the pedestrians of a busy city street.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn sees that Two men are playing basketball, and one man is making a shot. Hypothesis: Evelyn assumes that it is not the case that Two men are playing basketball, and one man is making a shot.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph believes that A man in a brightly colored vest performs on stage. Hypothesis: Joseph understands that it is not the case that A man in a brightly colored vest performs on stage.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava knows that A gymnast in a blue and pink leotard is standing on her right foot with her left foot in the air and waving a ribbon. Hypothesis: Ava recognizes that it is not the case that A gymnast in a blue and pink leotard is standing on her right foot with her left foot in the air and waving a ribbon.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael believes that A man is looking over a small cliff. Hypothesis: Michael knows that they believe that A man is looking over a small cliff.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava thinks that Black man singing with microphone Hypothesis: Ava believes that they think that Black man singing with microphone", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard believes that 2 people in blue and purple costumes are looking at each other with a hill in the background.. Hypothesis: Richard does not believes that it is not that case that 2 people in blue and purple costumes are looking at each other with a hill in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma believes that A lady reading a story book. Hypothesis: Emma thinks that they believe that A lady reading a story book.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William assumes that A man and a woman are jumping in midair and holding hands, a cloudy sky in the background. Hypothesis: William assumes that they knows that A man and a woman are jumping in midair and holding hands, a cloudy sky in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas suspects that Backside view of a South America street vendor tending to her upright oven with a second woman looking away. Hypothesis: Thomas thinks that it is not the case that Backside view of a South America street vendor tending to her upright oven with a second woman looking away.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David sees that A child is wearing white and blue face paint. Hypothesis: David knows that it is not the case that A child is wearing white and blue face paint.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava thinks that a bearded man takes a nap. Hypothesis: Ava thinks that they learns that a bearded man takes a nap.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor assumes that A woman with a crescent tattoo on her shoulder is painting an image of a face onto a wall. Hypothesis: Taylor assumes that they learns that A woman with a crescent tattoo on her shoulder is painting an image of a face onto a wall.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia does not believe that A little girl plays with a faucet. Hypothesis: Sophia thinks that they do not believe that A little girl plays with a faucet.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia thinks that Two ladies are sitting in the restaurant talking and laughing. Hypothesis: Olivia thinks that they knows that Two ladies are sitting in the restaurant talking and laughing.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James suspects that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish. Hypothesis: James suspects that they remembers that A woman in a blue shirt, white apron and yellow kerchief is placing an ingredient from a glass jar in to her dish.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert sees that An old man and a child walk together along a pathway near a building. Hypothesis: Robert thinks that they see that An old man and a child walk together along a pathway near a building.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael does not suspect that A man wearing a brown shirt and green pans is pulling a rickshaw down a street Hypothesis: Michael thinks that they do not suspect that A man wearing a brown shirt and green pans is pulling a rickshaw down a street", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John thinks that A woman with blond-hair is sitting at a table and talking to a man with glasses. Hypothesis: John understands that they think that A woman with blond-hair is sitting at a table and talking to a man with glasses.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not assume that A football player in a blue \"Rams\" jersey runs with a football on a field, as another player in a white jersey falls in an attempt to tackle him. Hypothesis: Taylor understands that they do not assume that A football player in a blue \"Rams\" jersey runs with a football on a field, as another player in a white jersey falls in an attempt to tackle him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael believes that Three women wearing belly dancing costumes are pictured in color while the background of the shot is in black and white. Hypothesis: Michael believes that they sees that Three women wearing belly dancing costumes are pictured in color while the background of the shot is in black and white.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James suspects that A couple sit on a park bench with purple balloons tied to it.. Hypothesis: James does not suspects that it is not that case that A couple sit on a park bench with purple balloons tied to it.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph assumes that Two people in leather jackets and jeans stand outside large, red, metal doors.. Hypothesis: Joseph does not assumes that it is not that case that Two people in leather jackets and jeans stand outside large, red, metal doors.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David believes that A woman in a kitchen holds a can surrounded by bowls.. Hypothesis: David does not believes that it is not that case that A woman in a kitchen holds a can surrounded by bowls.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor believes that A musician with short blond-hair and wearing a blue scarf and vest plays a string instrument while singing. Hypothesis: Taylor knows that they believe that A musician with short blond-hair and wearing a blue scarf and vest plays a string instrument while singing.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David sees that A group of Asian children are gathered around in a circle listening to an older male in a white shirt. Hypothesis: David thinks that they see that A group of Asian children are gathered around in a circle listening to an older male in a white shirt.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava does not suspect that Two hikers are climbing through a rocky and snowy passage in the mountains. Hypothesis: Ava understands that they do not suspect that Two hikers are climbing through a rocky and snowy passage in the mountains.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael assumes that A dalmatian runs through the woods. Hypothesis: Michael remembers that it is not the case that A dalmatian runs through the woods.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard recognizes that A girl wearing a red shirt and jeans is sitting in a rocking chair at a cluttered desk, while another girl wearing a black t-shirt and jogging pants is sitting on the floor writing on a piece of paper with other papers arranged around her. Hypothesis: Richard understands that they recognize that A girl wearing a red shirt and jeans is sitting in a rocking chair at a cluttered desk, while another girl wearing a black t-shirt and jogging pants is sitting on the floor writing on a piece of paper with other papers arranged around her.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not suspect that A man juggles flaming objects with a fence and a car in the background. Hypothesis: John knows that they do not suspect that A man juggles flaming objects with a fence and a car in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael recognizes that Black dog with tan markings wearing a blue collar standing on green grass. Hypothesis: Michael recognizes that they recognize that Black dog with tan markings wearing a blue collar standing on green grass.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not suspect that A hockey fight. Hypothesis: John recognizes that they do not suspect that A hockey fight.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William learns that A man and woman stand facing each other, the man holding an instrument and the woman holding a piece of paper. Hypothesis: William remembers that it is not the case that A man and woman stand facing each other, the man holding an instrument and the woman holding a piece of paper.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael assumes that A dalmatian runs through the woods. Hypothesis: Michael remembers that it is not the case that A dalmatian runs through the woods.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor does not think that A man in a shirt and tie does the splits on a wood floor Hypothesis: Taylor believes that they do not think that A man in a shirt and tie does the splits on a wood floor", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia learns that A young boy in a Boy Scout shirt sits in a folding camp chair indoors, with other similar chairs around him, and a green tent behind him. Hypothesis: Olivia believes that they learn that A young boy in a Boy Scout shirt sits in a folding camp chair indoors, with other similar chairs around him, and a green tent behind him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William assumes that A group of people are standing in front of parked bicycles on a corner with various carrying bags on the ground. Hypothesis: William assumes that they sees that A group of people are standing in front of parked bicycles on a corner with various carrying bags on the ground.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles recognizes that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes. Hypothesis: Charles believes that it is not the case that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella thinks that Female sitting in a chair in front of a hazy field.. Hypothesis: Isabella does not thinks that it is not that case that Female sitting in a chair in front of a hazy field.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William suspects that A man is holding a pile of newspapers in a lobby, and a woman next to him has taken one of the newspapers and is smiling.. Hypothesis: William does not suspects that it is not that case that A man is holding a pile of newspapers in a lobby, and a woman next to him has taken one of the newspapers and is smiling.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard recognizes that A child holds sparklers in the dark. Hypothesis: Richard believes that it is not the case that A child holds sparklers in the dark.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert does not assume that A person is climbing a cliff wall, over a rocky shore, using a rope. Hypothesis: Robert believes that they do not assume that A person is climbing a cliff wall, over a rocky shore, using a rope.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph suspects that A butterfly costumed girl waves at the crowd.. Hypothesis: Joseph does not suspects that it is not that case that A butterfly costumed girl waves at the crowd.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor learns that The little girl in the sand is handing a ball to one of the two black dogs. Hypothesis: Taylor recognizes that they learn that The little girl in the sand is handing a ball to one of the two black dogs.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia does not think that A young girl kisses a ring-bearing boy at a wedding. Hypothesis: Olivia thinks that they do not think that A young girl kisses a ring-bearing boy at a wedding.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor believes that A boy in an orange shirt sells fruit from a street cart. Hypothesis: Taylor remembers that it is not the case that A boy in an orange shirt sells fruit from a street cart.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava does not think that A group of people are standing on a platform and waiting for the subway train. Hypothesis: Ava believes that they do not think that A group of people are standing on a platform and waiting for the subway train.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John believes that A father helps his son ride a bike across dry, and dusty dirt accompanied by his sister adorned in a green dress. Hypothesis: John thinks that they believe that A father helps his son ride a bike across dry, and dusty dirt accompanied by his sister adorned in a green dress.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles understands that A group of people standing on rafts with a waterfall in the background. Hypothesis: Charles learns that it is not the case that A group of people standing on rafts with a waterfall in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John believes that A young girl with a white vest, pink sleeves and pink knit hat with flower is looking at the flower blossoms on a tree. Hypothesis: John believes that they understands that A young girl with a white vest, pink sleeves and pink knit hat with flower is looking at the flower blossoms on a tree.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William remembers that A man in a black shirt is standing behind a blue SUV. Hypothesis: William knows that it is not the case that A man in a black shirt is standing behind a blue SUV.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn thinks that Couple watching the moon on a bridge. Hypothesis: Evelyn recognizes that it is not the case that Couple watching the moon on a bridge.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charlotte believes that Several people are walking on a street and there is a large, blue crane towering and leaning against a building. Hypothesis: Charlotte sees that it is not the case that Several people are walking on a street and there is a large, blue crane towering and leaning against a building.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella suspects that girl posing against a wall in the city. Hypothesis: Isabella does not suspects that it is not that case that girl posing against a wall in the city", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia assumes that A cowboy clown wearing a shirt with Tax on it, red suspenders, and a white cowboy hat talks into a wireless microphone. Hypothesis: Amelia assumes that they recognizes that A cowboy clown wearing a shirt with Tax on it, red suspenders, and a white cowboy hat talks into a wireless microphone.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph thinks that People are waiting in line by a food vendor.. Hypothesis: Joseph does not thinks that it is not that case that People are waiting in line by a food vendor.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail knows that Gymnast does a flip on blue flooring. Hypothesis: Abigail remembers that it is not the case that Gymnast does a flip on blue flooring.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas learns that An older man is standing outside in front of a truck. Hypothesis: Thomas understands that they learn that An older man is standing outside in front of a truck.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David does not assume that A young boy wearing blue pajamas and yellow glasses leaping into the air. Hypothesis: David recognizes that they do not assume that A young boy wearing blue pajamas and yellow glasses leaping into the air.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William assumes that A man and a woman are jumping in midair and holding hands, a cloudy sky in the background. Hypothesis: William assumes that they knows that A man and a woman are jumping in midair and holding hands, a cloudy sky in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard recognizes that A child holds sparklers in the dark. Hypothesis: Richard believes that it is not the case that A child holds sparklers in the dark.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia does not suspect that A diver is swimming with a turtle. Hypothesis: Sophia believes that they do not suspect that A diver is swimming with a turtle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert sees that An old man and a child walk together along a pathway near a building. Hypothesis: Robert thinks that they see that An old man and a child walk together along a pathway near a building.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert sees that A man in jeans and a white shirt is standing near a rock formation with his back to the camera. Hypothesis: Robert believes that they see that A man in jeans and a white shirt is standing near a rock formation with his back to the camera.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David believes that A man with a checkered shirt on is giving a powerpoint presentation to people. Hypothesis: David believes that they recognizes that A man with a checkered shirt on is giving a powerpoint presentation to people.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas believes that A basketball player making a slam dunk during a game.. Hypothesis: Thomas does not believes that it is not that case that A basketball player making a slam dunk during a game.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not believe that A girl in a purple tutu dances in the yard. Hypothesis: Evelyn believes that they do not believe that A girl in a purple tutu dances in the yard.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William remembers that A man in a black shirt is standing behind a blue SUV. Hypothesis: William knows that it is not the case that A man in a black shirt is standing behind a blue SUV.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William understands that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background. Hypothesis: William recognizes that it is not the case that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas assumes that Two older males sitting together on a river boat tour. Hypothesis: Thomas understands that it is not the case that Two older males sitting together on a river boat tour.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph thinks that Six workers are working on the train tracks.. Hypothesis: Joseph does not thinks that it is not that case that Six workers are working on the train tracks.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor understands that Guy playing the guitar on a bench with another man watching him. Hypothesis: Taylor knows that they understand that Guy playing the guitar on a bench with another man watching him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David does not suspect that A man riding a dirt bike on a racetrack. Hypothesis: David believes that they do not suspect that A man riding a dirt bike on a racetrack.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph suspects that A young boy wearing a military sunhat catches a Frisbee outdoors. Hypothesis: Joseph thinks that it is not the case that A young boy wearing a military sunhat catches a Frisbee outdoors.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles recognizes that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes. Hypothesis: Charles believes that it is not the case that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph does not believe that Several men in fluorescent pinnies work on a structure shrouded in a green veil while a cherry picker truck hauls material. Hypothesis: Joseph thinks that they do not believe that Several men in fluorescent pinnies work on a structure shrouded in a green veil while a cherry picker truck hauls material.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not think that A boy and a girl in jackets gaze in a clothing store window. Hypothesis: Thomas knows that they do not think that A boy and a girl in jackets gaze in a clothing store window.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William understands that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background. Hypothesis: William recognizes that it is not the case that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David sees that A group of Asian children are gathered around in a circle listening to an older male in a white shirt. Hypothesis: David thinks that they see that A group of Asian children are gathered around in a circle listening to an older male in a white shirt.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William assumes that A group of people are standing in front of parked bicycles on a corner with various carrying bags on the ground. Hypothesis: William assumes that they sees that A group of people are standing in front of parked bicycles on a corner with various carrying bags on the ground.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Emma remembers that A group of people are walking down a sidewalk beside the beach. Hypothesis: Emma believes that they remember that A group of people are walking down a sidewalk beside the beach.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma does not suspect that A woman is eating what appears to be a mussel. Hypothesis: Emma recognizes that they do not suspect that A woman is eating what appears to be a mussel.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph thinks that Six workers are working on the train tracks.. Hypothesis: Joseph does not thinks that it is not that case that Six workers are working on the train tracks.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles believes that A man in a red shirt is being serviced by a working old woman in a store. Hypothesis: Charles believes that they remembers that A man in a red shirt is being serviced by a working old woman in a store.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael thinks that Two men and one woman are performing music on a stage. Hypothesis: Michael recognizes that they think that Two men and one woman are performing music on a stage.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not suspect that A small baby, possibly a newborn is being bathed by a person in blue scrubs wearing protective gloves. Hypothesis: John recognizes that they do not suspect that A small baby, possibly a newborn is being bathed by a person in blue scrubs wearing protective gloves.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael thinks that A girl with brown hair and a brown shirt is building a gingerbread house.. Hypothesis: Michael does not thinks that it is not that case that A girl with brown hair and a brown shirt is building a gingerbread house.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard remembers that A young boy is bowling for one pin with a ball outside, while 3 other people are in the background. Hypothesis: Richard assumes that it is not the case that A young boy is bowling for one pin with a ball outside, while 3 other people are in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor knows that A busy street full of shops and people holding hands and walking. Hypothesis: Taylor believes that it is not the case that A busy street full of shops and people holding hands and walking.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John recognizes that A colorfully dressed young man with visible skin lesions is sitting and smoking a cigarette. Hypothesis: John suspects that it is not the case that A colorfully dressed young man with visible skin lesions is sitting and smoking a cigarette.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William believes that A brown dog opens his mouth to catch a piece of food. Hypothesis: William believes that it is not the case that A brown dog opens his mouth to catch a piece of food.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael does not suspect that A man wearing a brown shirt and green pans is pulling a rickshaw down a street Hypothesis: Michael thinks that they do not suspect that A man wearing a brown shirt and green pans is pulling a rickshaw down a street", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella does not assume that A girl in uniform running through the water fountain gushing water from the tiles. Hypothesis: Isabella knows that they do not assume that A girl in uniform running through the water fountain gushing water from the tiles.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that A blond man stands next to a cement mixer with mountains in the background.. Hypothesis: Evelyn does not thinks that it is not that case that A blond man stands next to a cement mixer with mountains in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not think that A man in a shirt and tie does the splits on a wood floor Hypothesis: Taylor believes that they do not think that A man in a shirt and tie does the splits on a wood floor", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph assumes that A woman wearing a hat and a man covering his eyes sit on benches on a boat.. Hypothesis: Joseph does not assumes that it is not that case that A woman wearing a hat and a man covering his eyes sit on benches on a boat.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael believes that A man cutting a Woman's hair.. Hypothesis: Michael does not believes that it is not that case that A man cutting a Woman's hair.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not assume that Skiiers are walking through the snow near the mountains. Hypothesis: Evelyn understands that they do not assume that Skiiers are walking through the snow near the mountains.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph assumes that Two people in leather jackets and jeans stand outside large, red, metal doors.. Hypothesis: Joseph does not assumes that it is not that case that Two people in leather jackets and jeans stand outside large, red, metal doors.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte suspects that several people standing below a clock tower with two clock faces. Hypothesis: Charlotte suspects that they remembers that several people standing below a clock tower with two clock faces.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn thinks that A man is scrapping paint off a window.. Hypothesis: Evelyn does not thinks that it is not that case that A man is scrapping paint off a window.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia assumes that Military woman using a microscope.. Hypothesis: Olivia does not assumes that it is not that case that Military woman using a microscope.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not suspect that People running down a two lane road. Hypothesis: Evelyn thinks that they do not suspect that People running down a two lane road.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles recognizes that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes. Hypothesis: Charles believes that it is not the case that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella assumes that A woman wearing a large bandanna around her neck is sitting at a table putting poker chips into a plastic bag. Hypothesis: Isabella sees that it is not the case that A woman wearing a large bandanna around her neck is sitting at a table putting poker chips into a plastic bag.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles understands that A group of people standing on rafts with a waterfall in the background. Hypothesis: Charles learns that it is not the case that A group of people standing on rafts with a waterfall in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard thinks that Man in white shirt and blue jeans looking to the side while walking down a busy sidewalk.. Hypothesis: Richard does not thinks that it is not that case that Man in white shirt and blue jeans looking to the side while walking down a busy sidewalk.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William believes that A brown dog opens his mouth to catch a piece of food. Hypothesis: William believes that it is not the case that A brown dog opens his mouth to catch a piece of food.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas thinks that Two women standing outside looking at a water fountain with bright green trees in the background. Hypothesis: Thomas knows that it is not the case that Two women standing outside looking at a water fountain with bright green trees in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John thinks that A man and woman are sitting at a restaurant table holding hands.. Hypothesis: John does not thinks that it is not that case that A man and woman are sitting at a restaurant table holding hands.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James thinks that One military man executes a combat move on another outside a gated facility. Hypothesis: James thinks that they remembers that One military man executes a combat move on another outside a gated facility.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David suspects that These two poodles, one black and one brown, are playing. Hypothesis: David suspects that they understands that These two poodles, one black and one brown, are playing.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard thinks that Two oriental lizards are fighting for dominance in a small pond Hypothesis: Richard recognizes that it is not the case that Two oriental lizards are fighting for dominance in a small pond", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Ava learns that Little girl and older male, holding hands and walking on train tracks. Hypothesis: Ava thinks that they learn that Little girl and older male, holding hands and walking on train tracks.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not assume that A football player in a blue \"Rams\" jersey runs with a football on a field, as another player in a white jersey falls in an attempt to tackle him. Hypothesis: Taylor understands that they do not assume that A football player in a blue \"Rams\" jersey runs with a football on a field, as another player in a white jersey falls in an attempt to tackle him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava thinks that Black man singing with microphone Hypothesis: Ava believes that they think that Black man singing with microphone", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William understands that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background. Hypothesis: William recognizes that it is not the case that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: John does not believe that A woman in a white dress with one leg stops to read a poster. Hypothesis: John understands that they do not believe that A woman in a white dress with one leg stops to read a poster.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that A couple being romantic under the sunset.. Hypothesis: Charles does not suspects that it is not that case that A couple being romantic under the sunset.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John thinks that Several people are wading in a river in a deep gorge. Hypothesis: John knows that it is not the case that Several people are wading in a river in a deep gorge.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Sophia thinks that Dog standing in grassy sand dune. Hypothesis: Sophia thinks that they think that Dog standing in grassy sand dune.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph assumes that A woman wearing a hat and a man covering his eyes sit on benches on a boat.. Hypothesis: Joseph does not assumes that it is not that case that A woman wearing a hat and a man covering his eyes sit on benches on a boat.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that Two men, one kneeling and one squatting, are posing in front of a clear wall with shops in the background.. Hypothesis: Charles does not suspects that it is not that case that Two men, one kneeling and one squatting, are posing in front of a clear wall with shops in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James believes that Young girl sitting on bleachers.. Hypothesis: James does not believes that it is not that case that Young girl sitting on bleachers.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail suspects that A young man in a white and pink striped shirt is riding in a horse and buggy down a paved road.. Hypothesis: Abigail does not suspects that it is not that case that A young man in a white and pink striped shirt is riding in a horse and buggy down a paved road.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David suspects that A group of Japanese women wearing matching outfits walking across a crosswalk while passersby stare.. Hypothesis: David does not suspects that it is not that case that A group of Japanese women wearing matching outfits walking across a crosswalk while passersby stare.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles does not suspect that A white male with blond-hair is drinking beer. Hypothesis: Charles recognizes that they do not suspect that A white male with blond-hair is drinking beer.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia thinks that Two women in bathing suits walks across the sand.. Hypothesis: Sophia does not thinks that it is not that case that Two women in bathing suits walks across the sand.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John does not suspect that A man juggles flaming objects with a fence and a car in the background. Hypothesis: John knows that they do not suspect that A man juggles flaming objects with a fence and a car in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph does not believe that Two female workers sit on some steps during work. Hypothesis: Joseph recognizes that they do not believe that Two female workers sit on some steps during work.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: John thinks that A woman with blond-hair is sitting at a table and talking to a man with glasses. Hypothesis: John understands that they think that A woman with blond-hair is sitting at a table and talking to a man with glasses.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia understands that A couple is a standing together the woman is adjusting a flower on the man's lapel and they are dressed in wedding apparel. Hypothesis: Olivia thinks that they understand that A couple is a standing together the woman is adjusting a flower on the man's lapel and they are dressed in wedding apparel.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles suspects that Two men, one kneeling and one squatting, are posing in front of a clear wall with shops in the background.. Hypothesis: Charles does not suspects that it is not that case that Two men, one kneeling and one squatting, are posing in front of a clear wall with shops in the background.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor learns that A woman get some food from under a blue tent. Hypothesis: Taylor thinks that they learn that A woman get some food from under a blue tent.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail believes that Closeup of an elderly woman walking across a street with her male companion. Hypothesis: Abigail believes that they believe that Closeup of an elderly woman walking across a street with her male companion.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard assumes that A dog carrying a stick in its mouth runs through a snow-covered field.. Hypothesis: Richard does not assumes that it is not that case that A dog carrying a stick in its mouth runs through a snow-covered field.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas believes that A woman is standing near the water, looks to be throwing something. Hypothesis: Thomas believes that they learns that A woman is standing near the water, looks to be throwing something.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: David assumes that Little kids enjoy sprinklers by running through them outdoors. Hypothesis: David understands that they assume that Little kids enjoy sprinklers by running through them outdoors.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William understands that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background. Hypothesis: William recognizes that it is not the case that A man with a beard skateboarding and a boy with a blue and black backpack riding a green bike in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn does not believe that A girl in a purple tutu dances in the yard. Hypothesis: Evelyn believes that they do not believe that A girl in a purple tutu dances in the yard.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava suspects that A dark-haired drummer is playing his set with enthusiasm.. Hypothesis: Ava does not suspects that it is not that case that A dark-haired drummer is playing his set with enthusiasm.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James believes that Man and a woman walking on the street Hypothesis: James remembers that it is not the case that Man and a woman walking on the street", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James does not suspect that A baby wearing yellow is pretending to be a doctor while inside a stroller. Hypothesis: James thinks that they do not suspect that A baby wearing yellow is pretending to be a doctor while inside a stroller.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Taylor does not believe that A man in his 30's is sitting on a curb of a busy sidewalk, dressed in a furry green costume. Hypothesis: Taylor believes that they do not believe that A man in his 30's is sitting on a curb of a busy sidewalk, dressed in a furry green costume.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charles believes that Five young boys in swim trunks jump into a swimming pool at the same time. Hypothesis: Charles understands that they believe that Five young boys in swim trunks jump into a swimming pool at the same time.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma knows that A rock climber climbs a steep mountain. Hypothesis: Emma knows that they know that A rock climber climbs a steep mountain.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not suspect that A older gentleman finds it humorous that he is getting his picture taken while doing his laundry. Hypothesis: Thomas recognizes that they do not suspect that A older gentleman finds it humorous that he is getting his picture taken while doing his laundry.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: David believes that A man with a checkered shirt on is giving a powerpoint presentation to people. Hypothesis: David believes that they recognizes that A man with a checkered shirt on is giving a powerpoint presentation to people.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella recognizes that A smiling young girl with blond-hair, blue eyes, and a pink shirt, is holding a yellow flower towards the viewer outside. Hypothesis: Isabella believes that they recognize that A smiling young girl with blond-hair, blue eyes, and a pink shirt, is holding a yellow flower towards the viewer outside.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael believes that A man with a blue and gray shirt is standing in front of a metal fence while taking a picture of the landscape. Hypothesis: Michael believes that they learns that A man with a blue and gray shirt is standing in front of a metal fence while taking a picture of the landscape.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles suspects that Here we have a guy using a pressure washer on the sidewalk.. Hypothesis: Charles does not suspects that it is not that case that Here we have a guy using a pressure washer on the sidewalk.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava sees that A mother peacefully works on making a beautiful and colorful mat while her son admires her skills. Hypothesis: Ava recognizes that it is not the case that A mother peacefully works on making a beautiful and colorful mat while her son admires her skills.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard assumes that A woman is sitting outside while holding two cats. Hypothesis: Richard assumes that they sees that A woman is sitting outside while holding two cats.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia does not believe that A woman is standing on the sidewalk, in front of a crosswalk. Hypothesis: Olivia recognizes that they do not believe that A woman is standing on the sidewalk, in front of a crosswalk.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella believes that A man is doing tricks on a skateboard.. Hypothesis: Isabella does not believes that it is not that case that A man is doing tricks on a skateboard.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn does not assume that A boy in an innertube in the pool splashing and smiling. Hypothesis: Evelyn thinks that they do not assume that A boy in an innertube in the pool splashing and smiling.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia knows that A woman in a tomato-colored jogging suit carries both a red purse and a navy blue messenger bag. Hypothesis: Sophia knows that they know that A woman in a tomato-colored jogging suit carries both a red purse and a navy blue messenger bag.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail assumes that There is a woman throwing daggers at a target, which is a carrot.. Hypothesis: Abigail does not assumes that it is not that case that There is a woman throwing daggers at a target, which is a carrot.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia thinks that A woman with a purple purse sits on the metro with her suitcase.. Hypothesis: Amelia does not thinks that it is not that case that A woman with a purple purse sits on the metro with her suitcase.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael thinks that There are three men in this picture, two are on motorbikes, one of the men has a large piece of furniture on the back of his bike, the other is about to be handed a piece of paper by a man in a white shirt. Hypothesis: Michael thinks that they learns that There are three men in this picture, two are on motorbikes, one of the men has a large piece of furniture on the back of his bike, the other is about to be handed a piece of paper by a man in a white shirt.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles understands that A group of people standing on rafts with a waterfall in the background. Hypothesis: Charles learns that it is not the case that A group of people standing on rafts with a waterfall in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: James suspects that Three people, a woman and two men ride scooters amongst the pedestrians of a busy city street. Hypothesis: James knows that they suspect that Three people, a woman and two men ride scooters amongst the pedestrians of a busy city street.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Robert does not think that With the sun rising, a person is gliding with a huge parachute attached to them. Hypothesis: Robert thinks that they do not think that With the sun rising, a person is gliding with a huge parachute attached to them.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas does not believe that A woman in a red and white jacket riding a bicycle. Hypothesis: Thomas understands that they do not believe that A woman in a red and white jacket riding a bicycle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that A man performs a jumping trick on a skateboard and creates a shadow on the wall behind him.. Hypothesis: Evelyn does not thinks that it is not that case that A man performs a jumping trick on a skateboard and creates a shadow on the wall behind him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia believes that A man wearing a black T-shirt and a tan jacket wrapped around his waist pulls a wheeled gray and black bag as he walks next to a building that has large glass windows.. Hypothesis: Sophia does not believes that it is not that case that A man wearing a black T-shirt and a tan jacket wrapped around his waist pulls a wheeled gray and black bag as he walks next to a building that has large glass windows.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: William believes that A brown dog opens his mouth to catch a piece of food. Hypothesis: William believes that it is not the case that A brown dog opens his mouth to catch a piece of food.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph suspects that A young boy wearing a military sunhat catches a Frisbee outdoors. Hypothesis: Joseph thinks that it is not the case that A young boy wearing a military sunhat catches a Frisbee outdoors.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia does not believe that Two dogs running in the dirt Hypothesis: Amelia believes that they do not believe that Two dogs running in the dirt", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia suspects that A man with a blue shirt and glasses points to a picture in a book in front of a little girl and a stack of books. Hypothesis: Amelia suspects that they learns that A man with a blue shirt and glasses points to a picture in a book in front of a little girl and a stack of books.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael thinks that Two men and one woman are performing music on a stage. Hypothesis: Michael recognizes that they think that Two men and one woman are performing music on a stage.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas sees that There are five white individuals on a stage in a line, the outer four are looking inward toward the middle individual who has a beard. Hypothesis: Thomas sees that it is not the case that There are five white individuals on a stage in a line, the outer four are looking inward toward the middle individual who has a beard.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas thinks that Middle-aged man in jeans and dark blue t-shirt carrying a black item and walking across a lawn. Hypothesis: Thomas thinks that they remembers that Middle-aged man in jeans and dark blue t-shirt carrying a black item and walking across a lawn.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert does not assume that A person is climbing a cliff wall, over a rocky shore, using a rope. Hypothesis: Robert believes that they do not assume that A person is climbing a cliff wall, over a rocky shore, using a rope.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James does not assume that Two people work construction on the inside of a house. Hypothesis: James knows that they do not assume that Two people work construction on the inside of a house.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn knows that Young lady during a performance of modern dance. Hypothesis: Evelyn recognizes that they know that Young lady during a performance of modern dance.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Richard does not suspect that A child holds a football and runs from other children. Hypothesis: Richard believes that they do not suspect that A child holds a football and runs from other children.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia believes that A man is photographing a small staked camel and a woman is trying to walk past it. Hypothesis: Sophia believes that they sees that A man is photographing a small staked camel and a woman is trying to walk past it.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Evelyn sees that Two men are playing basketball, and one man is making a shot. Hypothesis: Evelyn assumes that it is not the case that Two men are playing basketball, and one man is making a shot.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William suspects that girl with helmet riding a brown horse Hypothesis: William knows that they suspect that girl with helmet riding a brown horse", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia thinks that Two men exchange conversation in a crowded place.. Hypothesis: Amelia does not thinks that it is not that case that Two men exchange conversation in a crowded place.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava believes that Two young children in blue jerseys, one with the number 9 and one with the number 2 are standing on wooden steps in a bathroom and washing their hands in a sink.. Hypothesis: Ava does not believes that it is not that case that Two young children in blue jerseys, one with the number 9 and one with the number 2 are standing on wooden steps in a bathroom and washing their hands in a sink.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael assumes that A snowboarder jumps high into the air off of a snowy ramp. Hypothesis: Michael believes that it is not the case that A snowboarder jumps high into the air off of a snowy ramp.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Robert does not assume that A person is climbing a cliff wall, over a rocky shore, using a rope. Hypothesis: Robert believes that they do not assume that A person is climbing a cliff wall, over a rocky shore, using a rope.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma assumes that A woman in an red tracksuit squeezing lemons in a press.. Hypothesis: Emma does not assumes that it is not that case that A woman in an red tracksuit squeezing lemons in a press.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Abigail suspects that A young man in a white and pink striped shirt is riding in a horse and buggy down a paved road.. Hypothesis: Abigail does not suspects that it is not that case that A young man in a white and pink striped shirt is riding in a horse and buggy down a paved road.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Joseph thinks that The two farmers are working on a piece of John Deere equipment. Hypothesis: Joseph suspects that it is not the case that The two farmers are working on a piece of John Deere equipment.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Richard does not believe that A little girl plays in the ocean on the beach. Hypothesis: Richard thinks that they do not believe that A little girl plays in the ocean on the beach.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava assumes that An Asian man in colorful robes holds a bell and leans toward a small table, with Buddhist or Hindu decorations on the table and the walls. Hypothesis: Ava understands that they assume that An Asian man in colorful robes holds a bell and leans toward a small table, with Buddhist or Hindu decorations on the table and the walls.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Isabella assumes that A man is performing an aerial skateboard trick on a ramp with several other people behind him. Hypothesis: Isabella thinks that they assume that A man is performing an aerial skateboard trick on a ramp with several other people behind him.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Amelia does not believe that A man pushing a food cart stands in front of a stone building and holds onto the bars covering a window. Hypothesis: Amelia believes that they do not believe that A man pushing a food cart stands in front of a stone building and holds onto the bars covering a window.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Charlotte remembers that A man walking towards the open sea. Hypothesis: Charlotte knows that it is not the case that A man walking towards the open sea.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael believes that A woman wearing a black shirt is standing next to an old rusted vehicle. Hypothesis: Michael believes that it is not the case that A woman wearing a black shirt is standing next to an old rusted vehicle.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Michael suspects that A smiling woman is playing the violin in front of a turquoise background. Hypothesis: Michael suspects that they remembers that A smiling woman is playing the violin in front of a turquoise background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Charles understands that A group of people standing on rafts with a waterfall in the background. Hypothesis: Charles learns that it is not the case that A group of people standing on rafts with a waterfall in the background.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph does not believe that Several men in fluorescent pinnies work on a structure shrouded in a green veil while a cherry picker truck hauls material. Hypothesis: Joseph thinks that they do not believe that Several men in fluorescent pinnies work on a structure shrouded in a green veil while a cherry picker truck hauls material.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas assumes that A woman building herself a sand castle. Hypothesis: Thomas thinks that they assume that A woman building herself a sand castle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Ava suspects that Man with dreadlocks on a skateboard in the middle of the street. Hypothesis: Ava suspects that they sees that Man with dreadlocks on a skateboard in the middle of the street.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas suspects that Two older men speak into microphones on a stage, while a projector screen displays a vintage photo of a young man behind them. Hypothesis: Thomas suspects that they understands that Two older men speak into microphones on a stage, while a projector screen displays a vintage photo of a young man behind them.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Amelia assumes that A man wearing headphones is standing in front of a poster.. Hypothesis: Amelia does not assumes that it is not that case that A man wearing headphones is standing in front of a poster.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Michael believes that A man with a blue and gray shirt is standing in front of a metal fence while taking a picture of the landscape. Hypothesis: Michael believes that they learns that A man with a blue and gray shirt is standing in front of a metal fence while taking a picture of the landscape.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas assumes that A woman building herself a sand castle. Hypothesis: Thomas thinks that they assume that A woman building herself a sand castle.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Thomas sees that Man in gray zippered jacket and red shirt pets a brown dog and holds a young girl in pink shirt, while a woman next to him holds an infant boy and a gray dog. Hypothesis: Thomas believes that it is not the case that Man in gray zippered jacket and red shirt pets a brown dog and holds a young girl in pink shirt, while a woman next to him holds an infant boy and a gray dog.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Isabella does not assume that A girl in uniform running through the water fountain gushing water from the tiles. Hypothesis: Isabella knows that they do not assume that A girl in uniform running through the water fountain gushing water from the tiles.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Olivia assumes that Military woman using a microscope.. Hypothesis: Olivia does not assumes that it is not that case that Military woman using a microscope.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Emma believes that A man holding a large swordfish. Hypothesis: Emma learns that it is not the case that A man holding a large swordfish.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Joseph thinks that Young child is falling through the air from a swing. Hypothesis: Joseph thinks that they knows that Young child is falling through the air from a swing.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Taylor believes that A musician with short blond-hair and wearing a blue scarf and vest plays a string instrument while singing. Hypothesis: Taylor knows that they believe that A musician with short blond-hair and wearing a blue scarf and vest plays a string instrument while singing.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: James knows that A young man with a plain shirt looking down, with a band and dancing people behind him. Hypothesis: James thinks that it is not the case that A young man with a plain shirt looking down, with a band and dancing people behind him.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia thinks that Male and female ballerinas dancing together and he is holding her slightly in air. Hypothesis: Olivia suspects that it is not the case that Male and female ballerinas dancing together and he is holding her slightly in air.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: William remembers that A man in a black shirt is standing behind a blue SUV. Hypothesis: William knows that it is not the case that A man in a black shirt is standing behind a blue SUV.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Olivia thinks that Two ladies are sitting in the restaurant talking and laughing. Hypothesis: Olivia thinks that they knows that Two ladies are sitting in the restaurant talking and laughing.", "target_scores": {"entailment": 0, "non_entailment": 1}}, {"input": "Premise: Thomas suspects that Two people are walking up a mountain.. Hypothesis: Thomas does not suspects that it is not that case that Two people are walking up a mountain.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Sophia does not think that Two girls and one women stand in the pouring rain. Hypothesis: Sophia understands that they do not think that Two girls and one women stand in the pouring rain.", "target_scores": {"entailment": 1, "non_entailment": 0}}, {"input": "Premise: Evelyn thinks that A man is scrapping paint off a window.. Hypothesis: Evelyn does not thinks that it is not that case that A man is scrapping paint off a window.", "target_scores": {"entailment": 1, "non_entailment": 0}}]}