{"name": "mixed epistemic reasoning", "description": "A mixture of the BIG-bench epistemic reasoning dataset and kd45 reasoning dataset", "examples": [{"input": "Premise: Emma suspects that Charlotte remembers that two men are running down a road and carrying a canoe. Hypothesis: Emma suspects that two men are running down a road and carrying a canoe.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia knows that a demolition crane tearing down what is left of a building with a man standing on a platform spraying water. Hypothesis: Olivia knows that the demolition vehicle is being operated.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte thinks that John sees that an engineer with a blue jacket and cap wears purple gloves while looking up. Hypothesis: John sees that an engineer with a blue jacket and cap wears purple gloves while looking up.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava learns that a blond-haired baby is sitting on the floor playing with toys while looking at a black and white cat. Hypothesis: Ava learns that the baby and the cat are in the same room.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David thinks that Michael recognizes that three men are playing frisbee in the woods. Hypothesis: David thinks that three men are playing frisbee in the woods.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas understands that Sophia suspects that a man walks by a building at night. Hypothesis: Sophia suspects that Thomas understands that a man walks by a building at night.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert remembers that three teenagers wearing t-shirt run down the beach, with several other people in the background. Hypothesis: Robert remembers that a number of young people run on a beach.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John assumes that Evelyn remembers that the young boy in a red shirt and jeans resists his sister's request for water on the road. Hypothesis: John assumes that the young boy in a red shirt and jeans resists his sister's request for water on the road.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn knows that Emma suspects that the young lady is giving the old man a hug. Hypothesis: Emma suspects that Evelyn knows that the young lady is giving the old man a hug.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert remembers that Richard assumes that a man examines his facial hair. Hypothesis: Richard assumes that a man examines his facial hair.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor suspects that Charlotte believes that a man in a red shirt is sitting on top of a rocky mountain. Hypothesis: Charlotte believes that a man in a red shirt is sitting on top of a rocky mountain.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael thinks that Thomas believes that children play on a sidewalk with dolls and chalk. Hypothesis: Michael thinks that children play on a sidewalk with dolls and chalk.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James assumes that Charlotte sees that two young musicians play from a stage. Hypothesis: James assumes that two young musicians play from a stage.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava suspects that Isabella believes that a man in a jacket is standing in a gas station, next to a car and lights are shining in the distance. Hypothesis: Ava suspects that a man in a jacket is standing in a gas station, next to a car and lights are shining in the distance.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael suspects that Charles believes that a man wearing a headscarf and loincloth is laying and smoothing an asphalt surface near a forest on a hot day. Hypothesis: Michael suspects that a man wearing a headscarf and loincloth is laying and smoothing an asphalt surface near a forest on a hot day.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles remembers that Amelia believes that a black scientist looks through a scope examining a biological specimen's blood cells. Hypothesis: Amelia believes that a black scientist looks through a scope examining a biological specimen's blood cells.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor suspects that Richard suspects that people gathered around a table with food and wine on it. Hypothesis: Taylor suspects that people gathered around a table with food and wine on it.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard understands that Evelyn assumes that a man is working in an art studio and is surrounded by art supplies. Hypothesis: Evelyn assumes that Richard understands that a man is working in an art studio and is surrounded by art supplies.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn understands that James believes that a young boy sits outside in a grassy field with his back turned towards the viewer- he is holding a wooden toy that can be spun between your hands and launched into the air. Hypothesis: James believes that a young boy sits outside in a grassy field with his back turned towards the viewer- he is holding a wooden toy that can be spun between your hands and launched into the air.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles thinks that Robert sees that some cars and many tents are set up at the foot of a mountain. Hypothesis: Robert sees that some cars and many tents are set up at the foot of a mountain.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia thinks that Charles suspects that a stoplight displaying two bicycle symbols, a left-turning green arrow and a red forward signal stands in the foreground while a man in a white hat and blue shirt bikes along a red path. Hypothesis: Olivia thinks that a stoplight displaying two bicycle symbols, a left-turning green arrow and a red forward signal stands in the foreground while a man in a white hat and blue shirt bikes along a red path.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that Sophia recognizes that man in blue shirt yells and points off-camera while a man in a blue shirt and baseball cap watches. Hypothesis: Robert believes that man in blue shirt yells and points off-camera while a man in a blue shirt and baseball cap watches.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava suspects that Charlotte sees that one man in baseball cap looks out while two men look down. Hypothesis: Ava suspects that one man in baseball cap looks out while two men look down.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph believes that Charles believes that two men stand in hula grass skirts stand in the back of a truck at the top of a silver ramp. Hypothesis: Joseph believes that two men stand in hula grass skirts stand in the back of a truck at the top of a silver ramp.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William believes that Taylor knows that a young girl in a helmet walks barefoot across a mossy tree trunk that is lying over water. Hypothesis: William believes that a young girl in a helmet walks barefoot across a mossy tree trunk that is lying over water.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava remembers that Evelyn thinks that a man in an orange jacket reaches under a busted up blue car on wooden supports. Hypothesis: Evelyn thinks that Ava remembers that a man in an orange jacket reaches under a busted up blue car on wooden supports.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph believes that Robert suspects that a little boy punching out flashcards from the cardboard they came in. Hypothesis: Joseph believes that a little boy punching out flashcards from the cardboard they came in.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert knows that Sophia assumes that two girls (one dressed in blue, and one dressed in pink) are racing one another on rollerskates. Hypothesis: Sophia assumes that Robert knows that two girls (one dressed in blue, and one dressed in pink) are racing one another on rollerskates.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William understands that a smiling girl walking and a frowning girl with a phone. Hypothesis: Taylor understands that a smiling girl walking and a frowning girl with a cellphone.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas sees that Sophia believes that people buy fruits and vegetables at an open air market. Hypothesis: Sophia believes that people buy fruits and vegetables at an open air market.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles understands that a person with dark hair in a white shirt is sitting in a chair in water with a \"swim at your own risk\" sign on the wall. Hypothesis: Charles understands that a person sits in a chair in water.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James suspects that Ava recognizes that a young ladies squatting at hillside sipping on a drink the other one with the white purse is talking pictures. Hypothesis: James suspects that a young ladies squatting at hillside sipping on a drink the other one with the white purse is talking pictures.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John thinks that Abigail assumes that a group of girls in black and white spotted skirts cross a street. Hypothesis: John thinks that a group of girls in black and white spotted skirts cross a street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John sees that Joseph suspects that a woman with red-hair and a leather jacket holds a harp in front of a snowy forest. Hypothesis: Joseph suspects that a woman with red-hair and a leather jacket holds a harp in front of a snowy forest.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael recognizes that a group of dogs stand in the snow. Hypothesis: Charlotte recognizes that there are animals outdoors.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael assumes that Charlotte believes that people are sitting on a bench in front of buildings. Hypothesis: Michael assumes that people are sitting on a bench in front of buildings.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn sees that William believes that a brown and black dog runs on the grass outdoors in front of a sidewalk. Hypothesis: William believes that a brown and black dog runs on the grass outdoors in front of a sidewalk.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John knows that a young boy attempts to push the Walmart shopping cart for a man. Hypothesis: John knows that a biy pushing a shopping cart.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella believes that Ava suspects that three men are sitting on a beach dressed in orange with refuse carts in front of them. Hypothesis: Isabella believes that three men are sitting on a beach dressed in orange with refuse carts in front of them.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia assumes that Emma suspects that two girls pass two boys by a tree in a neon lit street. Hypothesis: Emma suspects that two girls pass two boys by a tree in a neon lit street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte assumes that Richard recognizes that a bicycle rider wearing racing gear pedals a yellow bike past the wire fence at the edge of a field, with a stand of trees in the background. Hypothesis: Charlotte assumes that a bicycle rider wearing racing gear pedals a yellow bike past the wire fence at the edge of a field, with a stand of trees in the background.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn recognizes that John assumes that a toddler, sitting next to another girl who is slightly older, is using a bubble machine to blow a large bubble into the air. Hypothesis: John assumes that a toddler, sitting next to another girl who is slightly older, is using a bubble machine to blow a large bubble into the air.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail sees that young people and a kid are walking in the forest in a sunny day. Hypothesis: Abigail sees that young people and a kid are walking in the forest.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert knows that a young black man wearing a dark leather jacket and gloves is standing on a lit stage, looking down. Hypothesis: Richard knows that a black man is standing on stage.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William understands that a group of people, one of which is a woman with a large white and colorful purse, wait to board a large white and blue bus. Hypothesis: Isabella understands that a group of people wait at a bus stop as a large white and blue bus stops.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia recognizes that James believes that a young boy, wearing a jesters hat is enjoying himself sledding. Hypothesis: James believes that Amelia recognizes that a young boy, wearing a jesters hat is enjoying himself sledding.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn suspects that Richard understands that a blond boy stands among people in a shady setting with a large snake wrapped around his chest. Hypothesis: Evelyn suspects that a blond boy stands among people in a shady setting with a large snake wrapped around his chest.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella suspects that David understands that 2 people with backpacks are at a table with a woman with a beige blazer sitting behind it. Hypothesis: Isabella suspects that 2 people with backpacks are at a table with a woman with a beige blazer sitting behind it.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard suspects that a black dog is swimming with a ball in his mouth. Hypothesis: Isabella suspects that a black dog found a ball in the water and is bring it back to its owner.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail knows that Taylor assumes that a gentleman standing on steps getting his picture taken by a girl wearing a dress. Hypothesis: Taylor assumes that Abigail knows that a gentleman standing on steps getting his picture taken by a girl wearing a dress.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard assumes that Joseph understands that a woman in a US military uniform is writing on a large piece of white paper with a black magic marker while others are sitting at tables around her. Hypothesis: Joseph understands that a woman in a US military uniform is writing on a large piece of white paper with a black magic marker while others are sitting at tables around her.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard suspects that Emma suspects that three men dressed in suits and ties clasps their raised hands while standing in front of corporate logos. Hypothesis: Emma suspects that three men dressed in suits and ties clasps their raised hands while standing in front of corporate logos.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn thinks that David believes that a man in a bright yellow shirt juggles while riding a unicycle. Hypothesis: David believes that a man in a bright yellow shirt juggles while riding a unicycle.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles understands that John assumes that a man in a military uniform is walking away from a line of military vehicles. Hypothesis: John assumes that Charles understands that a man in a military uniform is walking away from a line of military vehicles.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles believes that Charlotte remembers that a man is installing a roof. Hypothesis: Charles believes that a man is installing a roof.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert suspects that Emma believes that five People are kneeling between two park cars, and one man is approaching with his arm raised into the air. Hypothesis: Robert suspects that five People are kneeling between two park cars, and one man is approaching with his arm raised into the air.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia learns that a man with a cigarette sits on the stoop. Hypothesis: James learns that a man sits and smokes outside.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail thinks that Evelyn understands that a young boy swings a hula hoop while other children sit on the floor with their hoops. Hypothesis: Evelyn understands that a young boy swings a hula hoop while other children sit on the floor with their hoops.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard suspects that Michael knows that a person is riding their motorbike and a person in a bright yellow jacket is watching someone fall off their bike. Hypothesis: Richard suspects that a person is riding their motorbike and a person in a bright yellow jacket is watching someone fall off their bike.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William believes that Emma knows that the football player prepares to kick the ball. Hypothesis: Emma knows that the football player prepares to kick the ball.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella sees that Olivia thinks that coach talks with football player, other players and crowd in background. Hypothesis: Olivia thinks that Isabella sees that coach talks with football player, other players and crowd in background.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas remembers that a group of people is sitting at a large table and using paint brushes to form characters on white paper. Hypothesis: Thomas remembers that the people are using paint brushes.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail believes that Ava believes that a boy in a beige shirt is sleeping in a car. Hypothesis: Abigail believes that a boy in a beige shirt is sleeping in a car.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph recognizes that a young boy runs across a road in front of a sky blue building with barred windows. Hypothesis: Joseph recognizes that a boy is running infront of a building.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava believes that Evelyn recognizes that a boy watches a woman walking amidst many concrete boxes. Hypothesis: Evelyn recognizes that a boy watches a woman walking amidst many concrete boxes.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas thinks that James assumes that a young man holds a hammer shaped object in the air with one hand and a similar shaped object in the other while making a funny expression. Hypothesis: Thomas thinks that a young man holds a hammer shaped object in the air with one hand and a similar shaped object in the other while making a funny expression.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph assumes that Isabella believes that a dog is walking down steps. Hypothesis: Isabella believes that a dog is walking down steps.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William understands that city street crowded with sports fans wearing orange. Hypothesis: Abigail understands that the sports fans are wearing a certain color.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas believes that beautiful girl in white dress steps into the sunlight. Hypothesis: Thomas believes that it is a sunny day.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma thinks that James thinks that a man leads the way in a race. Hypothesis: James thinks that a man leads the way in a race.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma understands that a small girl with short brown hair is pushing a pink scooter over grass with brown leaves with threes in the background. Hypothesis: James understands that the girl is outside.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia assumes that Taylor thinks that a group of students are walking through the campus. Hypothesis: Taylor thinks that a group of students are walking through the campus.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia assumes that Taylor learns that people in bathing suits bend down and reach into the water of a lake. Hypothesis: Olivia assumes that people in bathing suits bend down and reach into the water of a lake.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David suspects that Abigail understands that a man takes a drink in the doorway of a home. Hypothesis: David suspects that a man takes a drink in the doorway of a home.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard assumes that a person is sitting on a yellow picnic table with a water bottle, while a baby stroller sits beside her. Hypothesis: Taylor assumes that a individual on a table holds a water near a stroller.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma assumes that some people are relaxing in front of a large red building. Hypothesis: Emma assumes that a crowd relaxes in front of a large red building.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John remembers that Emma suspects that this person looks to be snowboarding on a very small pile of snow on a sunny cold day. Hypothesis: Emma suspects that John remembers that this person looks to be snowboarding on a very small pile of snow on a sunny cold day.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte believes that a young smiling girl is holding a stuffed animal in one hand and a candy apple in the other. Hypothesis: Joseph believes that a young smiling girl is holding a stuffed animal in one hand.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles believes that Isabella recognizes that there is a man poking a long stick up towards the ceiling. Hypothesis: Isabella recognizes that there is a man poking a long stick up towards the ceiling.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma sees that right leg in a brace, a young boy lies on the couch while using his cellphone. Hypothesis: Emma sees that the right leg is in a brace.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James thinks that Amelia knows that a group stands and watches two men, apparently dressed in some sort of costume, wrestle on the ground. Hypothesis: James thinks that a group stands and watches two men, apparently dressed in some sort of costume, wrestle on the ground.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles understands that three young girls and a baby are sitting in the grass on a blue blanket with baby toys scattered on it. Hypothesis: Charles understands that there are four people outside.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail sees that Ava thinks that a woman wearing a yellow tank top and white pants looking into a window on a city street. Hypothesis: Ava thinks that Abigail sees that a woman wearing a yellow tank top and white pants looking into a window on a city street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava suspects that Thomas remembers that a boy in a yellow t-shirt and pink sweater talks on a cellphone while riding a horse through a crowd of people who are looking on. Hypothesis: Ava suspects that a boy in a yellow t-shirt and pink sweater talks on a cellphone while riding a horse through a crowd of people who are looking on.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor assumes that a man in a white and gray shirt looks on as a shirtless man with a mustache cleans fish on a pale green table. Hypothesis: Taylor assumes that the man watches the other clean a fish.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia knows that an Asian woman enjoys a nice treat. Hypothesis: Sophia knows that a lady is taking pleasure from a treat.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia thinks that someone with a long pole that appears to have a spike on the end is pointing it at a red balloon on the other side of the wall from him. Hypothesis: Amelia thinks that a person with a long object stands on one side of a wall and a balloon floats on the other side.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael suspects that Richard recognizes that one woman with jeans, gray shirt and sandals; with girl in all pink watching a white ball float in midair. Hypothesis: Michael suspects that one woman with jeans, gray shirt and sandals; with girl in all pink watching a white ball float in midair.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia thinks that Charles thinks that a man wearing a black t-shirt that says \"Long Live the Dead\" pulls a shopping cart in the street near a NYC yellow taxi cab. Hypothesis: Sophia thinks that a man wearing a black t-shirt that says \"Long Live the Dead\" pulls a shopping cart in the street near a NYC yellow taxi cab.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail believes that Isabella learns that a woman with a navy sweater is looking through a blue telescope at a statue of a dinosaur. Hypothesis: Abigail believes that a woman with a navy sweater is looking through a blue telescope at a statue of a dinosaur.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas believes that Charlotte suspects that the man in colorful shorts is barefoot. Hypothesis: Charlotte suspects that the man in colorful shorts is barefoot.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava suspects that John thinks that there is a green trash truck in road with a person sweeping sidewalk. Hypothesis: Ava suspects that there is a green trash truck in road with a person sweeping sidewalk.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma believes that Isabella understands that a motorist gets some air over a rough hill. Hypothesis: Emma believes that a motorist gets some air over a rough hill.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert recognizes that one man watches while another breakdances, balancing himself for a moment on one hand. Hypothesis: Robert recognizes that a man breakdances while someone watches.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia suspects that Taylor suspects that a lady looks surprised. Hypothesis: Olivia suspects that a lady looks surprised.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor assumes that Charlotte believes that a girl is blowing a huge bubble. Hypothesis: Taylor assumes that a girl is blowing a huge bubble.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William suspects that John remembers that two women stand in the street both wearing matching outfits with police like jackets that say Polotie. Hypothesis: John remembers that two women stand in the street both wearing matching outfits with police like jackets that say Polotie.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas suspects that Amelia thinks that a young man in a white hat is playing golf with an older man wearing a blue, long-sleeved shirt and khakis. Hypothesis: Amelia thinks that a young man in a white hat is playing golf with an older man wearing a blue, long-sleeved shirt and khakis.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma knows that Isabella thinks that the man in the blue shirt is relaxing on the rocks. Hypothesis: Isabella thinks that Emma knows that the man in the blue shirt is relaxing on the rocks.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn thinks that Thomas assumes that a dog jumps over the pole. Hypothesis: Evelyn thinks that a dog jumps over the pole.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that Michael assumes that a public speaker in a plaid shirt speaks on the microphone. Hypothesis: Michael assumes that a public speaker in a plaid shirt speaks on the microphone.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that Evelyn remembers that two men with graying beards share a laugh while enjoying the nice weather. Hypothesis: Abigail assumes that two men with graying beards share a laugh while enjoying the nice weather.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor sees that Thomas assumes that two cars, one red and one blue, race each other in a very tight and competitive nature as fans stand by and watch. Hypothesis: Thomas assumes that Taylor sees that two cars, one red and one blue, race each other in a very tight and competitive nature as fans stand by and watch.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia understands that a man waiting in an airport terminal writes on a piece of paper as others are seen behind. Hypothesis: Taylor understands that a man scribbles indoors.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that Amelia assumes that a young man in an orange shirt, maneuvers a skateboard at the top of a ramp. Hypothesis: Robert believes that a young man in an orange shirt, maneuvers a skateboard at the top of a ramp.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William learns that Abigail thinks that bicyclist ride the course near the ocean as the day comes to an end. Hypothesis: Abigail thinks that bicyclist ride the course near the ocean as the day comes to an end.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor sees that a young boy in a straw hat drinks out of a plastic pink cup. Hypothesis: Taylor sees that a young kid is drinking out of a cup.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph remembers that Charlotte assumes that a man in reflective sunglasses, a skull T-shirt, and long red shorts sits out of the sun in a folding chair. Hypothesis: Charlotte assumes that a man in reflective sunglasses, a skull T-shirt, and long red shorts sits out of the sun in a folding chair.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella suspects that William assumes that the man in the black hat has his back to a theater sign. Hypothesis: William assumes that the man in the black hat has his back to a theater sign.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles learns that Thomas believes that children are playing in the street with a toy. Hypothesis: Thomas believes that children are playing in the street with a toy.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David learns that Sophia assumes that several members of a community are celebrating with music and costumes during a festival or party. Hypothesis: Sophia assumes that several members of a community are celebrating with music and costumes during a festival or party.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn thinks that David believes that a man in a bright yellow shirt juggles while riding a unicycle. Hypothesis: David believes that a man in a bright yellow shirt juggles while riding a unicycle.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia knows that Abigail believes that a woman with a red scarf, white shirt, and tan shorts is giving a shushing sign to the camera in front of shelves of books. Hypothesis: Abigail believes that a woman with a red scarf, white shirt, and tan shorts is giving a shushing sign to the camera in front of shelves of books.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia knows that Abigail suspects that a five person Brass band is seated, semi-circularly, in a white alcove of a church that has stained glass windows. Hypothesis: Abigail suspects that Sophia knows that a five person Brass band is seated, semi-circularly, in a white alcove of a church that has stained glass windows.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William suspects that Charlotte thinks that a man on a bicycle rides past a park, with a group of people in the background. Hypothesis: Charlotte thinks that a man on a bicycle rides past a park, with a group of people in the background.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph believes that Taylor understands that a homeless man carries a sign that says \"hungry\". Hypothesis: Taylor understands that a homeless man carries a sign that says \"hungry\".", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John knows that a young boy attempts to push the Walmart shopping cart for a man. Hypothesis: John knows that a biy pushing a shopping cart.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella recognizes that Ava believes that a man wearing a black sweater and a knit cap sits in front of mountain scenery, with a cloudy sky overhead. Hypothesis: Ava believes that Isabella recognizes that a man wearing a black sweater and a knit cap sits in front of mountain scenery, with a cloudy sky overhead.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard suspects that Michael understands that a man is talking on a cellphone while filling his car with gas. Hypothesis: Richard suspects that a man is talking on a cellphone while filling his car with gas.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard believes that Olivia recognizes that a lit girl splashes around in natural water. Hypothesis: Olivia recognizes that a lit girl splashes around in natural water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John recognizes that Amelia thinks that a woman in a black leather shirt trench-coat and black leather calf-high boots and carrying a colorful bag with a shoulder strap faces away from the camera with a yellow post visible just in front of her. Hypothesis: Amelia thinks that a woman in a black leather shirt trench-coat and black leather calf-high boots and carrying a colorful bag with a shoulder strap faces away from the camera with a yellow post visible just in front of her.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma thinks that Charlotte thinks that a woman is standing near three stores, two have beautiful artwork and the other store has Largo written on it. Hypothesis: Emma thinks that a woman is standing near three stores, two have beautiful artwork and the other store has Largo written on it.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles sees that Emma suspects that a man is hanging sausages in a market. Hypothesis: Emma suspects that a man is hanging sausages in a market.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael thinks that Evelyn remembers that a rescue worker searches with a flashlight under a slab in a ruined building. Hypothesis: Evelyn remembers that a rescue worker searches with a flashlight under a slab in a ruined building.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma believes that Taylor sees that little girl is flipping an omelet in the kitchen. Hypothesis: Taylor sees that little girl is flipping an omelet in the kitchen.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas suspects that Amelia thinks that a young man in a white hat is playing golf with an older man wearing a blue, long-sleeved shirt and khakis. Hypothesis: Amelia thinks that a young man in a white hat is playing golf with an older man wearing a blue, long-sleeved shirt and khakis.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor sees that John suspects that a group of three people and one dog hike up a green mountainside. Hypothesis: John suspects that Taylor sees that a group of three people and one dog hike up a green mountainside.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas recognizes that James assumes that a young boy wearing a suit and top hat is holding hands with a girl in a green dress. Hypothesis: James assumes that Thomas recognizes that a young boy wearing a suit and top hat is holding hands with a girl in a green dress.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David believes that Thomas knows that a child hugs a birdhouse. Hypothesis: Thomas knows that a child hugs a birdhouse.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that Taylor learns that two men are laying floor tiles in a doorway. Hypothesis: Abigail assumes that two men are laying floor tiles in a doorway.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn believes that a lady digs through a garbage can looking to add to the shopping cart beside her. Hypothesis: Richard believes that lady digs through garbage.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James thinks that Evelyn believes that four kids pose on a stage. Hypothesis: James thinks that four kids pose on a stage.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard thinks that Robert suspects that a young boy is taking American flags to place them where they will remind others of the sacrifices made by veterans. Hypothesis: Robert suspects that a young boy is taking American flags to place them where they will remind others of the sacrifices made by veterans.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles recognizes that a tennis player in blue shorts and a white shirt making an aggressive backhand swing towards the tennis ball. Hypothesis: Charles recognizes that a person is holding a tennis racket.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia thinks that Robert sees that a cyclist dressed in black and white is pointing. Hypothesis: Amelia thinks that a cyclist dressed in black and white is pointing.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella learns that a woman carries a small, unhappy child in a busy street scene. Hypothesis: Isabella learns that woman carrying a child.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John remembers that Amelia suspects that two children are swimming in a pool. Hypothesis: Amelia suspects that John remembers that two children are swimming in a pool.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia remembers that a man walks on the icy sidewalk. Hypothesis: Sophia remembers that the man is outdoors.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard suspects that Taylor knows that a female softball player in a black and red uniform with a red batting helmet is holding her bat waiting for the pitch. Hypothesis: Taylor knows that a female softball player in a black and red uniform with a red batting helmet is holding her bat waiting for the pitch.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James believes that Joseph recognizes that a middle-aged man chef is in a white doorway of a mobile kitchen. Hypothesis: James believes that a middle-aged man chef is in a white doorway of a mobile kitchen.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia believes that a man in a hard hat looks intimidated. Hypothesis: David believes that he is working in a potentially dangerous field that requires a hard hat.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John assumes that William suspects that a young, well-dressed black man seated behind a drum set and smiling. Hypothesis: William suspects that a young, well-dressed black man seated behind a drum set and smiling.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia assumes that William understands that a snowboarder is grinding down a long concrete rail. Hypothesis: William understands that a snowboarder is grinding down a long concrete rail.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella believes that Charlotte assumes that a group of kids play on a colorful structure. Hypothesis: Charlotte assumes that a group of kids play on a colorful structure.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that Sophia assumes that three people are standing on a lit stage while groups of people sitting at tables face them. Hypothesis: Robert believes that three people are standing on a lit stage while groups of people sitting at tables face them.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John believes that David understands that person with umbrella observes flooded streets with cars in the water. Hypothesis: David understands that person with umbrella observes flooded streets with cars in the water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William thinks that Isabella believes that soldiers are holding guns and peeking around a building. Hypothesis: Isabella believes that soldiers are holding guns and peeking around a building.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John assumes that Evelyn remembers that the young boy in a red shirt and jeans resists his sister's request for water on the road. Hypothesis: John assumes that the young boy in a red shirt and jeans resists his sister's request for water on the road.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn understands that Taylor thinks that a man looks intent while sculpting a gargoyle. Hypothesis: Taylor thinks that Evelyn understands that a man looks intent while sculpting a gargoyle.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma suspects that Charlotte assumes that a man is holding a book standing in front of a chalkboard. Hypothesis: Charlotte assumes that a man is holding a book standing in front of a chalkboard.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph suspects that Olivia learns that two men talk outdoors. Hypothesis: Joseph suspects that two men talk outdoors.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava thinks that Charlotte remembers that two dogs are digging under a large rock with their bottoms to the camera. Hypothesis: Charlotte remembers that two dogs are digging under a large rock with their bottoms to the camera.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn sees that Sophia suspects that a barefoot man in an orange shirt, shorts, and a baseball cap is sitting on the open tailgate of a silver pickup truck. Hypothesis: Sophia suspects that a barefoot man in an orange shirt, shorts, and a baseball cap is sitting on the open tailgate of a silver pickup truck.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William understands that Isabella suspects that a woman wearing a red work man's hat and red jacket is hiking in the snow topped mountains. Hypothesis: Isabella suspects that a woman wearing a red work man's hat and red jacket is hiking in the snow topped mountains.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William assumes that adults and children share in the looking at something, and some young ladies stand to the side. Hypothesis: William assumes that some children are looking.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph recognizes that Charles suspects that two women are hugging on a path through a grassy area with a cow visible past them. Hypothesis: Charles suspects that Joseph recognizes that two women are hugging on a path through a grassy area with a cow visible past them.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William understands that a smiling girl walking and a frowning girl with a phone. Hypothesis: Taylor understands that a smiling girl walking and a frowning girl with a cellphone.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail suspects that Richard assumes that a roofer in a gray sweatshirt and orange hat walks on a unfinished roof at a lake-side home. Hypothesis: Richard assumes that a roofer in a gray sweatshirt and orange hat walks on a unfinished roof at a lake-side home.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William believes that Taylor knows that a young girl in a helmet walks barefoot across a mossy tree trunk that is lying over water. Hypothesis: William believes that a young girl in a helmet walks barefoot across a mossy tree trunk that is lying over water.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert knows that Abigail suspects that four men and a young boy are at a table set up for wood crafts. Hypothesis: Abigail suspects that Robert knows that four men and a young boy are at a table set up for wood crafts.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia knows that a woman is walking her dog along a snowy ground. Hypothesis: Evelyn knows that a woman is with her dog outside.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James suspects that Isabella understands that a four piece band plays a song on a medium-size stage. Hypothesis: Isabella understands that a four piece band plays a song on a medium-size stage.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph suspects that Robert sees that this person is walking down the street and talking on their cellphone on a windy day. Hypothesis: Robert sees that this person is walking down the street and talking on their cellphone on a windy day.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard thinks that Amelia assumes that a young boy sits on the shoulders of a woman, who is carrying a young girl. Hypothesis: Richard thinks that a young boy sits on the shoulders of a woman, who is carrying a young girl.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia thinks that Charles suspects that a stoplight displaying two bicycle symbols, a left-turning green arrow and a red forward signal stands in the foreground while a man in a white hat and blue shirt bikes along a red path. Hypothesis: Olivia thinks that a stoplight displaying two bicycle symbols, a left-turning green arrow and a red forward signal stands in the foreground while a man in a white hat and blue shirt bikes along a red path.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma believes that Charles remembers that a brown dog plays in a deep pile of snow. Hypothesis: Emma believes that a brown dog plays in a deep pile of snow.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella believes that three people are walking on a beach. Hypothesis: Isabella believes that a few people are near the ocean.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard thinks that David assumes that a young man wearing dark sunglasses smiling. Hypothesis: Richard thinks that a young man wearing dark sunglasses smiling.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas assumes that Amelia remembers that by a table with several boxes and two coffee cups on it, a woman in a green sweater is opening a small box and another person (whose head cannot be seen) is operating a small handheld electronic device. Hypothesis: Thomas assumes that by a table with several boxes and two coffee cups on it, a woman in a green sweater is opening a small box and another person (whose head cannot be seen) is operating a small handheld electronic device.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia remembers that Evelyn suspects that a man walks three white dogs with spots down a street with palm trees. Hypothesis: Evelyn suspects that a man walks three white dogs with spots down a street with palm trees.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia suspects that Taylor understands that kids work at computers with a teacher's help. Hypothesis: Olivia suspects that kids work at computers with a teacher's help.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail knows that a young blond child wearing a black shirt and white shorts looks at the sky with a bridge and water in the background. Hypothesis: Abigail knows that a child looks at the sky outside.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail believes that Ava believes that a boy in a beige shirt is sleeping in a car. Hypothesis: Abigail believes that a boy in a beige shirt is sleeping in a car.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma believes that Taylor assumes that a cement worker is working on a new sidewalk outside of a clothing store. Hypothesis: Taylor assumes that a cement worker is working on a new sidewalk outside of a clothing store.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles believes that Isabella recognizes that there is a man poking a long stick up towards the ceiling. Hypothesis: Isabella recognizes that there is a man poking a long stick up towards the ceiling.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James knows that Joseph thinks that a man wearing a wife-beater sings into a microphone as a blue light shines on him. Hypothesis: Joseph thinks that James knows that a man wearing a wife-beater sings into a microphone as a blue light shines on him.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn suspects that James sees that a man wearing a black hat and coat makes a face with a crowd behind him. Hypothesis: Evelyn suspects that a man wearing a black hat and coat makes a face with a crowd behind him.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma assumes that Charles recognizes that young people are standing around a drum at a party. Hypothesis: Charles recognizes that young people are standing around a drum at a party.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia assumes that Emma suspects that two girls pass two boys by a tree in a neon lit street. Hypothesis: Emma suspects that two girls pass two boys by a tree in a neon lit street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor assumes that William assumes that a boy at the beach runs through the surf towards three other people who are already in the water. Hypothesis: William assumes that a boy at the beach runs through the surf towards three other people who are already in the water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John sees that Amelia thinks that women in red are performing with nun-chucks. Hypothesis: Amelia thinks that women in red are performing with nun-chucks.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David believes that Taylor sees that a man wearing white turns to hit a yellow tennis ball. Hypothesis: Taylor sees that a man wearing white turns to hit a yellow tennis ball.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia remembers that a young girl in a red top is running through a grassy area with large buildings in the background. Hypothesis: Ava remembers that the young girl is outside.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma believes that Charlotte believes that a tour bus parked in a park. Hypothesis: Charlotte believes that a tour bus parked in a park.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma understands that Evelyn believes that an impoverished person, wearing a torn brown shirt and no shoes, is kneeling down along the banks of a trash infested body of water. Hypothesis: Evelyn believes that Emma understands that an impoverished person, wearing a torn brown shirt and no shoes, is kneeling down along the banks of a trash infested body of water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail suspects that Robert remembers that a well dressed elderly woman standing in front of a bus decorated with images of purple flowers. Hypothesis: Abigail suspects that a well dressed elderly woman standing in front of a bus decorated with images of purple flowers.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma thinks that James understands that a group of people, mostly in straw hats, follow a man onto a beach covered with many large rocks. Hypothesis: James understands that a group of people, mostly in straw hats, follow a man onto a beach covered with many large rocks.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor assumes that Charles recognizes that women are sitting around a table at a restaurant chatting. Hypothesis: Charles recognizes that women are sitting around a table at a restaurant chatting.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella remembers that a shirtless man is painting over a graffiti filled wall with a paint roller. Hypothesis: David remembers that a man is painting a wall.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn believes that a man is on a skateboard jumping from a short ledge onto the sidewalk. Hypothesis: Ava believes that the man is outdoors.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard assumes that Robert learns that a man in a leather jacket and glasses walks across an intersection while a man in a gray sweatshirt and white hat looks on. Hypothesis: Richard assumes that a man in a leather jacket and glasses walks across an intersection while a man in a gray sweatshirt and white hat looks on.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James knows that Evelyn thinks that two workers in green uniforms are standing in an alleyway. Hypothesis: Evelyn thinks that two workers in green uniforms are standing in an alleyway.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn remembers that a woman crosses the street with a baby in her arms. Hypothesis: Evelyn remembers that a woman crosses the street carrying her baby.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James recognizes that Amelia thinks that this is a clown at an elementary school. Hypothesis: Amelia thinks that this is a clown at an elementary school.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn knows that Emma suspects that the young lady is giving the old man a hug. Hypothesis: Emma suspects that Evelyn knows that the young lady is giving the old man a hug.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John sees that Charles thinks that a wet black lab with a red collar is standing in the water. Hypothesis: Charles thinks that John sees that a wet black lab with a red collar is standing in the water.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that Olivia thinks that lady wearing brown jacket with brown boots and orange colored scarf is hearing music while sitting in the train. Hypothesis: Abigail assumes that lady wearing brown jacket with brown boots and orange colored scarf is hearing music while sitting in the train.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma assumes that Abigail thinks that a group of people watching a boy getting interviewed by a man. Hypothesis: Emma assumes that a group of people watching a boy getting interviewed by a man.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David thinks that Michael recognizes that three men are playing frisbee in the woods. Hypothesis: David thinks that three men are playing frisbee in the woods.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia recognizes that Emma suspects that fireworks light up the night as a man stands on stage. Hypothesis: Emma suspects that Sophia recognizes that fireworks light up the night as a man stands on stage.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn suspects that Richard believes that a tan dog plays with a white dog in a baby pool. Hypothesis: Evelyn suspects that a tan dog plays with a white dog in a baby pool.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas thinks that Olivia suspects that a young boy is jumping down an inflatable water ride. Hypothesis: Thomas thinks that a young boy is jumping down an inflatable water ride.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David knows that Thomas suspects that a group of women playing volleyball indoors. Hypothesis: Thomas suspects that a group of women playing volleyball indoors.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia understands that a woman with a black purse and a red coat is sitting on a pillar of concrete. Hypothesis: Joseph understands that there is one woman in this picture.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael assumes that John assumes that three men on mountain bikes go over a sand hill. Hypothesis: John assumes that three men on mountain bikes go over a sand hill.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor suspects that Michael remembers that a person is walking a bicycle down a city street. Hypothesis: Taylor suspects that a person is walking a bicycle down a city street.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte believes that Thomas sees that in front is a guy singing and playing guitar and a white shirted drummer in the back. Hypothesis: Thomas sees that in front is a guy singing and playing guitar and a white shirted drummer in the back.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James understands that a bundled up toddler is walking over snow. Hypothesis: James understands that a toddler is outside.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn assumes that Charlotte understands that a man in a pinstriped suit walks down the street and does n't notice the quirky poster on his left. Hypothesis: Evelyn assumes that a man in a pinstriped suit walks down the street and does n't notice the quirky poster on his left.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia recognizes that William suspects that a person strolling through an orange tinted woods with a dog. Hypothesis: William suspects that Sophia recognizes that a person strolling through an orange tinted woods with a dog.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte sees that Taylor assumes that three people on bikes are coming over a ridge, while a man in orange watches. Hypothesis: Taylor assumes that three people on bikes are coming over a ridge, while a man in orange watches.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William understands that lady in black skirt is getting excited. Hypothesis: William understands that a lady is excited.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles thinks that Abigail learns that a man is playing drums with a band. Hypothesis: Abigail learns that a man is playing drums with a band.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles believes that Taylor suspects that a woman in a yellow skirt is dancing with a man in a white shirt, with another couple dancing in the background. Hypothesis: Charles believes that a woman in a yellow skirt is dancing with a man in a white shirt, with another couple dancing in the background.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia thinks that Thomas learns that a young woman cooks a meal in a wok while conversing with another woman, as an illuminated shrine to Mr. T looks on. Hypothesis: Sophia thinks that a young woman cooks a meal in a wok while conversing with another woman, as an illuminated shrine to Mr. T looks on.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor knows that William suspects that a man with a gray beard and a little boy are sitting on the floor looking over some papers in a room with a bunk bed. Hypothesis: William suspects that a man with a gray beard and a little boy are sitting on the floor looking over some papers in a room with a bunk bed.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David knows that a man and a woman are holding hands on the shore of a lake. Hypothesis: Ava knows that a couple holds hands on the shore.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert suspects that three adults are working in a garden near a fence in the yard. Hypothesis: Robert suspects that the three adults are outside in the garden.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard understands that Ava thinks that a woman sits in a market where she sells goods with her dog. Hypothesis: Ava thinks that Richard understands that a woman sits in a market where she sells goods with her dog.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert assumes that Abigail sees that a child sits in a tree holding a branch. Hypothesis: Abigail sees that a child sits in a tree holding a branch.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James remembers that Sophia thinks that a boy in an all blue uniform kicks a blue soccer ball in a grassy area. Hypothesis: Sophia thinks that James remembers that a boy in an all blue uniform kicks a blue soccer ball in a grassy area.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David suspects that Evelyn suspects that a young woman is wearing a paper crown at an outdoor event. Hypothesis: David suspects that a young woman is wearing a paper crown at an outdoor event.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas recognizes that Richard believes that a soccer player in white kicks a ball as another soccer player lunges towards the ball and a third soccer player in red follows close by. Hypothesis: Richard believes that Thomas recognizes that a soccer player in white kicks a ball as another soccer player lunges towards the ball and a third soccer player in red follows close by.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail suspects that William learns that a young boy wearing a red shirt runs along a gravel road. Hypothesis: William learns that a young boy wearing a red shirt runs along a gravel road.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James sees that Olivia suspects that a lady wearing a blue dress and earrings, is sitting at a table with a napkin in her hand and her elbow on the table. Hypothesis: Olivia suspects that a lady wearing a blue dress and earrings, is sitting at a table with a napkin in her hand and her elbow on the table.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn sees that Thomas believes that a woman fell in the water after riding a wakeboard. Hypothesis: Thomas believes that Evelyn sees that a woman fell in the water after riding a wakeboard.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella knows that three people are sitting at a small table near a screen with the words, \"DEMOS, The Business of Care.\". Hypothesis: Isabella knows that a trio of humans is sitting.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte thinks that Richard recognizes that a boy is standing in a pool getting splashed with water. Hypothesis: Charlotte thinks that a boy is standing in a pool getting splashed with water.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William recognizes that a lady, dressed in a costume, is posing with an axe in the middle of the woods. Hypothesis: Michael recognizes that a lady with an axe is posing in the middle of the woods.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia suspects that Amelia sees that a person lies in a grassy area near a building. Hypothesis: Amelia sees that a person lies in a grassy area near a building.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael thinks that John recognizes that a woman and a baby are watching a boy play. Hypothesis: John recognizes that a woman and a baby are watching a boy play.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert suspects that Taylor knows that a woman with green body paint is holding a green and blue hula hoop while her friend (also in blue and green) watches. Hypothesis: Taylor knows that a woman with green body paint is holding a green and blue hula hoop while her friend (also in blue and green) watches.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas understands that a man holding a picture of a small dog is painting a small dog in near life size on a white canvas. Hypothesis: Thomas understands that a man holding a picture of a small dog is painting a small dog in near life size on a white canvas.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail thinks that James learns that little girl blows bubbles in a public square. Hypothesis: James learns that little girl blows bubbles in a public square.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava learns that William thinks that a soccer player wearing a red uniform walks off the field after a game near a parking lot. Hypothesis: William thinks that Ava learns that a soccer player wearing a red uniform walks off the field after a game near a parking lot.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph thinks that Evelyn remembers that a man in purple tie is singing. Hypothesis: Evelyn remembers that a man in purple tie is singing.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava suspects that Isabella believes that a man in a jacket is standing in a gas station, next to a car and lights are shining in the distance. Hypothesis: Ava suspects that a man in a jacket is standing in a gas station, next to a car and lights are shining in the distance.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that Ava thinks that an elderly woman with a tan nun uniform on and glasses is taking a picture with her camera. Hypothesis: Abigail assumes that an elderly woman with a tan nun uniform on and glasses is taking a picture with her camera.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David assumes that Sophia assumes that there is a woman in a white tank top and camouflage pants with a big black belt on a stage holding a microphone. Hypothesis: Sophia assumes that there is a woman in a white tank top and camouflage pants with a big black belt on a stage holding a microphone.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail believes that the man is throwing a toy to a brown and black dog in the park. Hypothesis: Joseph believes that a man and a dog are at a dog park.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma assumes that William suspects that several people wearing green shirts walk on the beach together. Hypothesis: Emma assumes that several people wearing green shirts walk on the beach together.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas assumes that Ava learns that two women and a man are sitting down eating and drinking various items. Hypothesis: Thomas assumes that two women and a man are sitting down eating and drinking various items.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James assumes that Joseph suspects that a young cowboy is riding bucking bronco in an arena. Hypothesis: Joseph suspects that a young cowboy is riding bucking bronco in an arena.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn believes that Richard learns that a woman teaching a ballet class composed of small children holding colourful scarves. Hypothesis: Evelyn believes that a woman teaching a ballet class composed of small children holding colourful scarves.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles suspects that Abigail learns that a man and a woman are laughing. Hypothesis: Abigail learns that a man and a woman are laughing.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph thinks that Evelyn remembers that a man in purple tie is singing. Hypothesis: Evelyn remembers that a man in purple tie is singing.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava thinks that Charlotte understands that a lady is walking out of a short tunnel as a male prepares to enter it from the opposite side. Hypothesis: Charlotte understands that a lady is walking out of a short tunnel as a male prepares to enter it from the opposite side.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia knows that Ava assumes that a man is tossing a knife in the air while another man stands nearby. Hypothesis: Ava assumes that a man is tossing a knife in the air while another man stands nearby.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella thinks that a little girl has her arms around a little boy standing on a wooden bridge in the woods. Hypothesis: Isabella thinks that the children hug in the woods.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma sees that David suspects that the people await to cross the street while walking the dog. Hypothesis: David suspects that Emma sees that the people await to cross the street while walking the dog.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas understands that An indian man walks past a temple on his way to pray. Hypothesis: Thomas learns that it is not the case that An indian man walks past a temple on his way to pray.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava does not suspect that Two little kids laugh on a blue swing. Hypothesis: Ava understands that they do not suspect that Two little kids laugh on a blue swing.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert remembers that A street filled with people walking and riding bikes. Hypothesis: Robert understands that they remember that A street filled with people walking and riding bikes.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles sees that A model is standing next too a blue jeep. Hypothesis: Charles believes that they see that A model is standing next too a blue jeep.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail assumes that A man wearing a baseball hate is checking his phone Hypothesis: Abigail assumes that they recognizes that A man wearing a baseball hate is checking his phone", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor assumes that This young girl's eyes are filled with excitement as she swings in her bright yellow dress.. Hypothesis: Taylor does not assumes that it is not that case that This young girl's eyes are filled with excitement as she swings in her bright yellow dress.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James assumes that An Asian man attempting to repair a green bicycle outdoors while two other Asian men stand by. Hypothesis: James assumes that they sees that An Asian man attempting to repair a green bicycle outdoors while two other Asian men stand by.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James believes that A boy poses in karate form and uniform. Hypothesis: James believes that they knows that A boy poses in karate form and uniform.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David does not assume that a dog carries a large stick through the field. Hypothesis: David recognizes that they do not assume that a dog carries a large stick through the field.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia suspects that A man running a marathon talks to his friend.. Hypothesis: Amelia does not suspects that it is not that case that A man running a marathon talks to his friend.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia assumes that A young girl kisses a ring-bearing boy at a wedding. Hypothesis: Sophia recognizes that it is not the case that A young girl kisses a ring-bearing boy at a wedding.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles does not think that A woman standing on one hand in an empty pool. Hypothesis: Charles knows that they do not think that A woman standing on one hand in an empty pool.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn sees that Two men are listening to music through headphones. Hypothesis: Evelyn understands that they see that Two men are listening to music through headphones.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma remembers that A little girl sitting in a small body of water, with sand and beach toys surrounding her. Hypothesis: Emma thinks that they remember that A little girl sitting in a small body of water, with sand and beach toys surrounding her.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn believes that A man and a woman standing on a sidewalk in between buildings. Hypothesis: Evelyn believes that they knows that A man and a woman standing on a sidewalk in between buildings.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert suspects that A dog chasing a deer in a field with yellow flowers. Hypothesis: Robert suspects that they remembers that A dog chasing a deer in a field with yellow flowers.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava learns that A guy on a skateboard, jumping off some steps. Hypothesis: Ava thinks that it is not the case that A guy on a skateboard, jumping off some steps.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph does not believe that Two dogs sit in front of a man dressed in native American attire. Hypothesis: Joseph understands that they do not believe that Two dogs sit in front of a man dressed in native American attire.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard thinks that A man in a gray long-sleeved shirt is making a transaction with another person from his street market. Hypothesis: Richard recognizes that they think that A man in a gray long-sleeved shirt is making a transaction with another person from his street market.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles suspects that Multiple people starting to pack their parachutes after a successful skydive.. Hypothesis: Charles does not suspects that it is not that case that Multiple people starting to pack their parachutes after a successful skydive.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava assumes that Woman dressed in red holding two fans, one red and one black. Hypothesis: Ava assumes that they knows that Woman dressed in red holding two fans, one red and one black.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard does not suspect that An older and younger man smiling. Hypothesis: Richard believes that they do not suspect that An older and younger man smiling.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James thinks that Four girls in shorts walk down the street. Hypothesis: James learns that it is not the case that Four girls in shorts walk down the street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas does not suspect that A gray-haired woman wearing tan pants, a yellow and white jacket and sunglasses is sitting on a bench. Hypothesis: Thomas knows that they do not suspect that A gray-haired woman wearing tan pants, a yellow and white jacket and sunglasses is sitting on a bench.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles suspects that Two men, one wearing a white hockey jersey and the other a red hockey jersey, playing hockey on an ice rink.. Hypothesis: Charles does not suspects that it is not that case that Two men, one wearing a white hockey jersey and the other a red hockey jersey, playing hockey on an ice rink.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia remembers that A man is roller-skating down the wall next to some white steps. Hypothesis: Sophia thinks that it is not the case that A man is roller-skating down the wall next to some white steps.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail does not suspect that A man with a cowboy hat green plaid shirt, jeans, and red boots and chaps rides a bay horse next to a young boy with a cowboy hat and blue shirt, jeans and chaps rides a pony next to him. Hypothesis: Abigail knows that they do not suspect that A man with a cowboy hat green plaid shirt, jeans, and red boots and chaps rides a bay horse next to a young boy with a cowboy hat and blue shirt, jeans and chaps rides a pony next to him.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia assumes that A man in a restaurant having lunch. Hypothesis: Olivia assumes that they understands that A man in a restaurant having lunch.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James assumes that A couple are having lunch together. Hypothesis: James sees that it is not the case that A couple are having lunch together.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail assumes that Racers are just beginning a race in an international competition. Hypothesis: Abigail assumes that they recognizes that Racers are just beginning a race in an international competition.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert suspects that A lone, 2-3 year old blond child in a blue jacket is putting a small black plastic item in his mouth as he kneels on a waiting room couch pointed toward the back while looking at something or someone not in the room.. Hypothesis: Robert does not suspects that it is not that case that A lone, 2-3 year old blond child in a blue jacket is putting a small black plastic item in his mouth as he kneels on a waiting room couch pointed toward the back while looking at something or someone not in the room.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor suspects that A woman, wearing a white shirt and green shorts, sitting on a rock in a beautiful body of water.. Hypothesis: Taylor does not suspects that it is not that case that A woman, wearing a white shirt and green shorts, sitting on a rock in a beautiful body of water.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte assumes that Two people are sitting in a station. Hypothesis: Charlotte assumes that they learns that Two people are sitting in a station.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William thinks that A man walking in front of a black cement wall with a bag on his shoulder. Hypothesis: William knows that they think that A man walking in front of a black cement wall with a bag on his shoulder.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia thinks that This man is trying to make his wife laugh by blowing bubbles in the bathtub.. Hypothesis: Sophia does not thinks that it is not that case that This man is trying to make his wife laugh by blowing bubbles in the bathtub.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail suspects that A man holding a large swordfish.. Hypothesis: Abigail does not suspects that it is not that case that A man holding a large swordfish.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia remembers that A man is roller-skating down the wall next to some white steps. Hypothesis: Sophia thinks that it is not the case that A man is roller-skating down the wall next to some white steps.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William sees that A girl is sitting in a chair blowing up a large yellow party balloon. Hypothesis: William understands that they see that A girl is sitting in a chair blowing up a large yellow party balloon.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph sees that A woman with a purple purse sits on the metro with her suitcase. Hypothesis: Joseph recognizes that they see that A woman with a purple purse sits on the metro with her suitcase.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John understands that An elderly man is looking through his glasses while working with hot metal. Hypothesis: John assumes that it is not the case that An elderly man is looking through his glasses while working with hot metal.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that A girl is getting ready to dive into a pool.. Hypothesis: Robert does not believes that it is not that case that A girl is getting ready to dive into a pool.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael does not believe that An Asian man in a t-shirt and sandals is smoking a pipe while sitting on a rock in front of a body of water. Hypothesis: Michael knows that they do not believe that An Asian man in a t-shirt and sandals is smoking a pipe while sitting on a rock in front of a body of water.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma does not think that A woman is pulling a child on a sled in the snow. Hypothesis: Emma recognizes that they do not think that A woman is pulling a child on a sled in the snow.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn believes that Two young boys have a conversation with one and other.. Hypothesis: Evelyn does not believes that it is not that case that Two young boys have a conversation with one and other.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas suspects that A black dog runs along the green grass carrying a toy in its mouth. Hypothesis: Thomas suspects that they understands that A black dog runs along the green grass carrying a toy in its mouth.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard assumes that A man holding a sleeping child walks with a woman. Hypothesis: Richard assumes that they recognizes that A man holding a sleeping child walks with a woman.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John believes that A woman wearing a vertical striped top, sitting on a bench beside a telephone booth in a train station. Hypothesis: John believes that they learns that A woman wearing a vertical striped top, sitting on a bench beside a telephone booth in a train station.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John does not think that Man with mustache plays violin. Hypothesis: John knows that they do not think that Man with mustache plays violin.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor sees that Man wearing dark clothes walks down a street with a wall of graffiti to his left. Hypothesis: Taylor learns that it is not the case that Man wearing dark clothes walks down a street with a wall of graffiti to his left.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella does not think that His back facing us, a young man photographs a lovely mountain lake scene under a hazy sky. Hypothesis: Isabella recognizes that they do not think that His back facing us, a young man photographs a lovely mountain lake scene under a hazy sky.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella understands that The woman is holding up the line with the fish that she caught in the lake with her bamboo fishing pole. Hypothesis: Isabella suspects that it is not the case that The woman is holding up the line with the fish that she caught in the lake with her bamboo fishing pole.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia does not assume that A woman in a jacket and scarf looking a table that a man in a black shirt is cooking something on. Hypothesis: Sophia believes that they do not assume that A woman in a jacket and scarf looking a table that a man in a black shirt is cooking something on.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William suspects that Two young men in unusual clothing are jumping in a gym.. Hypothesis: William does not suspects that it is not that case that Two young men in unusual clothing are jumping in a gym.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor does not suspect that Three girls are sitting at desks and appear to be working intently. Hypothesis: Taylor believes that they do not suspect that Three girls are sitting at desks and appear to be working intently.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor assumes that This young girl's eyes are filled with excitement as she swings in her bright yellow dress.. Hypothesis: Taylor does not assumes that it is not that case that This young girl's eyes are filled with excitement as she swings in her bright yellow dress.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia suspects that A man in swimming trunks kicking a ball at the beach.. Hypothesis: Amelia does not suspects that it is not that case that A man in swimming trunks kicking a ball at the beach.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles does not assume that A boy in s striped shirt is jumping in front of a water fountain. Hypothesis: Charles thinks that they do not assume that A boy in s striped shirt is jumping in front of a water fountain.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia thinks that A man rock climbs with a city and body of water in the background. Hypothesis: Amelia thinks that they think that A man rock climbs with a city and body of water in the background.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael remembers that A lady dances in a polka dot dress and a head of flowers with a fan clasped in her hand while others are looking in a different direction with two men holding onto a ladder and others discussing. Hypothesis: Michael believes that they remember that A lady dances in a polka dot dress and a head of flowers with a fan clasped in her hand while others are looking in a different direction with two men holding onto a ladder and others discussing.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella sees that A woman is talking on the phone while standing next to a dog. Hypothesis: Isabella learns that it is not the case that A woman is talking on the phone while standing next to a dog.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John thinks that Two children feeding horses through a fence. Hypothesis: John thinks that they knows that Two children feeding horses through a fence.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor suspects that A child is looking at some colorful dresses. Hypothesis: Taylor assumes that it is not the case that A child is looking at some colorful dresses.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David suspects that A young man in black and white striped shirt rests on the grass while traffic passes nearby on the road. Hypothesis: David suspects that they knows that A young man in black and white striped shirt rests on the grass while traffic passes nearby on the road.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava does not think that Two construction workers in a truck having a conversation. Hypothesis: Ava understands that they do not think that Two construction workers in a truck having a conversation.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma assumes that Two men pull a fishing net up into their red boat.. Hypothesis: Emma does not assumes that it is not that case that Two men pull a fishing net up into their red boat.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella does not think that His back facing us, a young man photographs a lovely mountain lake scene under a hazy sky. Hypothesis: Isabella recognizes that they do not think that His back facing us, a young man photographs a lovely mountain lake scene under a hazy sky.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David assumes that a tan dog jumping over a red and blue toy Hypothesis: David assumes that they sees that a tan dog jumping over a red and blue toy", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor believes that Children use crayons to color sheets of paper. Hypothesis: Taylor assumes that it is not the case that Children use crayons to color sheets of paper.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava recognizes that A young woman dressed as a princess is waving to others from inside a ride where the carriage is a large replica of the Disney character, Dumbo. Hypothesis: Ava sees that it is not the case that A young woman dressed as a princess is waving to others from inside a ride where the carriage is a large replica of the Disney character, Dumbo.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David does not think that People mingling in the foreground and background, two of them are walking towards those in the background that are positioned nearby of a building that is overshadowed by a large number of trees, while the two in the foreground are tending to a horse drawn carriage. Hypothesis: David thinks that they do not think that People mingling in the foreground and background, two of them are walking towards those in the background that are positioned nearby of a building that is overshadowed by a large number of trees, while the two in the foreground are tending to a horse drawn carriage.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail understands that Two women on the dance floor with other people dancing. Hypothesis: Abigail understands that they understand that Two women on the dance floor with other people dancing.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia recognizes that Greyhounds race on a sandy track with the dog in green taking the lead. Hypothesis: Sophia believes that they recognize that Greyhounds race on a sandy track with the dog in green taking the lead.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia does not think that A person in a blue and yellow snowsuit is snowboarding and snow is coming up in the air around the board. Hypothesis: Olivia understands that they do not think that A person in a blue and yellow snowsuit is snowboarding and snow is coming up in the air around the board.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte knows that A man is on the side of a mountain and hiking around huge rocks. Hypothesis: Charlotte thinks that they know that A man is on the side of a mountain and hiking around huge rocks.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles learns that Two grownups are waiting for the bus to arrive on a cold day. Hypothesis: Charles learns that it is not the case that Two grownups are waiting for the bus to arrive on a cold day.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia assumes that Three different women having fun with a toy in the living-room. Hypothesis: Sophia suspects that it is not the case that Three different women having fun with a toy in the living-room.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael remembers that A man is walking away from tents with the word Camden on them. Hypothesis: Michael believes that they remember that A man is walking away from tents with the word Camden on them.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn recognizes that A man and a woman in blue jog on the sidewalk while a man stretches on a park bench. Hypothesis: Evelyn knows that they recognize that A man and a woman in blue jog on the sidewalk while a man stretches on a park bench.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia suspects that Football players square off before a play.. Hypothesis: Sophia does not suspects that it is not that case that Football players square off before a play.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William assumes that A man lying on the ground as vehicles pass by on the road.. Hypothesis: William does not assumes that it is not that case that A man lying on the ground as vehicles pass by on the road.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James suspects that A female sings and plays into a microphone and a male in green striped shorts plays a hand drum Hypothesis: James suspects that they sees that A female sings and plays into a microphone and a male in green striped shorts plays a hand drum", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte does not think that A man in a gray sweatshirt and blue jeans is pulling on a rope while a guy in a white shirt and black jeans watches him. Hypothesis: Charlotte recognizes that they do not think that A man in a gray sweatshirt and blue jeans is pulling on a rope while a guy in a white shirt and black jeans watches him.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn suspects that The girl in yellow shorts and white jacket has a tennis ball in her left pocket. Hypothesis: Evelyn suspects that they learns that The girl in yellow shorts and white jacket has a tennis ball in her left pocket.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William does not assume that Two people wearing winter clothes stand near a pole in a winter scene. Hypothesis: William understands that they do not assume that Two people wearing winter clothes stand near a pole in a winter scene.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia believes that A bearded man wearing a blue shirt is playing an acoustic guitar. Hypothesis: Amelia believes that they learns that A bearded man wearing a blue shirt is playing an acoustic guitar.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John does not think that Man with mustache plays violin. Hypothesis: John knows that they do not think that Man with mustache plays violin.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia sees that A man in a white shirt riding a bike down the pavement. Hypothesis: Olivia recognizes that they see that A man in a white shirt riding a bike down the pavement.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte assumes that A man takes a nap on the sidewalk in a busy city.. Hypothesis: Charlotte does not assumes that it is not that case that A man takes a nap on the sidewalk in a busy city.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard does not suspect that A mother peacefully works on making a beautiful and colorful mat while her son admires her skills. Hypothesis: Richard believes that they do not suspect that A mother peacefully works on making a beautiful and colorful mat while her son admires her skills.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail thinks that Three young boys one is holding a camera and another is holding a green toy all are wearing t-shirt and smiling. Hypothesis: Abigail thinks that they understands that Three young boys one is holding a camera and another is holding a green toy all are wearing t-shirt and smiling.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia does not believe that A child does a handstand in a pool. Hypothesis: Olivia knows that they do not believe that A child does a handstand in a pool.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn believes that An African American wearing a red backpack looks the photographer as he walks past a concrete wall covered in graffiti.. Hypothesis: Evelyn does not believes that it is not that case that An African American wearing a red backpack looks the photographer as he walks past a concrete wall covered in graffiti.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn believes that A man and a woman standing on a sidewalk in between buildings. Hypothesis: Evelyn believes that they knows that A man and a woman standing on a sidewalk in between buildings.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William believes that Four men riding in a gray, fast moving boat appear to be wearing vests. Hypothesis: William recognizes that it is not the case that Four men riding in a gray, fast moving boat appear to be wearing vests.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William believes that A group of girls ride an ATV. Hypothesis: William thinks that it is not the case that A group of girls ride an ATV.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John assumes that Four people with shopping carts full of bags.. Hypothesis: John does not assumes that it is not that case that Four people with shopping carts full of bags.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma suspects that People and cars are on a parking lot surrounded by multiple building, one of which has the word PROLOGy above it. Hypothesis: Emma understands that they suspect that People and cars are on a parking lot surrounded by multiple building, one of which has the word PROLOGy above it.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail thinks that A group of constructions workers lifting a bathtub.. Hypothesis: Abigail does not thinks that it is not that case that A group of constructions workers lifting a bathtub.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella does not think that His back facing us, a young man photographs a lovely mountain lake scene under a hazy sky. Hypothesis: Isabella recognizes that they do not think that His back facing us, a young man photographs a lovely mountain lake scene under a hazy sky.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph assumes that An Asian woman stands along a road where 2 buses have passed holding her bags. Hypothesis: Joseph believes that it is not the case that An Asian woman stands along a road where 2 buses have passed holding her bags.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn recognizes that A man and a woman in blue jog on the sidewalk while a man stretches on a park bench. Hypothesis: Evelyn knows that they recognize that A man and a woman in blue jog on the sidewalk while a man stretches on a park bench.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard assumes that A dog plays with a ball at the beach. Hypothesis: Richard assumes that they recognizes that A dog plays with a ball at the beach.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte assumes that Two women dressed for cold weather in jackets and gloves look at something on a cellphone screen. Hypothesis: Charlotte assumes that they remembers that Two women dressed for cold weather in jackets and gloves look at something on a cellphone screen.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William suspects that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes. Hypothesis: William suspects that they knows that Two men and three women are sitting at a rectangular wooden table drinking beer from glasses of various shapes.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor does not believe that The tiny girl dressed in a butterfly ballet costume, waves her wand near a nutcracker statue. Hypothesis: Taylor understands that they do not believe that The tiny girl dressed in a butterfly ballet costume, waves her wand near a nutcracker statue.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles believes that A man in a bear suit, holding the head of the costume in his hand, stands at the back of a crowd. Hypothesis: Charles assumes that it is not the case that A man in a bear suit, holding the head of the costume in his hand, stands at the back of a crowd.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor thinks that A woman sitting eating a sandwich. Hypothesis: Taylor thinks that they understands that A woman sitting eating a sandwich.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William understands that A long-haired brown and white dog carries a snowball in his mouth. Hypothesis: William recognizes that they understand that A long-haired brown and white dog carries a snowball in his mouth.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia does not suspect that On a sunny day, in a lush, green field, one small girl inspects a rock while her friend goes off in another direction. Hypothesis: Olivia knows that they do not suspect that On a sunny day, in a lush, green field, one small girl inspects a rock while her friend goes off in another direction.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles does not assume that A boy in s striped shirt is jumping in front of a water fountain. Hypothesis: Charles thinks that they do not assume that A boy in s striped shirt is jumping in front of a water fountain.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma thinks that A man in black pants and a white shirt is walking down the sidewalk in front of a building that has graffiti on it. Hypothesis: Emma thinks that they knows that A man in black pants and a white shirt is walking down the sidewalk in front of a building that has graffiti on it.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Isabella assumes that A snowboarder in a white coat in the air after a jump. Hypothesis: Isabella believes that it is not the case that A snowboarder in a white coat in the air after a jump.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava does not believe that A group of six people, men and women, hold up a pole in the middle of a forest while another woman monitors this action. Hypothesis: Ava recognizes that they do not believe that A group of six people, men and women, hold up a pole in the middle of a forest while another woman monitors this action.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert thinks that a man with a tattoo on his arm cooking something in a frying pan.. Hypothesis: Robert does not thinks that it is not that case that a man with a tattoo on his arm cooking something in a frying pan.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David does not suspect that A girl standing by a decorated structural beam poses for a picture. Hypothesis: David understands that they do not suspect that A girl standing by a decorated structural beam poses for a picture.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James suspects that A girl in a green knit cap stands ready to push a sled, with a little boy behind her. Hypothesis: James assumes that it is not the case that A girl in a green knit cap stands ready to push a sled, with a little boy behind her.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph thinks that A bulldog is running through a grassy park while people stand in the background. Hypothesis: Joseph recognizes that they think that A bulldog is running through a grassy park while people stand in the background.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John does not believe that A race car sits in the pits. Hypothesis: John thinks that they do not believe that A race car sits in the pits.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas thinks that A little boy is eating a red Popsicle. Hypothesis: Thomas thinks that they recognizes that A little boy is eating a red Popsicle.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles suspects that A man in a black hoodie watching a man in a red cap. Hypothesis: Charles understands that it is not the case that A man in a black hoodie watching a man in a red cap.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael suspects that Man on cellphone walking in front of silver car next to green grass.. Hypothesis: Michael does not suspects that it is not that case that Man on cellphone walking in front of silver car next to green grass.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard does not believe that two people in a rowboat in a river. Hypothesis: Richard thinks that they do not believe that two people in a rowboat in a river.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph remembers that Many people are in a cafeteria or restaurant, there are two workers wearing white and black who are taking their orders. Hypothesis: Joseph understands that they remember that Many people are in a cafeteria or restaurant, there are two workers wearing white and black who are taking their orders.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava learns that A guy on a skateboard, jumping off some steps. Hypothesis: Ava thinks that it is not the case that A guy on a skateboard, jumping off some steps.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia assumes that Cheerleader on top of a cheerleading pyramid, girls are looking up at her one is in the background doing the same cheer.. Hypothesis: Amelia does not assumes that it is not that case that Cheerleader on top of a cheerleading pyramid, girls are looking up at her one is in the background doing the same cheer.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia believes that A bearded man wearing a blue shirt is playing an acoustic guitar. Hypothesis: Amelia believes that they learns that A bearded man wearing a blue shirt is playing an acoustic guitar.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James learns that Woman wearing a white donkey costume while talking to a man. Hypothesis: James suspects that it is not the case that Woman wearing a white donkey costume while talking to a man.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia thinks that People sit around tables watching intently under a cloth covering. Hypothesis: Olivia recognizes that they think that People sit around tables watching intently under a cloth covering.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia assumes that Two men exchange conversation in a crowded place.. Hypothesis: Olivia does not assumes that it is not that case that Two men exchange conversation in a crowded place.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles sees that A model is standing next too a blue jeep. Hypothesis: Charles believes that they see that A model is standing next too a blue jeep.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella believes that A man in a white shirt waves his hand under a white and blue umbrella. Hypothesis: Isabella recognizes that they believe that A man in a white shirt waves his hand under a white and blue umbrella.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella assumes that The man and the lady are wearing glasses and sitting in red chairs talking to John McCain. Hypothesis: Isabella assumes that they learns that The man and the lady are wearing glasses and sitting in red chairs talking to John McCain.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert recognizes that A man sitting up taking a nap on a park bench with an open umbrella protecting him from the sun. Hypothesis: Robert recognizes that they recognize that A man sitting up taking a nap on a park bench with an open umbrella protecting him from the sun.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John thinks that Woman wearing jeans and white shirt watches as her bowling ball rolls down the lane to the pins.. Hypothesis: John does not thinks that it is not that case that Woman wearing jeans and white shirt watches as her bowling ball rolls down the lane to the pins.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David does not believe that Five men are standing in front of a red curtain. Hypothesis: David knows that they do not believe that Five men are standing in front of a red curtain.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John thinks that A woman in a dark blue, and white sweater, walks with her son, down a street. Hypothesis: John suspects that it is not the case that A woman in a dark blue, and white sweater, walks with her son, down a street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn suspects that A young woman in a green \"Aeropostale\" shirt and a green bracelet with a black purse, looking down with pursed lips. Hypothesis: Evelyn believes that they suspect that A young woman in a green \"Aeropostale\" shirt and a green bracelet with a black purse, looking down with pursed lips.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John thinks that Two children feeding horses through a fence. Hypothesis: John thinks that they knows that Two children feeding horses through a fence.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte thinks that A man is laying down on grass near trees and a hose.. Hypothesis: Charlotte does not thinks that it is not that case that A man is laying down on grass near trees and a hose.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles assumes that The lady wearing a red coat is giving a speech.. Hypothesis: Charles does not assumes that it is not that case that The lady wearing a red coat is giving a speech.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma suspects that I think this lady is waiting for a cab.. Hypothesis: Emma does not suspects that it is not that case that I think this lady is waiting for a cab.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor does not suspect that A woman with a beautiful dress and matching umbrella is walking down the street carrying a purse on her arm. Hypothesis: Taylor understands that they do not suspect that A woman with a beautiful dress and matching umbrella is walking down the street carrying a purse on her arm.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael suspects that One man in all black in a bowling ally who just bowled with an orange ball.. Hypothesis: Michael does not suspects that it is not that case that One man in all black in a bowling ally who just bowled with an orange ball.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John assumes that A woman wearing a hat and a man covering his eyes sit on benches on a boat.. Hypothesis: John does not assumes that it is not that case that A woman wearing a hat and a man covering his eyes sit on benches on a boat.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia suspects that A soldier is handing a picture to a woman holding a Donald Duck bag. Hypothesis: Sophia recognizes that it is not the case that A soldier is handing a picture to a woman holding a Donald Duck bag.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John sees that A group of Scottish officers doing a demonstration. Hypothesis: John recognizes that they see that A group of Scottish officers doing a demonstration.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella assumes that A snowboarder in a white coat in the air after a jump. Hypothesis: Isabella believes that it is not the case that A snowboarder in a white coat in the air after a jump.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte assumes that A man takes a nap on the sidewalk in a busy city.. Hypothesis: Charlotte does not assumes that it is not that case that A man takes a nap on the sidewalk in a busy city.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William remembers that An army officer is reading a children's book from a podium. Hypothesis: William knows that they remember that An army officer is reading a children's book from a podium.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn assumes that This lady had a lot of freckles. Hypothesis: Evelyn assumes that they remembers that This lady had a lot of freckles.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn does not believe that People laying in massage chairs Hypothesis: Evelyn understands that they do not believe that People laying in massage chairs", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John assumes that Several people stopped by the side of the road are watching what is happening in the woods. Hypothesis: John thinks that they assume that Several people stopped by the side of the road are watching what is happening in the woods.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William does not believe that Three girls are standing together in a room, one is listening, one is writing on a wall and the third is talking to them. Hypothesis: William thinks that they do not believe that Three girls are standing together in a room, one is listening, one is writing on a wall and the third is talking to them.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas sees that A man wearing a brown shirt and green pans is pulling a rickshaw down a street Hypothesis: Thomas knows that they see that A man wearing a brown shirt and green pans is pulling a rickshaw down a street", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William understands that A long-haired brown and white dog carries a snowball in his mouth. Hypothesis: William recognizes that they understand that A long-haired brown and white dog carries a snowball in his mouth.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: David understands that An Asian man in a black robe is holding up a small fan by a bush with smoke coming out of it. Hypothesis: David suspects that it is not the case that An Asian man in a black robe is holding up a small fan by a bush with smoke coming out of it.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia believes that Two men in uniform hold up sign with young children. Hypothesis: Amelia recognizes that they believe that Two men in uniform hold up sign with young children.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James thinks that two wrestlers wrestling, the one on the bottom is in submission and could possibly be in pain.. Hypothesis: James does not thinks that it is not that case that two wrestlers wrestling, the one on the bottom is in submission and could possibly be in pain.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn thinks that Three teenagers, two without shoes having a water gun fight with various types of guns trying to spray each other. Hypothesis: Evelyn thinks that they understands that Three teenagers, two without shoes having a water gun fight with various types of guns trying to spray each other.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte knows that A man is on the side of a mountain and hiking around huge rocks. Hypothesis: Charlotte thinks that they know that A man is on the side of a mountain and hiking around huge rocks.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Thomas sees that A man wearing a brown shirt and green pans is pulling a rickshaw down a street Hypothesis: Thomas knows that they see that A man wearing a brown shirt and green pans is pulling a rickshaw down a street", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma remembers that A little girl sitting in a small body of water, with sand and beach toys surrounding her. Hypothesis: Emma thinks that they remember that A little girl sitting in a small body of water, with sand and beach toys surrounding her.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Ava does not suspect that A man is standing on a rooftop looking at his camera. Hypothesis: Ava recognizes that they do not suspect that A man is standing on a rooftop looking at his camera.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles suspects that Multiple people starting to pack their parachutes after a successful skydive.. Hypothesis: Charles does not suspects that it is not that case that Multiple people starting to pack their parachutes after a successful skydive.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail remembers that A man and a woman seated at a table, having drinks and deep in conversation. Hypothesis: Abigail learns that it is not the case that A man and a woman seated at a table, having drinks and deep in conversation.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph understands that Two boys laying tile in a bathroom. Hypothesis: Joseph understands that they understand that Two boys laying tile in a bathroom.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte believes that A woman, viewed through a window, sits at a restaurant table and puts down a red shopping bag. Hypothesis: Charlotte remembers that it is not the case that A woman, viewed through a window, sits at a restaurant table and puts down a red shopping bag.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John assumes that A woman wearing a hat and a man covering his eyes sit on benches on a boat.. Hypothesis: John does not assumes that it is not that case that A woman wearing a hat and a man covering his eyes sit on benches on a boat.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia assumes that A man in a restaurant having lunch. Hypothesis: Olivia assumes that they understands that A man in a restaurant having lunch.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia does not think that One kid is running across a field carrying a football while another is close behind grabbing for his flags. Hypothesis: Amelia thinks that they do not think that One kid is running across a field carrying a football while another is close behind grabbing for his flags.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Amelia suspects that A man running a marathon talks to his friend.. Hypothesis: Amelia does not suspects that it is not that case that A man running a marathon talks to his friend.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn does not assume that A man and a woman are talking in a park Hypothesis: Evelyn thinks that they do not assume that A man and a woman are talking in a park", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph assumes that A super car is spinning tires on a raceway track creating smoke near a crowd. Hypothesis: Joseph assumes that they sees that A super car is spinning tires on a raceway track creating smoke near a crowd.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William knows that A man selling donuts to a customer during a world exhibition event held in the city of Angeles Hypothesis: William believes that it is not the case that A man selling donuts to a customer during a world exhibition event held in the city of Angeles", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas suspects that A black dog runs along the green grass carrying a toy in its mouth. Hypothesis: Thomas suspects that they understands that A black dog runs along the green grass carrying a toy in its mouth.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia thinks that A band performing on the corner of the street. Hypothesis: Sophia thinks that they recognizes that A band performing on the corner of the street.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David does not think that A cowboy struggling to maintain control on a horse at a rodeo. Hypothesis: David thinks that they do not think that A cowboy struggling to maintain control on a horse at a rodeo.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Joseph does not assume that A mother pushing a stroller and holding the hand of a toddler. Hypothesis: Joseph knows that they do not assume that A mother pushing a stroller and holding the hand of a toddler.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte suspects that Very large group of old people riding in boats down a river. Hypothesis: Charlotte recognizes that it is not the case that Very large group of old people riding in boats down a river.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas remembers that Three children in swimsuites are having fun outside near a white building. Hypothesis: Thomas recognizes that it is not the case that Three children in swimsuites are having fun outside near a white building.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: David does not assume that Two woman talk in the middle of a parking lot, near two cars, as random people wander nearby. Hypothesis: David believes that they do not assume that Two woman talk in the middle of a parking lot, near two cars, as random people wander nearby.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard does not suspect that There are a lot of people in front of a tan building with colorful squares hanging from the top. Hypothesis: Richard understands that they do not suspect that There are a lot of people in front of a tan building with colorful squares hanging from the top.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James thinks that A woman and three children. Hypothesis: James thinks that they knows that A woman and three children.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte assumes that A couple is a standing together the woman is adjusting a flower on the man's lapel and they are dressed in wedding apparel. Hypothesis: Charlotte assumes that they sees that A couple is a standing together the woman is adjusting a flower on the man's lapel and they are dressed in wedding apparel.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph assumes that A super car is spinning tires on a raceway track creating smoke near a crowd. Hypothesis: Joseph assumes that they sees that A super car is spinning tires on a raceway track creating smoke near a crowd.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn believes that An African American wearing a red backpack looks the photographer as he walks past a concrete wall covered in graffiti.. Hypothesis: Evelyn does not believes that it is not that case that An African American wearing a red backpack looks the photographer as he walks past a concrete wall covered in graffiti.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: John understands that An elderly man is looking through his glasses while working with hot metal. Hypothesis: John assumes that it is not the case that An elderly man is looking through his glasses while working with hot metal.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charlotte thinks that A man is laying down on grass near trees and a hose.. Hypothesis: Charlotte does not thinks that it is not that case that A man is laying down on grass near trees and a hose.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte does not think that A man in a gray sweatshirt and blue jeans is pulling on a rope while a guy in a white shirt and black jeans watches him. Hypothesis: Charlotte recognizes that they do not think that A man in a gray sweatshirt and blue jeans is pulling on a rope while a guy in a white shirt and black jeans watches him.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn suspects that Two women in bathing suits climb rock piles by the ocean.. Hypothesis: Evelyn does not suspects that it is not that case that Two women in bathing suits climb rock piles by the ocean.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael thinks that The quarterback of the UTEP football team is about to be tackled by a member of the Wisconsin defensive team. Hypothesis: Michael thinks that they remembers that The quarterback of the UTEP football team is about to be tackled by a member of the Wisconsin defensive team.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles sees that A young boy plays in the sprinklers, allowing the water to spray completely over his right arm. Hypothesis: Charles suspects that it is not the case that A young boy plays in the sprinklers, allowing the water to spray completely over his right arm.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles assumes that A young woman with red hear and wearing a bikini top is standing with her hands together above her head, while three other people stand directly behind her with their arms in different positions, making the woman in front look as if she has many arms. Hypothesis: Charles recognizes that they assume that A young woman with red hear and wearing a bikini top is standing with her hands together above her head, while three other people stand directly behind her with their arms in different positions, making the woman in front look as if she has many arms.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert assumes that A man in a long-sleeved blue shirt and blue jeans has set up some name trains on the ground looking to sell his wares. Hypothesis: Robert assumes that they remembers that A man in a long-sleeved blue shirt and blue jeans has set up some name trains on the ground looking to sell his wares.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James assumes that A couple are having lunch together. Hypothesis: James sees that it is not the case that A couple are having lunch together.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn does not believe that People laying in massage chairs Hypothesis: Evelyn understands that they do not believe that People laying in massage chairs", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard learns that girl sitting in fire for a show Hypothesis: Richard assumes that it is not the case that girl sitting in fire for a show", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James assumes that An Asian man attempting to repair a green bicycle outdoors while two other Asian men stand by. Hypothesis: James assumes that they sees that An Asian man attempting to repair a green bicycle outdoors while two other Asian men stand by.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor does not suspect that A woman with a beautiful dress and matching umbrella is walking down the street carrying a purse on her arm. Hypothesis: Taylor understands that they do not suspect that A woman with a beautiful dress and matching umbrella is walking down the street carrying a purse on her arm.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella believes that women wearing black tank top cutting another woman's shirt while riding a bus. Hypothesis: Isabella believes that they sees that women wearing black tank top cutting another woman's shirt while riding a bus.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Evelyn suspects that The girl in yellow shorts and white jacket has a tennis ball in her left pocket. Hypothesis: Evelyn suspects that they learns that The girl in yellow shorts and white jacket has a tennis ball in her left pocket.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Emma assumes that A man is performing tricks with his superbike. Hypothesis: Emma thinks that it is not the case that A man is performing tricks with his superbike.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Sophia does not assume that A woman in a jacket and scarf looking a table that a man in a black shirt is cooking something on. Hypothesis: Sophia believes that they do not assume that A woman in a jacket and scarf looking a table that a man in a black shirt is cooking something on.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles sees that A model is standing next too a blue jeep. Hypothesis: Charles believes that they see that A model is standing next too a blue jeep.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Evelyn suspects that Two children throw dead leaves into the air around them. Hypothesis: Evelyn suspects that they understands that Two children throw dead leaves into the air around them.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that A girl is getting ready to dive into a pool.. Hypothesis: Robert does not believes that it is not that case that A girl is getting ready to dive into a pool.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard believes that A little girl in a blue dress and white shoes is sitting on her red toy tractor, in a dirt road near a fence. Hypothesis: Richard believes that they remembers that A little girl in a blue dress and white shoes is sitting on her red toy tractor, in a dirt road near a fence.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Ava assumes that Woman dressed in red holding two fans, one red and one black. Hypothesis: Ava assumes that they knows that Woman dressed in red holding two fans, one red and one black.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph thinks that Woman wearing a red sweater, brown slacks and a white hat, rollerblading on the street in front of a yellow building.. Hypothesis: Joseph does not thinks that it is not that case that Woman wearing a red sweater, brown slacks and a white hat, rollerblading on the street in front of a yellow building.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William assumes that A baseball pitcher wearing a purple and white uniform throwing a baseball from the mound. Hypothesis: William assumes that they sees that A baseball pitcher wearing a purple and white uniform throwing a baseball from the mound.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard does not believe that A man and a woman dressed in semi-formal attire show faces of excitement looking over a table with Jenga blocks scattered over it. Hypothesis: Richard believes that they do not believe that A man and a woman dressed in semi-formal attire show faces of excitement looking over a table with Jenga blocks scattered over it.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor assumes that A young boy in a cowboy hat and holding some food sits in the back of a small vehicle while an adult leans over in the background next to a large blue device displaying the words 99% Angel.. Hypothesis: Taylor does not assumes that it is not that case that A young boy in a cowboy hat and holding some food sits in the back of a small vehicle while an adult leans over in the background next to a large blue device displaying the words 99% Angel.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Olivia knows that A little boy is standing alone in a wooded park. Hypothesis: Olivia remembers that it is not the case that A little boy is standing alone in a wooded park.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Charles does not suspect that A man bakes in a kitchen while wearing gloves and a hat. Hypothesis: Charles thinks that they do not suspect that A man bakes in a kitchen while wearing gloves and a hat.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert thinks that A young girl wearing a pink coat plays with a yellow toy golf club.. Hypothesis: Robert does not thinks that it is not that case that A young girl wearing a pink coat plays with a yellow toy golf club.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Sophia thinks that This man is trying to make his wife laugh by blowing bubbles in the bathtub.. Hypothesis: Sophia does not thinks that it is not that case that This man is trying to make his wife laugh by blowing bubbles in the bathtub.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert thinks that a man with a tattoo on his arm cooking something in a frying pan.. Hypothesis: Robert does not thinks that it is not that case that a man with a tattoo on his arm cooking something in a frying pan.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Richard thinks that A man in a gray long-sleeved shirt is making a transaction with another person from his street market. Hypothesis: Richard recognizes that they think that A man in a gray long-sleeved shirt is making a transaction with another person from his street market.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Michael knows that A man in an orange kayak and a man in a blue kayak paddle around a beautiful lake. Hypothesis: Michael knows that they know that A man in an orange kayak and a man in a blue kayak paddle around a beautiful lake.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Emma thinks that Hiker in blue shirt and red shorts stands on hill near mountain.. Hypothesis: Emma does not thinks that it is not that case that Hiker in blue shirt and red shorts stands on hill near mountain.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles believes that Three sisters, barefoot in pink dresses and who range in age from preschool to teenager are pictured on a beach as they look out at the Ocean. Hypothesis: Charles believes that they remembers that Three sisters, barefoot in pink dresses and who range in age from preschool to teenager are pictured on a beach as they look out at the Ocean.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James suspects that A man is rock climbing with protective rope. Hypothesis: James suspects that they understands that A man is rock climbing with protective rope.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph learns that Several children in full riding gear are on horseback in a grassy field carrying polo equipment. Hypothesis: Joseph believes that it is not the case that Several children in full riding gear are on horseback in a grassy field carrying polo equipment.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Thomas suspects that Boy with white powder and blue writing on his face. Hypothesis: Thomas does not suspects that it is not that case that Boy with white powder and blue writing on his face", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William assumes that A biker wearing a white t-shirt is jumping over dirt hills.. Hypothesis: William does not assumes that it is not that case that A biker wearing a white t-shirt is jumping over dirt hills.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Abigail remembers that A kid hitting a baseball in a baseball field. Hypothesis: Abigail suspects that it is not the case that A kid hitting a baseball in a baseball field.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph believes that A bundled up Asian girl wearing a Camelbak and walking shoes walking her dog in a snowy forest. Hypothesis: Joseph believes that they sees that A bundled up Asian girl wearing a Camelbak and walking shoes walking her dog in a snowy forest.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Abigail suspects that A man jumps on another man while a crowd looks on.. Hypothesis: Abigail does not suspects that it is not that case that A man jumps on another man while a crowd looks on.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William knows that A man selling donuts to a customer during a world exhibition event held in the city of Angeles Hypothesis: William believes that it is not the case that A man selling donuts to a customer during a world exhibition event held in the city of Angeles", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William sees that A girl is sitting in a chair blowing up a large yellow party balloon. Hypothesis: William understands that they see that A girl is sitting in a chair blowing up a large yellow party balloon.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles assumes that A man with a crop is trying to stay on a rearing horse.. Hypothesis: Charles does not assumes that it is not that case that A man with a crop is trying to stay on a rearing horse.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Taylor suspects that A child is looking at some colorful dresses. Hypothesis: Taylor assumes that it is not the case that A child is looking at some colorful dresses.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Robert believes that A girl is getting ready to dive into a pool.. Hypothesis: Robert does not believes that it is not that case that A girl is getting ready to dive into a pool.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Robert sees that A man with a blue shirt and glasses points to a picture in a book in front of a little girl and a stack of books. Hypothesis: Robert believes that it is not the case that A man with a blue shirt and glasses points to a picture in a book in front of a little girl and a stack of books.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: William believes that A woman with a red and white piece of clothing draped over her arm rides a pink cruiser-style bicycle down a boardwalk. Hypothesis: William suspects that it is not the case that A woman with a red and white piece of clothing draped over her arm rides a pink cruiser-style bicycle down a boardwalk.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Joseph remembers that Three boys are standing on the ledge outside of a building. Hypothesis: Joseph suspects that it is not the case that Three boys are standing on the ledge outside of a building.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Richard does not believe that Construction workers using big hooks. Hypothesis: Richard thinks that they do not believe that Construction workers using big hooks.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: William thinks that A man with a plaid shirt and green hat mows the lawn near the sidewalk.. Hypothesis: William does not thinks that it is not that case that A man with a plaid shirt and green hat mows the lawn near the sidewalk.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella remembers that A large tan dog is rolling around on its back in a yard of grass. Hypothesis: Isabella understands that they remember that A large tan dog is rolling around on its back in a yard of grass.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charlotte believes that One boy is driving a play tractor while the other boy jumps off the back of the play tractor. Hypothesis: Charlotte knows that they believe that One boy is driving a play tractor while the other boy jumps off the back of the play tractor.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Charles learns that Several men in front of a white building. Hypothesis: Charles believes that they learn that Several men in front of a white building.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: Isabella assumes that The man and the lady are wearing glasses and sitting in red chairs talking to John McCain. Hypothesis: Isabella assumes that they learns that The man and the lady are wearing glasses and sitting in red chairs talking to John McCain.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Amelia knows that Two women are embracing while holding to go packages. Hypothesis: Amelia assumes that it is not the case that Two women are embracing while holding to go packages.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Olivia assumes that A man in a restaurant having lunch. Hypothesis: Olivia assumes that they understands that A man in a restaurant having lunch.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Michael thinks that A basset hound is tied to a doorway in an alley in front of a man and woman.. Hypothesis: Michael does not thinks that it is not that case that A basset hound is tied to a doorway in an alley in front of a man and woman.", "target_scores": {"entailment": 1, "non-entailment": 0}}, {"input": "Premise: James thinks that A woman and three children. Hypothesis: James thinks that they knows that A woman and three children.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: Taylor sees that Man wearing dark clothes walks down a street with a wall of graffiti to his left. Hypothesis: Taylor learns that it is not the case that Man wearing dark clothes walks down a street with a wall of graffiti to his left.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: John thinks that Two children feeding horses through a fence. Hypothesis: John thinks that they knows that Two children feeding horses through a fence.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James assumes that A couple are having lunch together. Hypothesis: James sees that it is not the case that A couple are having lunch together.", "target_scores": {"entailment": 0, "non-entailment": 1}}, {"input": "Premise: James sees that A person powerwashing stairs leading down to a pool. Hypothesis: James thinks that it is not the case that A person powerwashing stairs leading down to a pool.", "target_scores": {"entailment": 0, "non-entailment": 1}}]}